{
    "BraTS-GLI-00006-000": "A lesion with approximately round abnormal signal is seen in the left frontal lobe, showing high signal on T1W, T2W, FLAIR sequences, with marked ring-like enhancement on T1C, having unclear borders, measuring about 76*72*69mm. Extensive edema is present in the surrounding brain parenchyma, with compression of the anterior horns of the bilateral lateral ventricles and deviation of midline structures to the right.",
    "BraTS-GLI-00012-000": "Irregular abnormal signal foci are seen in both frontal lobes, crossing the midline, presenting with iso to low signal on T1W with some high signal, mixed high and low signal on T2W and FLAIR, with uneven enhancement on T1C, and indistinct boundaries. The size of the lesion is approximately 84*113*82mm. Surrounding brain parenchymal edema is present, with compression of the left lateral ventricle and rightward deviation of midline structures.",
    "BraTS-GLI-00014-001": "In the left temporal lobe, insular region, and basal ganglia area, there is a mass-like abnormal signal shadow, presenting with slightly low signal on T1-weighted images, isointense signal on T2-weighted images, and slightly high signal on FLAIR. There is uneven mild enhancement following T1 contrast, with clear boundaries. The size of the lesion is approximately 51*70*41 mm, with peritumoral edema. There is no shift of midline structures.",
    "BraTS-GLI-00017-000": "An irregular abnormal signal focus is visible in the left temporal lobe, with isointense signal on T1W, hyperintense signal on T2W and FLAIR sequences, and significant ring-like enhancement on T1C. The lesion has indistinct borders and measures approximately 55*80*73mm. There is extensive edema in the surrounding brain parenchyma, and no midline shift is observed.",
    "BraTS-GLI-00021-000": "In the right frontal lobe and basal ganglia region, there are irregular abnormal signal foci, which manifest as low signal on T1-weighted images with partial high signal, mixed high and low signal on T2-weighted and FLAIR images, and significant ring-like enhancement on T1 post-contrast images. The borders are poorly defined, with dimensions approximately 94*75*65 mm. There is extensive edema in the surrounding brain parenchyma, compression on the anterior horn of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-00024-000": "An abnormal signal focus can be seen in the left temporal lobe, showing slightly low signal on T1-weighted images, high signal on T2-weighted images, and high signal on FLAIR images, with some mixed signals inside, ring-enhancement on post-contrast T1 images, and unclear boundaries. The size is approximately 53*81*65 mm. There is surrounding brain tissue edema; no midline shift is present.",
    "BraTS-GLI-00032-001": "At the junction of the left frontal and parietal lobes, an irregular abnormal signal focus is observed, presenting with low signal intensity on T1W with a small amount of high signal, mixed high and low signal intensity on T2W and FLAIR, and marked ring-like enhancement on T1C. The boundaries are indistinct, and the size is approximately 56*88*76 mm. There is extensive edema in the surrounding brain parenchyma, and the midline structures are slightly shifted to the right.",
    "BraTS-GLI-00045-001": "An irregular abnormal signal focus is seen in the left temporal lobe, exhibiting a slightly low signal on T1-weighted imaging, a high signal on T2-weighted imaging, and a mixed high and low signal on FLAIR. It shows mild and uneven enhancement on T1 post-contrast, with ill-defined boundaries, measuring approximately 36*47*51 mm. There is surrounding cerebral white matter edema, and no midline shift is observed.",
    "BraTS-GLI-00046-000": "At the junction of the right frontal and parietal lobes, a lesion with an approximate round shape is visible, exhibiting mixed signal intensity on T2-weighted and FLAIR sequences, a fluid level inside the lesion, and marked ring-like enhancement on post-contrast T1-weighted images. The lesion measures about 50*54*45 mm. There is surrounding brain parenchymal edema, and no midline shift is observed.",
    "BraTS-GLI-00053-000": "Irregular abnormal signal foci are seen in both frontal lobes and the genu of the corpus callosum, presenting with hypointense T1W imaging coupled with some hyperintense signals, mixed high and low signals on T2W and FLAIR imaging, and significant ring-like enhancement on T1C imaging. The borders are indistinct, and the lesion crosses the midline, measuring approximately 76*90*83mm. There is extensive cerebral edema in the surrounding brain parenchyma, mild compression of the left lateral ventricle, and a rightward deviation of midline structures.",
    "BraTS-GLI-00061-000": "Multiple quasi-circular abnormal signal foci are visible in the left temporal lobe and hippocampus, appearing as low signal on T1W imaging, high signal on T2W and FLAIR imaging with a mixed high and low signal, and showing obvious ring-like enhancement on T1C. The boundaries are not clear. The larger lesion is located in the left hippocampus, containing a fluid level, and measures approximately 40*74*43 mm. There is slight edema in the surrounding brain parenchyma, with no shift of midline structures.",
    "BraTS-GLI-00061-001": "Multiple abnormal signal foci are visible in the left temporal lobe and hippocampus, with the larger ones located in the left hippocampus area, measuring approximately 40*76*53mm, exhibiting mixed high and low signals on T1W, T2W, FLAIR sequences with fluid levels. The remaining lesions show low signal on T1W, mixed high and low signals on T2W, FLAIR sequences, with marked ring-like enhancement on contrast-enhanced T1W images, and indistinct boundaries. There is extensive vasogenic edema in the surrounding brain parenchyma, and no midline shift is observed.",
    "BraTS-GLI-00064-000": "There is an irregular abnormal signal focus in the left frontal operculum region, showing hypointense with some hyperintensity on T1-weighted imaging, mixed high and low signal on T2-weighted and FLAIR sequences, with pronounced ring-like enhancement after contrast (T1C), and undefined borders, measuring approximately 66*117*58 mm. Extensive edema is seen in the surrounding brain parenchyma, slight compression on the left lateral ventricle, and a rightward deviation of midline structures.",
    "BraTS-GLI-00072-001": "A mass-like abnormal signal is seen in the left parietal temporal lobe, presenting as slightly hypointense on T1-weighted images, slightly hyperintense on T2-weighted images, and slightly hyperintense on FLAIR images. There is uneven enhancement following contrast (T1C), with a clear boundary. The size of the lesion is approximately 44*53*37mm, with surrounding edema. There is no midline shift. The posterior horn of the left lateral ventricle is mildly compressed and narrowed.",
    "BraTS-GLI-00099-001": "Multiple round-like abnormal signal foci are present in the right parieto-occipital lobe and splenium of the corpus callosum, which exhibit low signal on T1-weighted images, high signal on T2-weighted images, and low signal on FLAIR images. Patchy and ring-like enhancement is seen on T1-weighted imaging with contrast (T1C), with indistinct boundaries. The largest of these is located in the right parietal lobe, measuring approximately 87*67*84mm. There is extensive edema in the surrounding brain parenchyma, compression on the trigone of the right lateral ventricle, and no shift in the midline structures.",
    "BraTS-GLI-00101-000": "An irregular abnormal signal focus is visible in the right parietal lobe, appearing as hypo-isointense on T1-weighted (T1W) sequence, hyperintense on T2-weighted (T2W) and Fluid-Attenuated Inversion Recovery (FLAIR) sequence, with marked ring-like enhancement on T1 post-contrast (T1C). The boundary is ill-defined, measuring approximately 53*49*59mm. There is surrounding brain parenchymal edema, with no shift of midline structures.",
    "BraTS-GLI-00104-000": "An abnormal signal is observed in the left frontal lobe, showing slightly low signal on T1-weighted (T1W) images, slightly high signal on T2-weighted (T2W) images, and slightly high signal on Fluid Attenuated Inversion Recovery (FLAIR) sequences. The lesion presents with uneven enhancement on T1 post-contrast (T1C) imaging, has a clear boundary, and measures approximately 55*76*54 mm. Peritumoral edema is present. There is a rightward shift of midline structures.",
    "BraTS-GLI-00106-000": "An irregular abnormal signal focus is visible in the right frontal lobe, presenting as a low signal on T1W sequence with a small amount of high signal, a high signal on T2W and FLAIR sequences, and a distinct garland-like enhancement on T1C sequence. The boundary is not clear, and the size is approximately 78*117*78 mm. There is extensive edema in the surrounding brain parenchyma, compression on the right lateral ventricle, and leftward deviation of midline structures.",
    "BraTS-GLI-00108-000": "An irregular abnormal signal focus is seen in the left temporal lobe, displaying a low signal on T1W with localized high signal, and a high signal on T2W and FLAIR. On T1C, there is evident uneven enhancement, with an unclear boundary. The dimensions are approximately 61*76*62mm. There is a significant amount of edema in the surrounding brain parenchyma, and the right lateral ventricle is slightly compressed; there is no shift in midline structures.",
    "BraTS-GLI-00110-000": "A mass-like abnormal signal is seen in the left frontal lobe, showing a slightly low signal on T1-weighted images, a slightly high signal on T2-weighted images, and a slightly high signal on FLAIR images. Post-contrast T1 imaging shows uneven marked enhancement. The lesion has clear boundaries and measures approximately 50*81*63 mm in size. There is peritumoral edema; however, there is no shift of midline structures.",
    "BraTS-GLI-00121-000": "An irregular abnormal signal focus is observed in the left occipital lobe, presenting as a mixed signals of iso- and hypointensity on T1-weighted imaging, hyperintensity on T2-weighted imaging, mixed signals of hyper- and hypointensity on FLAIR, and markedly inhomogeneous enhancement on contrast-enhanced T1 (T1C), with an ill-defined boundary, measuring approximately 51*73*86mm. There is a substantial amount of vasogenic edema in the surrounding brain parenchyma, but no midline shift is observed.",
    "BraTS-GLI-00122-000": "An irregular lesion showing abnormal signals is present in the left parieto-occipito-temporal lobe, showing hypointensity with some hyperintensity on T1-weighted images, mixed high and low signal intensity on T2-weighted and FLAIR sequences, and marked heterogeneous enhancement with a 'ring-enhancement' pattern after administration of contrast on T1-weighted images. The lesion has poorly defined boundaries and measures approximately 46*62*52 mm. There is surrounding white matter edema, with no shift of the midline structures.",
    "BraTS-GLI-00134-000": "An irregular abnormal signal focus can be seen on the left frontal operculum, presenting as T1W hypointense to isointense signal, mixed high and low signal on T2W and FLAIR sequences, and significant heterogeneous ring-like enhancement on T1C, with an indistinct boundary and approximate dimensions of 73*82*77 mm. Surrounding brain parenchyma shows edema, lateral ventricle compression, dilatation of the posterior horn of the right lateral ventricle, and a rightward shift of midline structures.",
    "BraTS-GLI-00140-000": "An irregular abnormal signal focus is observed in the left parietal-occipital lobe, presenting as low signal with slight high signal on T1W, high signal on T2W and FLAIR, and significant 'ring-like' enhancement on T1C. The border is indistinct and the size is approximately 34*39*51 mm. Surrounding brain parenchyma exhibits edema, but there is no shift of midline structures.",
    "BraTS-GLI-00150-000": "On the right side, in the basal ganglia region and the insular-temporal lobe, there is an irregular abnormal signal focus seen. It presents as isointense to low signal on T1-weighted imaging (T1W), mixed high and low signal on T2-weighted imaging (T2W) and FLAIR, with significant circumferential enhancement on T1-weighted imaging post-contrast (T1C), and indistinct borders. The size of the lesion is approximately 80*91*77 mm. There is substantial cerebral edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-00155-000": "In the right basal ganglia region, pons, and brainstem, an irregular abnormal signal focus can be observed, presenting low signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR images, speckled and ring-like enhancement on post-contrast T1 images, with ill-defined boundaries, and measuring approximately 49*52*48 mm. Surrounding brain parenchyma shows edema, with no shift of midline structures.",
    "BraTS-GLI-00156-000": "An irregular abnormal signal is observed in the left frontal lobe, presenting as low signal with sporadic high signal on T1W, hyperintense on T2W, mixed high and low signal on FLAIR, and marked garland-like enhancement on T1C. The boundaries are not well-defined, with an approximate size of 68*74*76mm. There is extensive edema in the surrounding brain parenchyma, compression of the lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-00158-000": "On the right frontal-parietal-temporal lobe, an irregular abnormal signal focus is visible, presenting with low signal on T1W with sparse high signal, mixed high and low signal on T2W and FLAIR sequences, with significant ring-like enhancement on T1C. The border is not clear, with dimensions approximately 77*104*71mm. Extensive cerebral edema is observed in the surrounding brain parenchyma, with compression of the right lateral ventricle and deviation of midline structures to the left.",
    "BraTS-GLI-00159-000": "In the left frontal lobe and the knee of the corpus callosum, there is an irregular abnormal signal focus visible. It shows low signal with a slight high signal on T1W sequence, mixed high and low signal on T2W and FLAIR sequences, and significant ring-like enhancement on T1C (post-contrast T1-weighted) sequence. The boundary is not clear, with an approximate size of 58*70*75 mm. There is extensive edema in the surrounding brain parenchyma, compression of the lateral ventricle, and a rightward shift of midline structures.",
    "BraTS-GLI-00170-000": "An abnormal signal focus can be seen in the right frontal lobe, showing a slightly hypointense signal on T1W, hyperintense signal on T2W, hyperintense signal on FLAIR, and multiple patchy enhancements on T1C with ill-defined borders, measuring approximately 36*47*41mm. The surrounding brain parenchyma shows edema, and there is no midline shift.",
    "BraTS-GLI-00184-000": "In the left basal ganglia region, an irregular abnormal signal focus can be observed, exhibiting iso- to low signal on T1-weighted imaging, mixed high and low signal on T2-weighted and FLAIR sequences, and significant ring-like enhancement on T1 post-contrast imaging. The lesion is poorly demarcated and measures approximately 82*68*60 mm. There is extensive surrounding brain edema, compression of the left lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-00186-000": "On the right side, adjacent to the cerebral falx and within the body of the corpus callosum, there is an irregular abnormal signal lesion visible, exhibiting a low signal on T1-weighted images with some high signal, mixed high and low signal on T2-weighted and FLAIR images, and markedly uneven enhancement on T1-weighted images post-contrast. The lesion's boundaries are not well defined, measuring approximately 57*120*69mm. There is extensive edema in the surrounding brain parenchyma, with a slight leftward shift of the midline structures.",
    "BraTS-GLI-00187-000": "There is an irregular signal abnormality seen in the left frontal lobe, basal ganglia region, and the genu of the corpus callosum, showing hypointense signal on T1-weighted images, hyperintense signal on T2-weighted images, mixed high and low signal on FLAIR, and marked ring-like enhancement on T1-weighted images post-contrast (T1C). The borders are ill-defined. The size of the lesion approximately measures 76*88*86 mm. There is a significant amount of surrounding cerebral edema, compression on the anterior horn of the left lateral ventricle, and a rightward shift of midline structures.",
    "BraTS-GLI-00188-000": "At the junction of the left frontal and parietal lobes, an irregular abnormal signal focus can be observed, which shows a mixed signal of isointense and hypointense on T1-weighted imaging, a mixed signal of hyperintense and hypointense on T2-weighted and FLAIR imaging, and significant garland-like enhancement on contrast-enhanced T1 imaging with an unclear boundary, measuring approximately 44*60*67 mm. There is mild edema in the surrounding brain parenchyma, and no midline shift is observed.",
    "BraTS-GLI-00191-000": "An irregular abnormal signal focus is visible in the left temporal lobe, which appears as low signal on T1W with a small amount of high signal, mixed high and low signal on T2W and FLAIR sequences, and shows obvious flower-ring-like enhancement on T1C with an unclear boundary. The size is approximately 65*115*80mm. There is a significant amount of cerebral edema in the surrounding brain parenchyma, compression on the left lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-00193-000": "Irregular abnormal signal foci can be observed in the thalamus, pons, and brainstem, exhibiting isointense to low signal on T1-weighted images, mixed high and low signals on T2-weighted and FLAIR images, with marked 'garland-like' enhancement on post-contrast T1 images. The lesions are approximately 44*72*75mm in size. There is slight edema in the surrounding brain parenchyma, and no midline shift is observed.",
    "BraTS-GLI-00196-000": "Irregular abnormal signal foci are observed in the right frontal lobe and bilateral body of the corpus callosum, presenting with mostly low signal intensity on T1W images with a few high signals, mixed high and low signal intensity on T2W and FLAIR images, and marked ring-like enhancement on T1C images. The lesions have unclear boundaries and measure approximately 72*79*69mm. Extensive edema is noted in the surrounding brain parenchyma, with dilatation of the right lateral ventricle, and shift of midline structures to the left.",
    "BraTS-GLI-00199-000": "In the left frontal parietal lobe and adjacent to the lateral ventricle, there is an irregular abnormal signal lesion, which is isointense to hypointense on T1W, hyperintense on T2W and FLAIR with mixed signals, and shows a significant garland-like enhancement on T1C. The lesion has an unclear boundary and measures approximately 53*85*59 mm. There is extensive edema in the surrounding brain parenchyma, enlargement of the left lateral ventricle, compression of the right lateral ventricle, and a rightward deviation of midline structures.",
    "BraTS-GLI-00206-000": "At the junction of the right frontal and parietal lobes, there is an irregular abnormal signal focus. It presents with mixed iso- and hypointense signals on T1-weighted imaging, and mixed hyper- and hypointense signals on T2-weighted and FLAIR imaging. After contrast (T1C), there is significant ring-like enhancement. The borders are indistinct, and the size is approximately 38*48*43 mm. There is associated cerebral edema in the surrounding brain parenchyma, but no midline shift is observed.",
    "BraTS-GLI-00218-000": "An abnormal signal focus can be seen in the left frontal lobe, presenting as low signal on T1W, high signal on T2W, high signal on FLAIR, and enhancement on T1C. The boundary is not clear, size approximately 32*43*35mm. There is slight swelling of the surrounding soft tissue, with no midline shift.",
    "BraTS-GLI-00228-000": "At the junction of the left frontal and parietal lobes, there is an irregular abnormal signal focus. It presents as low signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR images, with marked 'ring-like' enhancement on T1-weighted images post-contrast (T1C). The lesion's boundaries are indistinct, measuring approximately 51*57*50 mm. There is extensive edema in the surrounding brain parenchyma, with no midline shift.",
    "BraTS-GLI-00237-000": "An irregular abnormal signal focus can be seen in the left temporal-occipital lobe, presenting as iso to low signal on T1W, mixed high and low signal on T2W and FLAIR, with marked 'ring-like' enhancement on T1C, and indistinct boundaries. The size is approximately 45*64*54mm. There is surrounding brain parenchymal edema, compression of the posterior horn of the left lateral ventricle, with no shift in midline structures.",
    "BraTS-GLI-00242-000": "On the left parietal lobe and adjacent to the posterior horn of the lateral ventricle, there is a mass-like abnormal signal shadow, presenting as a low signal on T1-weighted imaging, a high signal on T2-weighted imaging, and a mixed low and high signal on FLAIR. There is marginal enhancement after contrast (T1C), with a clear border, measuring approximately 100*125*83 mm, and peritumoral edema is present. No midline shift is observed, and the left lateral ventricle is slightly compressed and narrowed.",
    "BraTS-GLI-00247-000": "In the left frontal-temporal-insular region and basal ganglia, an irregular abnormal signal focus is observed, presenting as low signal on T1-weighted images with slight high signal, mixed high and low signals on T2-weighted and FLAIR sequences, and a distinct ring-like enhancement on T1 post-contrast images. The boundary of the lesion is indistinct, with dimensions approximately 53*104*86 mm. There is extensive perilesional brain edema, compression of the left lateral ventricle, and a rightward shift of midline structures.",
    "BraTS-GLI-00283-000": "On the right parietal lobe, bilateral frontal lobes, the body of the corpus callosum, and the septum pellucidum, there are multiple irregular abnormal signal foci. These areas show low signal on T1-weighted imaging, mixed high and low signal on T2-weighted and FLAIR imaging, and patchy, ring-like enhancement on post-contrast T1-weighted imaging with unclear boundaries. The size of the largest lesions is approximately 104*56*68 mm. There is extensive edema in the surrounding brain parenchyma, but no midline shift is observed.",
    "BraTS-GLI-00285-000": "There are abnormal signal foci in the right occipital lobe, which appear as low signal on T1W, high signal on T2W, and high signal on FLAIR. There is uneven enhancement after contrast administration on T1C. The lesion has poorly defined borders, with dimensions approximately 25*29*31mm. There is no midline shift.",
    "BraTS-GLI-00291-000": "Two abnormal signal foci are observed on the right parietal lobe, exhibiting iso to low signal on T1W sequence, high signal on T2W sequence, and mixed high and low signal on FLAIR. The lesions show uneven enhancement on T1C, with indistinct boundaries, and are approximately in 63*54*59 millimeters size. Surrounding brain parenchyma shows edema without midline shift.",
    "BraTS-GLI-00293-000": "An irregular abnormal signal focus is seen in the left frontal lobe, exhibiting low signal on T1-weighted images with a small amount of high signal, mixed high and low signal on T2-weighted and FLAIR images, patchy and ring enhancements on T1 post-contrast, with ill-defined boundaries, measuring approximately 40*63*50mm. There is edema in the surrounding brain parenchyma, with no shift of midline structures.",
    "BraTS-GLI-00298-000": "An irregular abnormal signal focus is seen in the right temporal-occipital lobe, showing hypointense signal with occasional hyperintensity on T1WI, mixed high and low signal on T2WI and FLAIR, and marked 'flower ring' enhancement on T1C. The boundary is not clear, measuring approximately 43*54*52mm. There is surrounding brain parenchymal edema, compression of the posterior horn of the right lateral ventricle, with no shift of midline structures.",
    "BraTS-GLI-00310-000": "Irregular abnormal signal foci can be seen in the right parietal, occipital, temporal lobes, and the splenium of the corpus callosum, presenting with isointense or hypointense signal on T1-weighted images, hyperintense and mixed intensity signals on T2-weighted and FLAIR sequences, with pronounced ring-like enhancement after contrast (T1C). The lesion crosses the midline along the splenium of the corpus callosum with unclear boundaries, measuring approximately 62*74*81 mm. There is extensive edema in the surrounding brain parenchyma, with compression of the posterior horn of the right lateral ventricle, and no midline shift.",
    "BraTS-GLI-00314-000": "In the right frontal-parietal lobe and adjacent to the lateral ventricle, there is an observed mass with abnormal signal intensity. Specifically, it displays slightly low signal on T1-weighted images, iso- to high signal on T2-weighted images, and high signal on FLAIR images. After contrast (T1C), the mass shows uneven edge enhancement with clear boundaries. The size of the mass is approximately 42*58*41 mm. There is minimal peritumoral edema, and there is no shift of midline structures.",
    "BraTS-GLI-00316-000": "In the right frontal lobe and the body of the corpus callosum, there is an irregular abnormal signal lesion with a T1W hypointense signal mixed with slight hyperintense signals, T2W/FLAIR mixed high and low signals, and a T1C marked heterogeneous enhancement resembling a garland. The boundaries are unclear, measuring approximately 51*51*45 mm. There is associated cerebral edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-00320-000": "In the posterior horn of the right lateral ventricle, a mass-like abnormal signal is seen, presenting with slightly low signal on T1-weighted images, slightly high signal on T2-weighted images, and slightly high signal on FLAIR. There is uneven enhancement post-contrast on T1-weighted images (T1C), with clear boundaries. The size is approximately 48*103*55 mm, with peritumoral edema. There is no midline shift.",
    "BraTS-GLI-00322-000": "Irregular abnormal signal foci can be seen in the right frontal lobe, showing low signal on T1W with sparse high signal, mixed high and low signals on T2W and FLAIR, and significant garland-like enhancement on T1C, with unclear boundaries, measuring approximately 58*74*65mm; A quasi-circular abnormal signal focus can be seen adjacent to the falx cerebri in the left frontal lobe, showing low signal on T1W, high signal on T2W and FLAIR, significant garland-like enhancement on T1C, with unclear boundaries, measuring approximately 58*74*65mm. Surrounding brain parenchymal edema is noted around the bilateral frontal lobe lesions, with mild compression on the right lateral ventricle, and no shift in midline structures.",
    "BraTS-GLI-00327-000": "An irregular abnormal signal focus is visible within the left hippocampal region, presenting as iso-low signal on T1W, mixed high signal on T2W and FLAIR, with marked uneven enhancement on T1C. The boundary is not clear, with an approximate size of 62*105*67 mm. There is extensive edema in the surrounding brain parenchyma, compression of the brainstem, and a mild rightward shift of the midline structures.",
    "BraTS-GLI-00336-000": "An irregular abnormal signal focus is observed in the left frontal lobe, presenting as iso to low signal on T1-weighted images, high signal on T2-weighted images, mixed high and low signal on FLAIR, and marked rim enhancement on T1-weighted images with contrast. The lesion has indistinct boundaries and measures approximately 71*94*75mm. There is extensive surrounding brain parenchymal edema, compression of the lateral ventricle, and a rightward shift of midline structures.",
    "BraTS-GLI-00341-000": "An irregular abnormal signal focus is seen in the left parietal lobe, with low signal on T1W, high signal on T2W/FLAIR sequences, and significant ring-like enhancement on T1C. The boundary is poorly defined, and the size measures approximately 37*46*46 mm. There is a large amount of edema in the surrounding brain parenchyma, with compression of the posterior horn of the left lateral ventricle. No midline shift is observed.",
    "BraTS-GLI-00347-000": "An irregular abnormal signal focus is observed in the right basal ganglia region and the insular lobe, presenting as iso- to low signal on T1W, high mixed signal on T2W and FLAIR sequences, and significant ring-like enhancement on T1C. The boundaries are poorly defined, with approximate dimensions of 58*89*72mm. There is extensive perilesional brain parenchymal edema, compression of the right lateral ventricle, and a slight leftward shift of midline structures.",
    "BraTS-GLI-00349-000": "In the right temporal lobe, there is an irregular abnormal signal focus, showing hypointense with some hyperintense areas on T1-weighted imaging (T1W), hyperintense on T2-weighted imaging (T2W), mixed high and low signals on FLAIR, and marked ring-like enhancement on contrast-enhanced T1-weighted imaging (T1C). The lesion measures approximately 56*86*60 mm, with ill-defined borders. There is extensive surrounding brain parenchymal edema, compression of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-00351-000": "In the right temporal lobe, there is a mass-like abnormal signal shadow, showing slightly low signal on T1-weighted images (T1W), high signal on T2-weighted images (T2W), and mixed signal on FLAIR sequences. After contrast administration (T1C), it displays heterogeneous enhancement. The boundary is well-defined, with dimensions approximately 63*97*73 mm. There is peritumoral edema. Midline structures are shifted to the left, and the right lateral ventricle is compressed and narrowed.",
    "BraTS-GLI-00360-000": "In the left parieto-occipital lobe and the splenium of the corpus callosum, irregular abnormal signal foci can be seen, presenting with low signal on T1-weighted images with some high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and significant uneven enhancement on T1 with contrast. The boundaries are indistinct. The lesion crosses the midline along the splenium of the corpus callosum, measuring approximately 56*77*71mm. There is substantial edema in the surrounding brain parenchyma, compression of the posterior horn of the left lateral ventricle, with no midline shift.",
    "BraTS-GLI-00376-000": "A mass-like abnormal signal is visible in the left parietal lobe, presenting as a slightly hypointense signal on T1-weighted images, slightly hyperintense on T2-weighted images, and hypointense on FLAIR sequences. Post-contrast T1-weighted images show peripheral enhancement of the mass, which has clear boundaries and measures approximately 53*55*51mm. There is surrounding edema, but no midline shift detected.",
    "BraTS-GLI-00390-000": "An abnormal signal focus is observed in the left temporal lobe, presenting with low signal on T1-weighted images with a little high signal, high signal on T2-weighted images, and high signal on FLAIR. There is ring enhancement on T1 post-contrast images with unclear boundaries, measuring approximately 34*48*39 mm. Surrounding brain parenchyma shows edema. There is no midline shift.",
    "BraTS-GLI-00395-000": "Irregular abnormal signal foci are visible in the left parieto-occipital lobe, splenium of corpus callosum, and hippocampus, presenting with low signal on T1-weighted imaging and a small amount of high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and marked ring-like enhancement on T1 post-contrast imaging, with indistinct borders, measuring approximately 95*95*70mm. Extensive cerebral edema is evident in the surrounding brain parenchyma, with compression of the posterior horn of the left lateral ventricle, and no shift of midline structures.",
    "BraTS-GLI-00397-000": "Irregular abnormal signal foci are seen in the right frontal-parietal-temporal-occipital lobes and bilateral periventricular areas, showing mixed high and low signals on T1W, T2W, FLAIR sequences, with obvious ring-like enhancement on T1C, unclear boundaries, and lesion crossing the midline, measuring approximately 81*96*82mm. There is a large amount of edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-00400-000": "An irregular abnormal signal focus is observed in the right basal ganglia and insular temporal lobe, displaying isointense to hypointense signal on T1-weighted sequences, hyperintense mixed signal on T2-weighted and FLAIR sequences, with marked 'ring-like' enhancement post-contrast on T1C images. The borders are ill-defined, with dimensions approximately 82*93*86mm. There is extensive cerebral edema in the adjacent brain parenchyma, compression of the right lateral ventricle and leftward shift of midline structures.",
    "BraTS-GLI-00401-000": "A mass-like abnormal signal shadow can be seen in the left frontal lobe, showing a slightly low signal on T1W, high signal on T2W, and slightly high signal on FLAIR. There is non-uniform enhancement of the edges on T1C, with clear boundaries, measuring approximately 80*97*61 mm. Significant peritumoral edema is present. Midline structures are shifted to the right, with compression and narrowing of the anterior horns of both lateral ventricles.",
    "BraTS-GLI-00416-000": "Irregular abnormal signal foci are seen in the right basal ganglia region and the frontotemporal insular lobe, showing low signal on T1W with a slight high signal, mixed high and low signal on T2W and FLAIR, and significant ring-like enhancement on T1C. The margins are not clear, and the approximate size is 71*130*91 mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and left deviation of the midline structures.",
    "BraTS-GLI-00430-000": "An irregular abnormal signal focus can be seen in the right temporal lobe, presenting as isointense to low signal on T1W, mixed high and low signal on T2W and FLAIR, with obvious ring-like enhancement on T1C, unclear boundaries, approximately 59*102*72mm in size. There is a significant amount of edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a mild shift to the left of midline structures.",
    "BraTS-GLI-00443-000": "An irregular abnormal signal focus can be seen in the right parietal lobe, showing iso- to hypointense signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR sequences, with a significant ring-like enhancement on T1 post-contrast, and unclear boundaries, measuring approximately 55*77*80 mm. There is extensive edema in the surrounding brain parenchyma, compression on the posterior horn of the right lateral ventricle, and mild leftward deviation of midline structures.",
    "BraTS-GLI-00444-000": "A mass-like abnormal signal is visible adjacent to the left lateral ventricle, demonstrating slightly low signal on T1W images, slightly high signal on T2W and FLAIR images, with uneven enhancement post-contrast on T1C. The lesion has clear boundaries and measures approximately 40*37*48 mm, with mild surrounding edema. The midline structures are displaced to the right, and the posterior horn of the left lateral ventricle is compressed and narrowed.",
    "BraTS-GLI-00445-000": "A mass-like abnormal signal shadow can be seen in the left parietal-temporal lobe, presenting with a slightly low signal on T1-weighted images, slightly high signal on T2-weighted images, and slightly high signal on FLAIR. After contrast (T1C), there is uneven enhancement. The mass has a clear boundary and measures approximately 90*118*86mm. There is peritumoral edema. The midline structures are shifted to the right, and the posterior horn of the left lateral ventricle is compressed and narrowed.",
    "BraTS-GLI-00453-000": "A mass-like abnormal signal is observed in the left parietal lobe, exhibiting slightly low signal on T1-weighted imaging, slightly high signal on T2-weighted imaging, and slightly high signal on FLAIR. There is uneven, mild enhancement post-contrast on T1C, with a clear boundary. The dimensions are approximately 51*64*69 mm. There is peritumoral edema. The midline structures are slightly deviated to the right, and the posterior horn of the left lateral ventricle is compressed and narrowed.",
    "BraTS-GLI-00456-000": "An irregular abnormal signal focus can be seen in the right frontal lobe, presenting with low signal on T1W images, high signal on T2W and FLAIR sequences, and significant ring-like enhancement on post-contrast T1 images. The boundaries are poorly defined, with dimensions of approximately 89*95*83mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a leftward deviation of midline structures.",
    "BraTS-GLI-00469-000": "An irregular abnormal signal focus is seen in the left frontal parietal lobes and basal ganglia region, characterized by a T1W hypointense signal with some hyperintensity, mixed signal intensity on T2W and FLAIR sequences, and a conspicuous ring-like enhancement with contrast(T1C). The boundaries are not well-defined. Its size measures approximately 65*77*53mm. Extensive edema is present in the surrounding brain parenchyma, compression on the left lateral ventricle is evident, and there is a rightward shift of the midline structures.",
    "BraTS-GLI-00477-001": "Multiple irregular abnormal signal foci can be seen in the left frontal-opercular region and the genu of the corpus callosum, presenting as isointense to low signal on T1-weighted images and high signal on T2-weighted images, with mixed high and low signal on FLAIR sequences. Post-contrast T1-weighted images show marked ring-like enhancement. The larger lesions are located adjacent to the falx cerebri in the left frontal lobe, with some lesions crossing the midline and indistinct boundaries. The size of the largest lesion is approximately 89*112*97mm. There is significant edema in the surrounding brain parenchyma, compression of the frontal horns of the lateral ventricles bilaterally, and a rightward shift of midline structures.",
    "BraTS-GLI-00478-000": "An irregular abnormal signal focus is visible in the right frontal-parietal lobe, presenting as mixed high and low signals on T1W, T2W, and FLAIR sequences. There is notable ring-like enhancement on T1C with ill-defined borders, measuring approximately 55*70*62 mm. There is extensive edema in the surrounding brain parenchyma, slight compression on the right lateral ventricle, and no shift of the midline structures.",
    "BraTS-GLI-00480-001": "An irregular abnormal signal focus is observed in the left parietal-occipital lobe, presenting with low signal on T1-weighted imaging and slight high signal, mixed high and low signal on T2-weighted and FLAIR imaging, and significant ring-like enhancement after contrast (T1C). The margin is ill-defined, with dimensions approximately 55*83*89 mm. There is extensive edema in the surrounding brain parenchyma, compression of the posterior horn of the left lateral ventricle and slight rightward shift of the midline structures.",
    "BraTS-GLI-00488-000": "An irregular abnormal signal focus is visible in the right parieto-occipital lobe, presenting as low signal on T1-weighted images with partial high signal, mixed high and low signal on T2-weighted and FLAIR images, and evident 'ring enhancement' on T1 post-contrast images. The boundary is not well-defined, and the size is approximately 45*66*61 mm. There is surrounding brain parenchymal edema, compression of the posterior horn of the right lateral ventricle, with no shift in midline structures.",
    "BraTS-GLI-00491-000": "An irregular abnormal signal focus is observed in the right parietal lobe, presenting with isointense signal with a slight hyperintensity on T1-weighted images, mixed hyperintense and hypointense signals on T2-weighted and FLAIR images, and marked ring-like enhancement on T1 contrast images. The borders are indistinct, measuring approximately 58*66*66 mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a mild leftward shift of midline structures.",
    "BraTS-GLI-00491-001": "On the right parieto-occipital lobe, an irregular abnormal signal focus can be seen, presenting as low signal with sporadic high signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR sequences, and prominent ring-like enhancement on contrast-enhanced T1 images. The margins are ill-defined, with dimensions of approximately 53*65*68mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-00496-000": "An abnormal signal focus is seen in the right temporal lobe, presenting as isointense on T1-weighted images, hyperintense on T2-weighted and FLAIR images, with obvious nodular enhancement after gadolinium contrast (T1C), and unclear boundaries. The dimensions are approximately 55*76*43 mm. Extensive brain edema is present in the surrounding brain parenchyma, with no significant shift of midline structures.",
    "BraTS-GLI-00498-000": "An irregular lesion displaying abnormal signal intensity is seen in the left temporal lobe, presenting as iso- to hypointense on T1-weighted images, and as hyperintense mixed signals on T2-weighted and FLAIR sequences, with patchy and ring-like enhancements observed on T1 post-contrast. The boundaries are not well defined, with an approximate size of 60*82*70 mm. Extensive perilesional edema is present in the adjacent brain parenchyma, with resultant compression of the left lateral ventricle and a mild shift to the right of the midline structures.",
    "BraTS-GLI-00511-001": "An irregular abnormal signal focus is visible in the left temporal lobe, presenting as low signal on T1W with a slight high signal component, mixed high and low signals on T2W and FLAIR, and marked ring-like enhancement on T1C. The boundary is poorly defined, with approximate dimensions of 61*92*67 mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and a mild shift to the right in midline structures.",
    "BraTS-GLI-00514-001": "At the junction of the left frontal and parietal lobes, there is an approximately round abnormal signal lesion with mixed hyperintense and hypointense signals on T2W and FLAIR sequences, showing uneven enhancement on T1C, with indistinct borders, measuring about 60*103*93 mm. The surrounding brain parenchyma shows significant edema, with no shift of midline structures.",
    "BraTS-GLI-00520-000": "An irregular abnormal signal focus can be observed in the left temporal parietal lobe, presenting as low signal on T1-weighted images with slight hyperintensity, mixed high and low signal on T2-weighted and FLAIR sequences, and notable ring-like enhancement after contrast (T1C), with indistinct boundaries, measuring approximately 46*58*47mm. Extensive edema is present in the surrounding brain parenchyma, with no midline shift.",
    "BraTS-GLI-00525-001": "Irregular abnormal signal foci are observed in the left frontal temporal insula and basal ganglia area, presenting as isointense to low signal on T1-weighted images, and high signal on T2-weighted and FLAIR images. The left temporal lobe exhibits localized ‘garland-like’ enhancement on T1 post-contrast (T1C) images with ill-defined borders, measuring approximately 53*72*67 mm. There is significant associated cerebral edema within the surrounding brain parenchyma, compression of the left lateral ventricle, and a slight rightward shift of the midline structures.",
    "BraTS-GLI-00540-000": "An abnormal signal focus is seen adjacent to the falx cerebri in the right parietal lobe, exhibiting slightly low signal on T1-weighted images, isointense signal on T2-weighted images, and hyperintense signal on FLAIR. After contrast administration (T1C), there is partial spotted enhancement. The boundary is not well-defined, with dimensions approximately 21*45*33 mm. There is a small amount of edema in the surrounding brain parenchyma, and no midline shift is observed.",
    "BraTS-GLI-00542-000": "A mass-like abnormal signal is seen in the left frontal-temporal lobe, presenting as a low signal on T1-weighted imaging and a slightly high mixed signal on T2-weighted and FLAIR imaging, with uneven enhancement on T1 with contrast. The lesion has well-defined boundaries and measures approximately 55*98*58 mm, with surrounding edema. No midline shift is evident.",
    "BraTS-GLI-00547-000": "An irregular abnormal signal focus is visible in the left frontal lobe, presenting as low signal on T1-weighted imaging (T1W), high signal on T2-weighted imaging (T2W) and FLAIR sequences, and a significant ring-like enhancement on contrast-enhanced T1-weighted imaging (T1C). The boundary is not clear, with an approximate size of 46*72*52mm. There is a large amount of edema in the surrounding brain parenchyma, with no shift of midline structures.",
    "BraTS-GLI-00559-000": "In the right frontal lobe, there is an irregular abnormal signal focus visible, showing low signal on T1-weighted images with a slight high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and significant ring-like enhancement on contrast-enhanced T1-weighted images (T1C) with indistinct boundaries, measuring approximately 57*117*60mm. Peripheral brain parenchyma edema is present, with a mild leftward shift of midline structures. On the left temporal operculum, there is a sheet-like abnormal signal shadow, showing isointense signal on T1-weighted images, and high signal on T2-weighted and FLAIR sequences, with no obvious enhancement after contrast.",
    "BraTS-GLI-00575-000": "Irregular abnormal signal foci are observed in the left basal ganglia region and the temporal insular lobe, presenting with low signal intensity on T1-weighted images and high signal intensity on T2-weighted and FLAIR images. Notable ring-like enhancement is seen on contrast-enhanced T1-weighted images (T1C), with indistinct borders, measuring approximately 64*94*68mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and a rightward shift of midline structures.",
    "BraTS-GLI-00590-000": "An irregular abnormal signal focus can be seen in the right temporal lobe, appearing as mixed low signal on T1-weighted images, and mixed high signal on T2-weighted and FLAIR images. There is notable ring-like enhancement following contrast on T1-weighted images. The borders of the lesion are ill-defined, measuring approximately 59*102*79 mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a shift of midline structures to the left.",
    "BraTS-GLI-00598-000": "An irregular abnormal signal focus can be seen in the right temporal lobe, presenting as a low signal on T1W images, a high signal on T2W and FLAIR images, and marked ring-like enhancement on T1C. The boundaries are not clear, with the size approximately 53*101*73mm. There is a significant amount of edema in the surrounding brain parenchyma, mild compression on the right lateral ventricle, and no shift of midline structures.",
    "BraTS-GLI-00599-000": "A mass-like abnormal signal is seen in the right frontal lobe, exhibiting a slightly low signal on T1-weighted imaging (T1W), a slightly high signal on T2-weighted imaging (T2W), and a slightly high signal on Fluid-Attenuated Inversion Recovery (FLAIR). After contrast (T1C), there is uneven mild enhancement. The mass has a clear boundary and measures approximately 59*88*66mm. There is peritumoral edema. The midline structures are shifted to the left, and the anterior horn of the right lateral ventricle is compressed and narrowed.",
    "BraTS-GLI-00604-000": "An irregular abnormal signal focus is observed in the right frontal lobe, showing low signal on T1-weighted imaging with local high signal areas, mixed high and low signal on T2-weighted and FLAIR sequences, inhomogeneously enhanced on contrast-enhanced T1, with indistinct boundaries and multiple vessel shadows within, measuring approximately 73*82*63mm. Perilesional brain parenchyma edema is present, with compression of the right lateral ventricle and leftward shift of the midline structures.",
    "BraTS-GLI-00607-001": "There are two abnormal signal foci in the left frontal-occipital lobe, which appear as low signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR images, and show significant garland-like enhancement on T1-weighted images post-contrast (T1C). The boundaries are ill-defined. The larger focus is located in the left occipital lobe, measuring approximately 74*126*101 mm. Surrounding brain parenchyma shows extensive edema. There is no compression on the lateral ventricles, and midline structures are not shifted.",
    "BraTS-GLI-00613-000": "Multiple irregular abnormal signal foci are visible in the left frontal, parietal, and temporal lobes, adjacent to the lateral ventricle and in the splenium of the corpus callosum, showing low signal on T1W images. Some high signal foci on T1W are seen within the lesions of the left frontal and parietal lobes. Mixed high and low signals are observed on T2W and FLAIR sequences, with marked ring-like and patchy enhancement on T1C. The boundaries are indistinct. The larger lesion located in the left frontal lobe measures approximately 65*97*67mm. There is surrounding cerebral edema, without midline shift.",
    "BraTS-GLI-00623-000": "Irregular abnormal signal foci are seen in the bilateral frontal lobes and the genu of the corpus callosum, displaying isointense to low signal on T1-weighted images and hyperintense mixed signal on T2-weighted and FLAIR sequences, with significant uneven ring-like enhancement on post-contrast T1 images. The borders are ill-defined, measuring approximately 96*98*64mm. Extensive edema is present in the surrounding brain parenchyma, with compression of the anterior horns of the bilateral lateral ventricles and a deviation of the midline structures to the right.",
    "BraTS-GLI-00630-000": "An irregular abnormal signal focus is visible in the left basal ganglia region, presenting as hypointense with slight hyperintensity on T1-weighted (T1W) images, mixed hyperintense and hypointense signals on T2-weighted (T2W) and Fluid-Attenuated Inversion Recovery (FLAIR) images, uneven enhancement on post-contrast T1-weighted (T1C) images, and indistinct borders, measuring approximately 61*52*63mm. Surrounding brain parenchyma shows edema, the left lateral ventricle is compressed, and there is a mild shift of midline structures to the right.",
    "BraTS-GLI-00645-000": "An irregular abnormal signal focus is seen in the left frontal lobe, presenting as a low signal with slight high signal on T1W images, mixed high and low signal on T2W and FLAIR sequences, and marked ring-like enhancement on T1C sequence. The margins are poorly defined, with an approximate size of 34*37*33 mm. The midline structures show no shift.",
    "BraTS-GLI-00652-000": "Multiple irregular abnormal signal foci are observed in the right frontal and temporal lobes, presenting as isointense or hypointense on T1-weighted imaging (T1W), a mix of high and low signals on T2-weighted imaging (T2W) and Fluid-Attenuated Inversion Recovery (FLAIR) sequences. There is marked ring-like enhancement on T1 post-contrast (T1C) with ill-defined borders. The larger lesion is located in the right temporal lobe, measuring approximately 71*91*71 mm, and contains an area of high signal intensity on T1W. Extensive edema is seen in the surrounding brain parenchyma, with compression on the right lateral ventricle and leftward deviation of midline structures.",
    "BraTS-GLI-00667-000": "In the right frontal lobe there is an irregular abnormal signal focus, which crosses the midline, presenting as low signal on T1W with a slight high signal, a mixed high signal on T2W and FLAIR, and significant ring-like enhancement on T1C. The border is not clearly defined, with an approximate size of 61*78*66 mm. Extensive edema is present in the surrounding brain parenchyma, with compression of the anterior horns of both lateral ventricles and left deviation of midline structures.",
    "BraTS-GLI-00676-001": "Irregular abnormal signal foci can be seen in the left frontal lobe, periventricular area, and the body of the corpus callosum, crossing the midline. They exhibit low signal on T1W with a hint of high signal, mixed high and low signal on T2W and FLAIR sequences. Prominent ring-like enhancement is noted on T1C with unclear boundaries. The dimensions of the lesion are approximately 63*60*62 mm. The surrounding brain parenchyma shows significant edema; the lateral ventricle is compressed with a slight rightward shift of the midline structures.",
    "BraTS-GLI-00680-000": "An irregular abnormal signal focus is observed in the left insular lobe, presenting with isointense to low signal on T1-weighted imaging (T1W), high signal on T2-weighted imaging (T2W) and Fluid-attenuated inversion recovery (FLAIR) sequences. There is notable heterogeneous enhancement post-contrast administration on T1-weighted sequences (T1C) with indistinct boundaries. The size of the lesion is approximately 49*87*63 mm. Extensive edema is noted in the surrounding brain parenchyma. The left lateral ventricle is slightly compressed, without displacement of midline structures.",
    "BraTS-GLI-00683-001": "An irregular abnormal signal focus is seen in the left parietal-occipital-temporal lobe, presenting with low signal on T1-weighted images with some high signal, mixed high signal on T2-weighted and FLAIR sequences, and significant garland-like enhancement on T1 post-contrast. The lesion has ill-defined borders and measures approximately 73x100x77mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and a shift of the midline structures to the right.",
    "BraTS-GLI-00686-000": "An irregular abnormal signal focus is observable in the right frontal, temporal, and insular lobes, showing low signal intensity on T1-weighted images with scattered high signal, mixed high and low signal on T2-weighted and FLAIR images, and significant ring-like enhancement on T1 post-contrast images. The borders are indistinct, and the size is approximately 79*111*83 mm. There is a large amount of edema in the surrounding brain parenchyma; the right lateral ventricle is compressed and midline structures are shifted to the left.",
    "BraTS-GLI-00694-001": "A nodular abnormal signal focus is seen in the right parietal lobe, exhibiting slightly low signal on T1WI, high signal on T2WI, and high signal on FLAIR. Post-contrast T1 imaging shows ring enhancement with poorly defined margins, measuring approximately 73*90*75 mm. Surrounding brain parenchyma shows extensive edema, with compression of the right lateral ventricle and a leftward shift of midline structures.",
    "BraTS-GLI-00698-000": "At the junction of the right temporal and parietal lobes, an irregular abnormal signal lesion is seen, presenting with isointense to low signal on T1-weighted images, high mixed signal on T2-weighted and FLAIR images, and marked ring-like enhancement on T1-weighted images with contrast (T1C). The lesion boundaries are poorly defined, measuring approximately 60*84*70mm in size. There is extensive edema in the surrounding brain parenchyma. The right lateral ventricle is slightly compressed, and there is a mild shift of the midline structures to the left.",
    "BraTS-GLI-00706-000": "In the right basal ganglia and insular/temporal lobes, irregular abnormal signal foci can be observed, demonstrating low signal on T1-weighted imaging with a trace of high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and marked 'ring enhancement' on T1-weighted post-contrast images. The lesion displays indistinct borders and measures approximately 63*99*87 mm. There is a significant amount of edema in the surrounding brain parenchyma, right lateral ventricle compression, and leftward deviation of midline structures.",
    "BraTS-GLI-00715-001": "At the junction of the left frontal and parietal lobes, an irregular abnormal signal focus is visible, which appears as a low signal on T1W, mixed high and low signals on T2W and FLAIR, and uneven enhancement on T1C with unclear boundaries. The dimensions are approximately 47*83*62 mm. There is perilesional brain parenchymal edema, but no midline shift.",
    "BraTS-GLI-00716-000": "On the right frontal operculum and basal ganglia region, there is an irregular abnormal signal focus, presenting as low signal with some high signal on T1W, mixed high and low signal on T2W and FLAIR, and conspicuous ring enhancement on T1C with unclear boundaries, measuring approximately 35*62*51 mm. There is extensive edema in the surrounding brain parenchyma, mild compression of the right lateral ventricle, and a slight leftward shift of midline structures.",
    "BraTS-GLI-00725-001": "Multiple irregular abnormal signal foci are observed in the bilateral frontal lobes and the knee of the corpus callosum, showing hypo-intense signal on T1W imaging, hyperintense signal on T2W imaging, mixed high and low signal on FLAIR imaging, and distinct patchy and ring-like enhancement on T1C, with unclear boundaries, measuring approximately 94*92*74mm. Extensive edema is present in the surrounding brain parenchyma, with compression of the frontal horns of the bilateral lateral ventricles. No midline shift is observed.",
    "BraTS-GLI-00728-000": "A nodular abnormal signal shadow can be seen in the left basal ganglia area, showing slightly low signal on T1-weighted images, slightly high signal on T2-weighted images, and slightly high signal on FLAIR, with marked enhancement on T1 contrast, clear boundaries, measuring approximately 32*60*48 mm, with flaky peritumoral edema. There is no shift of midline structures.",
    "BraTS-GLI-00729-001": "A lesion resembling a rounded abnormal signal is visible in the left temporal lobe. It measures approximately 26*38*27 mm and exhibits a low signal on T1-weighted imaging (T1W), and high signal on T2-weighted imaging (T2W) and FLAIR sequences. Post-contrast T1-weighted imaging (T1C) shows pronounced ring-like enhancement. The lesion's boundaries are not well defined. Surrounding brain parenchyma shows edema, with no shift of midline structures.",
    "BraTS-GLI-00734-001": "An irregular abnormal signal focus is visible in the left occipitotemporal lobe, showing a low signal on T1W accompanied by a slight high signal shadow, mixed high and low signals on T2W and FLAIR, and an obvious garland-like enhancement on T1C with ill-defined boundaries. The dimensions are approximately 73*102*94 mm. A large amount of edema is present in the surrounding brain parenchyma, with compression of the left lateral ventricle and deviation of midline structures to the right.",
    "BraTS-GLI-00737-000": "In the left frontal lobe, basal ganglia region, and adjacent to the lateral ventricle, there is a mass-like abnormal signal shadow. It presents as low signal on T1-weighted images, slightly high signal on T2-weighted images, and slightly high signal on FLAIR sequences. After contrast enhancement (T1C), there is uneven enhancement around the margins of the lesion, which are well-defined. The size of the lesion is approximately 44*56*42mm and there is edema around the tumor. There is no midline shift observed.",
    "BraTS-GLI-00742-000": "At the junction of the right frontal and parietal lobes, there is an irregular abnormal signal focus which appears hypointense on T1W, hyperintense on T2W and FLAIR sequences, and demonstrates significant ring-like enhancement on T1C. The lesion's dimensions are approximately 88*117*86mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a shift of the midline structures to the left.",
    "BraTS-GLI-00753-001": "An abnormal signal focus is visible in the right cerebellar hemisphere, presenting as an isointense to low signal on T1W, mixed high and low signals on T2W and FLAIR, with conspicuous ring-like enhancement on T1C. The boundary is ill-defined, with dimensions approximately 28*38*12 mm. Surrounding brain parenchyma edema is present, with no shift of midline structures.",
    "BraTS-GLI-00758-000": "A mass-like abnormal signal is observed within the posterior horn of the left lateral ventricle, presenting as iso- to hypointense on T1W images, mixed signal intensity on T2W images, and mixed signal intensity on FLAIR images. There is uneven enhancement post-contrast on T1C images, with clear boundaries and dimensions approximately 42*64*37mm, including peritumoral edema. There is no midline shift.",
    "BraTS-GLI-00764-000": "Multiple abnormal signal foci are seen in the right frontal, parietal, and occipital lobes, right hippocampus, bilateral periventricular areas, and the splenium of the corpus callosum. These lesions present mixed high and low signals on T1W, T2W, and FLAIR sequences, with significant, irregular ring-like enhancement and indistinct boundaries on T1C. The largest focus is located in the right occipital lobe, measuring approximately 75*106*84mm. Surrounding brain parenchyma shows edema, with a slight left deviation of midline structures.",
    "BraTS-GLI-00765-000": "An irregular lesion with abnormal signal is visible in the right temporal lobe, demonstrating low signal on T1W with a slight high signal, mixed high and low signal on T2W and FLAIR, and obvious 'garland-like' enhancement on T1C. The lesion has an unclear boundary, with an approximate size of 61*104*75 mm. There is substantial edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and left deviation of midline structures.",
    "BraTS-GLI-00772-000": "On the left temporal lobe, an irregular abnormal signal focus can be seen, which appears as low signal on T1W, mixed high and low signal on T2W and FLAIR, and marked ring-like enhancement on T1C. The borders are poorly defined, measuring approximately 35*37*25 mm. Surrounding brain parenchyma shows edema, with no shift in midline structures.",
    "BraTS-GLI-00775-001": "An irregular abnormal signal focus can be seen in the right temporal lobe, which appears as an isointense to hypointense signal on T1-weighted imaging, mixed hyperintense and hypointense signals on T2-weighted and FLAIR sequences, with obvious ring-like enhancement on post-contrast T1-weighted imaging. The boundaries are ill-defined. The size of the lesion is approximately 41*78*50 mm. There is extensive edema in the surrounding brain parenchyma, but no midline shift is observed.",
    "BraTS-GLI-00777-001": "An irregular abnormal signal focus can be seen in the right frontal-parietal-temporal lobe, exhibiting low signal on T1W accompanied by a slight high signal, high signal on T2W and FLAIR, significant ring-like enhancement on T1C, with indistinct boundaries, measuring approximately 61*88*69 mm. Extensive edema is present in the surrounding brain parenchyma, the right lateral ventricle is compressed, and there is a slight shift of midline structures to the left.",
    "BraTS-GLI-00778-000": "An irregular abnormal signal focus is visible in the left temporal lobe, presenting as hypointense on T1W, hyperintense on T2W and FLAIR sequences. It shows significant ring-like enhancement on T1C with unclear boundaries, approximately measuring 48*82*39mm. There is surrounding brain parenchyma edema, but no shift in midline structures.",
    "BraTS-GLI-00801-000": "An irregular abnormal signal focus can be seen in the right temporal-occipital lobe, which presents with low signal on T1-weighted imaging with some high signals, mixed high and low signals on T2-weighted imaging, and FLAIR imaging, and significant ring-like enhancement on T1-contrast imaging, with ill-defined boundaries, approximately 58*78*67 mm in size. There is substantial edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and shift of midline structures to the left.",
    "BraTS-GLI-00819-000": "Irregular abnormal signal foci are seen in the right parieto-occipital lobe and the splenium of the corpus callosum, presenting as iso- to low signal on T1W, mixed high and low signal on T2W/FLAIR, and marked ring-like enhancement on T1C. The boundaries are ill-defined, measuring approximately 67*93*91 mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-00820-000": "Multiple irregular abnormal signal foci are found in the right frontal lobe, basal ganglia region, pons, and brainstem, which appear as iso- to hypointense on T1-weighted images, and hyperintense on T2-weighted and FLAIR images. Post-contrast T1 images show marked patchy and ring-like enhancement, with unclear boundaries, measuring approximately 66*45*77 mm. Surrounding brain parenchymal edema is present, with compression of the right lateral ventricle, and mild leftward shift of the midline structures.",
    "BraTS-GLI-00824-000": "Irregular abnormal signal foci can be seen in both temporal lobes and the splenium of the corpus callosum, presenting with low T1W signals with some high signals, mixed high and low signals on T2W and FLAIR, and uneven ring-like enhancement on T1C. The boundary is not clear, and the size is approximately 66*80*72mm. There is surrounding brain parenchymal edema, with compression on the lateral ventricles, and no midline shift.",
    "BraTS-GLI-00838-000": "Multiple clustered abnormal signal shadows are seen in the right frontal lobe, basal ganglia area, and beside the lateral ventricle, exhibiting slightly low signal on T1-weighted images, slightly high signal on T2-weighted images, and slightly high signal on FLAIR. On T1C (post-contrast T1-weighted imaging), the lesion shows uneven marginal enhancement with clear boundaries, measuring approximately 66*92*66mm, with peritumoral edema. There is a leftward shift of midline structures, and the right lateral ventricle is compressed and narrowed.",
    "BraTS-GLI-00840-000": "A mass-like abnormal signal is seen in the left frontal lobe, presenting as a low signal on T1-weighted images, a high signal on T2-weighted images, and slightly low signal on FLAIR images. The lesion demonstrates uneven enhancement on T1 post-contrast images, with indistinct boundaries, measuring approximately 80*91*82mm, with surrounding edema. No midline shift is observed.",
    "BraTS-GLI-00999-000": "An irregular abnormal signal foci is visible in the right frontal lobe, exhibiting low signal on T1-weighted images, high signal on T2-weighted and FLAIR sequences, and pronounced ring-like enhancement on post-contrast T1 images. The lesion's boundaries are ill-defined, with a size of approximately 74*85*83 mm. There is extensive edema in the surrounding brain parenchyma, compression of the lateral ventricle, and left deviation of midline structures.",
    "BraTS-GLI-01010-000": "An irregular abnormal signal focus is seen in the left temporal-occipital lobe, presenting with iso- to hypointense signal on T1W images, a mixed high and low signal on T2W and FLAIR images, and marked ring-like enhancement on T1W contrast-enhanced images. The border is not well-defined, with approximate dimensions of 54*90*56 mm. Extensive edema is noted in the surrounding brain parenchyma with no midline shift.",
    "BraTS-GLI-01013-000": "An abnormal signal focus is observed in the left parieto-occipital lobe, exhibiting slightly low signal on T1W, high signal on T2W, and high signal on FLAIR sequences. There is notable ring-enhancement on T1W post-contrast (T1C) with ill-defined borders, measuring approximately 50*60*68 mm. Surrounding brain parenchyma shows edema, with no midline shift.",
    "BraTS-GLI-01016-000": "A cluster of abnormal signals is visible in the left temporal lobe, which presents as slightly hypointense on T1-weighted images (T1W), hyperintense on T2-weighted images (T2W), and hyperintense on FLAIR images. Enhancement is uneven after T1 contrast (T1C), and the boundaries are not well defined. The lesion measures approximately 58*95*61 mm, with peritumoral edema. There is no midline shift.",
    "BraTS-GLI-01017-000": "A mass-like abnormal signal is visible in the right frontal lobe, presenting as a slightly low signal on T1W imaging, slightly high signal on T2W imaging, and slightly high signal on FLAIR imaging. There is uneven enhancement post-contrast (T1C). The lesion has clear boundaries and measures approximately 55*93*69 mm. There is peritumoral edema. The midline structures are shifted to the left.",
    "BraTS-GLI-01019-000": "On the left parieto-occipital lobe and the splenium of the corpus callosum, irregular abnormal signal foci are observed, presenting as T1W hypointense to isointense signal, mixed high and low signal on T2W and FLAIR sequences, with significant ring-like enhancement on T1C, and ill-defined borders. The size is approximately 74*87*86 mm. There is extensive edema in the surrounding brain parenchyma, and the posterior horn of the left lateral ventricle is compressed, without displacement of midline structures.",
    "BraTS-GLI-01023-000": "An irregular abnormal signal focus is seen at the junction of the right frontal and parietal lobes, presenting as isointense to low signal on T1W, mixed high and low signal on T2W and FLAIR, and marked ring-like enhancement on T1C with unclear boundaries, measuring approximately 62*63*69 mm. There is extensive edema in the surrounding brain parenchyma, mild compression of the posterior horn of the right lateral ventricle, and no shift of midline structures.",
    "BraTS-GLI-01037-000": "Two irregular abnormal signal foci are visible in the right temporal-occipital lobe, with low signal on T1-weighted imaging with slight high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and obvious 'ring-like' enhancement on T1 post-contrast imaging. The borders are unclear, with the larger lesion located in the right temporal lobe, measuring approximately 68*107*70 mm. There is significant edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-01042-000": "An irregular abnormal signal focus can be seen in the right temporal lobe, which shows as low signal on T1W with slight high signal, mixed high and low signal on T2W and FLAIR sequences, and the T1C sequence shows obvious ring-like enhancement. The boundaries are unclear, with dimensions of approximately 67*110*71 mm. There is a large amount of edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-01044-000": "An irregular abnormal signal focus can be seen in the right temporal and insular lobes, presenting as low signal on T1W images, and high mixed signals on T2W and FLAIR sequences. After administering contrast (T1C), a significant 'ring-like' enhancement is observed. The boundary is not clearly defined, with approximate dimensions of 64*109*100 mm. There is substantial edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a shift of midline structures to the left.",
    "BraTS-GLI-01050-000": "Irregular abnormal signal foci can be observed in the left occipital lobe and thalamus, exhibiting low signal on T1W with a slight high signal, mixed high and low signals on T2W and FLAIR, and uneven enhancement on T1C. The border is indistinct, and the size is approximately 39*89*55mm. There is significant edema of the surrounding brain parenchyma, compression of the left lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-01052-000": "Two irregular abnormal signal foci are observed in both frontal lobes and the genu of corpus callosum, with the larger lesion crossing the midline along the genu of the corpus callosum, exhibiting T1W hypointensity with slight hyperintensity, mixed high and low signals on T2W and FLAIR sequences, significant ring-like enhancement on T1C with unclear boundaries, measuring approximately 72*95*55 mm; the smaller lesion located in the right frontal lobe shows T1W hypointensity, high signal on T2W and FLAIR, significant enhancement on T1C with unclear boundaries, measuring approximately 72*95*55 mm. Surrounding brain parenchyma edema is present, with compression of the anterior horns of the lateral ventricles bilaterally, and no midline shift is observed.",
    "BraTS-GLI-01057-000": "Irregular abnormal signal foci can be seen in the left basal ganglia region, presenting with T1W isointense signal with localized hypointensity, mixed high and low signal on T2W and FLAIR sequences, and significant 'garland-like' enhancement on T1C, with indistinct boundaries, measuring approximately 36*60*49mm. In the left frontal lobe, there is a patchy abnormal signal focus presenting with T1W hypointensity, T2W and FLAIR hyperintensity, with slight enhancement on T1C, and indistinct boundaries, measuring approximately 36*60*49mm. There is surrounding brain parenchymal edema, compression on the left lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-01063-000": "In the right occipital lobe, there is an irregular abnormal signal focus, which shows low signal on T1W with a slight high signal, mixed high and low signals on T2W and FLAIR sequences, and marked ring-like enhancement on T1C. The boundaries are ill-defined, with dimensions approximately 70*106*84mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-01069-000": "An irregular abnormal signal focus is observed in the left parietal-occipital-temporal lobe, showing a low signal on T1W with some high signal, mixed high signal on T2W and FLAIR, and obvious ring-like enhancement on T1C. The boundaries are not clear, measuring approximately 61*94*69mm. There is extensive edema in the surrounding brain parenchyma, compression of the posterior horn of the left lateral ventricle, and deviation of the midline structures to the right.",
    "BraTS-GLI-01074-000": "An irregular abnormal signal focus is observed in the left frontal lobe, presenting as isointense to hypointense on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR sequences, with significant ring-like enhancement seen post gadolinium administration on T1-weighted images. The borders are not well defined, measuring approximately 64*76*64mm. There is extensive edema within the surrounding brain parenchyma, compression of the left lateral ventricle, and a shift of midline structures to the right.",
    "BraTS-GLI-01077-000": "In the right parietal lobe, there is an approximately round-shaped abnormal signal focus, which shows isointense on T1-weighted imaging, hyperintense on T2-weighted and FLAIR sequences, and significant nodular enhancement on T1-weighted imaging post-contrast. The lesion has ill-defined boundaries and measures approximately 23*24*35 mm. Surrounding brain parenchyma shows edema, but there is no midline shift.",
    "BraTS-GLI-01079-000": "An irregular abnormal signal focus can be seen in the left temporal insular lobe, presenting with low signal on T1-weighted imaging with a slight high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and significant ring-like enhancement on T1-weighted imaging with contrast, with indistinct borders, measuring approximately 67*127*95 mm. Extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-01080-000": "An irregular abnormal signal focus is observable in the left parietal temporal lobe, exhibiting a low signal on T1-weighted (T1W) images with localized high signals, mixed high and low signals on T2-weighted (T2W) and FLAIR sequences, and marked 'ring-like' enhancement on T1-weighted contrast-enhanced (T1C) images. The boundary is poorly defined, with dimensions approximately 51*97*70 mm. Extensive edema is present in the surrounding brain parenchyma; the left lateral ventricle is compressed, and there is a slight rightward shift of the midline structures.",
    "BraTS-GLI-01083-000": "An irregular abnormal signal focus is visible in the right frontal temporal lobe, exhibiting low signal on T1W with a slight high signal, mixed high signal on T2W and FLAIR sequences, and significant ring-like enhancement on T1C. The boundary is not clear, with approximate dimensions of 56*86*73 mm. A large amount of edema is present in the surrounding brain parenchyma, the right lateral ventricle is compressed, and there is no shift in midline structures.",
    "BraTS-GLI-01090-000": "The left frontal lobe shows an irregular abnormal signal focus, which presents with mixed high and low signals on T1W, mixed high and low signals on T2W and FLAIR, with uneven enhancement on T1C. The boundaries are not well defined, measuring about 48*72*72mm. Perilesional brain parenchymal edema is noted, with the frontal horn of the left lateral ventricle being compressed, and a shift to the right of midline structures.",
    "BraTS-GLI-01092-000": "An irregular abnormal signal focus can be seen in the left frontal lobe, which is hypointense on T1W images with a few hyperintense spots, hyperintense on T2W images, mixed hypo- and hyperintense on FLAIR, and demonstrates significant ring-like enhancement on T1C (post-contrast). The boundary is poorly defined, with dimensions approximately 62*92*76 mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-01094-000": "An irregular abnormal signal focus is visible in the left parietal lobe, presenting with iso- to hypointense signal on T1-weighted images with a local hyperintense signal, hyperintense signal on T2-weighted images, and mixed high and low signal on FLAIR. After contrast (T1C), the lesion shows a significant ring-like enhancement. The boundaries are ill-defined, measuring approximately 58*77*78 mm. There is considerable edema in the surrounding brain parenchyma, compression of the posterior horn of the left lateral ventricle, and no midline shift is detected.",
    "BraTS-GLI-01105-000": "An irregular abnormal signal focus can be seen in the left temporal lobe, presenting with low signal on T1W with a few high signals, mixed high and low signal on T2W and FLAIR, and significant ring-like enhancement on T1C. The boundary is poorly defined, measuring approximately 69*97*75 mm. There is substantial edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and mild rightward shift of the midline structures.",
    "BraTS-GLI-01106-000": "Multiple irregular abnormal signal foci are observed at the junction of the left frontal and parietal lobes, basal ganglia, pons, and brainstem. The foci exhibit low signal on T1W sequence, high signal on T2W and FLAIR sequences, and significant 'ring enhancement' on T1C. The boundaries of the lesions are not well-defined, measuring approximately 49*78*49mm. There is surrounding brain parenchymal edema, with no shift in midline structures.",
    "BraTS-GLI-01109-000": "Irregular abnormal signal foci are visible in the bilateral parietal lobes and the splenium of the corpus callosum, displaying hypo-intense signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR sequences, and marked ring-like enhancement on post-contrast T1 images. The lesion borders are indistinct, with dimensions of approximately 73*60*51 mm. There is significant edema in the surrounding brain parenchyma, compression of the posterior horns of the lateral ventricles on both sides, with no midline shift.",
    "BraTS-GLI-01110-000": "A lesion resembling a round abnormal signal is seen in the left frontal lobe and the genu of the corpus callosum, presenting as a low signal on T1-weighted images, and high signal on T2-weighted and FLAIR sequences, with marked ring-like enhancement on T1 post-contrast images. The lesion has ill-defined boundaries and measures approximately 66*83*45 mm. There is significant edema in the surrounding brain parenchyma, compression of the anterior horns of the bilateral lateral ventricles, and a rightward shift of midline structures.",
    "BraTS-GLI-01111-000": "There is a mass-like abnormal signal shadow seen in the left frontal-parietal-temporal lobe, the basal ganglia region, and next to the lateral ventricle, which displays mixed high-low signal on T1-weighted images, mixed high-low signal on T2-weighted images, and mixed high-low signal on FLAIR images. There is inhomogeneous enhancement post T1 contrast, with a clear boundary, measuring approximately 62*99*99 mm. Peritumoral edema is present. There is no shift in midline structures, and the left lateral ventricle is slightly compressed and narrowed.",
    "BraTS-GLI-01120-000": "An irregular abnormal signal focus is visible in the left frontal-opercular and basal ganglia region, exhibiting low signal on T1W with a small amount of high signal, high signal on T2W and FLAIR, and marked ring-like enhancement on T1C. The boundary is poorly defined with approximate dimensions of 63*93*64 mm. Surrounding brain parenchyma shows edema, the left lateral ventricle is compressed, and there is a shift of midline structures to the right.",
    "BraTS-GLI-01134-000": "Irregular abnormal signal foci are visible in the right basal ganglia and the frontal operculum, presenting as low signal on T1-weighted imaging with local high signal, mixed high and low signals on T2-weighted and FLAIR sequences, and marked ring-like enhancement on T1 post-contrast imaging with indistinct boundaries, measuring approximately 51*83*66 mm. Extensive edema is noted in the surrounding brain parenchyma with compression of the right lateral ventricle and deviation of midline structures to the left.",
    "BraTS-GLI-01144-000": "A mass-like abnormal signal is observed in the right parietal lobe, presenting with a slightly hypointense signal on T1-weighted images, isointense to hyperintense signal on T2-weighted images, and slightly hyperintense signal on FLAIR. There is inhomogeneous enhancement on post-contrast T1 images. The lesion is clearly demarcated with dimensions of approximately 55*67*70 mm, and is associated with peritumoral edema. There is no shift in the midline structures, and the posterior horn of the right lateral ventricle is slightly compressed and narrowed.",
    "BraTS-GLI-01146-000": "Multiple irregular abnormal signal foci are visible in the right frontal lobe and the knee of the corpus callosum, presenting with mixed high and low signals on T1W, high mixed signals on T2W and FLAIR, and marked patchy and ring-like enhancement on T1C. The boundaries are not clear. The size is approximately 65*77*69mm. Extensive edema is present in the surrounding brain parenchyma, the right lateral ventricle is compressed, and there is a left deviation of the midline structures.",
    "BraTS-GLI-01150-000": "An irregular abnormal signal foci can be seen in the left temporal lobe, presenting as isointense to low signal intensity on T1-weighted images, high mixed signal intensity on T2-weighted and FLAIR sequences, and significant ring-like enhancement on T1 post-contrast images. The lesion has ill-defined boundaries and measures approximately 102*110*72mm. Surrounding brain parenchyma shows edema, with compression on the posterior horn of the left lateral ventricle, and no midline shift observed.",
    "BraTS-GLI-01157-000": "Irregular abnormal signal foci are seen in the right parieto-occipital lobe and bilateral pericallosal regions, presenting as iso- to hypointense on T1W, hyperintense on T2W and FLAIR sequences. Notable ring-like enhancement is observed post-gadolinium (T1C), with indistinct boundaries, measuring approximately 76*99*86 mm. Extensive edema is noted in the surrounding brain parenchyma, with compression of the right lateral ventricle and a mild leftward shift of midline structures.",
    "BraTS-GLI-01161-000": "An irregular abnormal signal focus can be seen in the right temporal-occipital insular lobe, showing low signal on T1-weighted imaging with some areas of high signal, mixed high and low signal on T2-weighted and FLAIR imaging, and marked 'ring-like' enhancement on T1-weighted contrast-enhanced imaging with unclear boundaries, measuring approximately 64*98*65mm. There is significant surrounding cerebral edema, compression on the right lateral ventricle, and a left shift of midline structures.",
    "BraTS-GLI-01167-000": "An irregular abnormal signal focus is found at the junction of the left frontal and parietal lobes, presenting as T1-weighted hypointense to isointense signal, T2-weighted and FLAIR hyperintense mixed signal. After contrast (T1C), there is patchy enhancement. The lesion has ill-defined margins, measuring approximately 61*98*83 mm. There is extensive edema in the surrounding brain parenchyma, compression of the posterior horn of the right lateral ventricle is observed, with no deviation of the midline structures.",
    "BraTS-GLI-01168-000": "A lesion approximating a round shape is visible in the left temporal-insular lobe, exhibiting low signal on T1W images, high signal on T2W and FLAIR images, and marked 'ring-like' enhancement on T1W post-contrast images, with indistinct borders, measuring approximately 48*69*57 mm. There is significant surrounding cerebral edema with compression of the left lateral ventricle and a mild shift to the right of midline structures.",
    "BraTS-GLI-01175-000": "Multiple irregular abnormal signal foci can be seen in the left parieto-occipito-temporal lobe, splenium of the corpus callosum and the right parietal lobe, presenting as T1-weighted hypointensity or isointensity, T2-weighted and FLAIR hyperintense mixed signal, with marked and uneven contrast enhancement on T1C images. Boundaries are ill-defined, and the size is approximately 68*84*77 mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle is noted, and there is a shift of midline structures to the right.",
    "BraTS-GLI-01182-000": "On the right frontal lobe, an irregular abnormal signal focus is observed, showing low signal on T1W, high signal on T2W and FLAIR, with obvious speckled enhancement on T1C. The borders are not well defined, and the size is approximately 89*124*96 mm. Surrounding brain parenchyma shows edema, the anterior horn of the right lateral ventricle is compressed, and there is a leftward shift of midline structures.",
    "BraTS-GLI-01186-000": "An irregular abnormal signal focus is seen in the right frontal parietal lobe, appearing as low signal on T1W imaging with a slight high signal, high signal on T2W and FLAIR imaging with local low signal, and significantly uneven enhancement on T1C. The boundary is not well-defined, with an approximate size of 46*43*50 mm. There is slight edema in the surrounding brain parenchyma, with no shift in midline structures.",
    "BraTS-GLI-01193-000": "An irregular abnormal signal focus is visible in the left temporal lobe, showing low signal on T1W with local high signal, mixed high and low signal on T2W and FLAIR. There is obvious ring-like enhancement on T1C, with the boundary being ill-defined, measuring approximately 51*96*52mm. There is a significant amount of edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and a mild shift to the right of the midline structures.",
    "BraTS-GLI-01197-000": "A mass-like abnormal signal shadow can be seen in the left parietal lobe, presenting with mixed signals on T1-weighted, T2-weighted, and FLAIR sequences. It shows uneven mild enhancement on T1-contrast, with a clear boundary and dimensions of approximately 62*82*76mm. There is surrounding edema. No midline shift is present.",
    "BraTS-GLI-01202-000": "An irregular abnormal signal focus can be seen in the right temporal lobe, which shows iso- to hypo-intense signal on T1-weighted images, hyperintense signal on T2-weighted images, mixed high and low signal on FLAIR, and prominent ring-like enhancement on T1-weighted images post-contrast (T1C). The boundaries are not clear, with the size approximately 94*111*84 mm. There is a significant amount of edema within the surrounding brain parenchyma, compression of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-01209-000": "An irregular abnormal signal focus is observed in the right occipito-temporal lobe, showing low signal with slight high signal on T1W, mixed high and low signals on T2W and FLAIR sequences, and significant ring enhancement on T1C with ill-defined boundaries. Dimensions are approximately 77*125*82mm. Extensive brain parenchymal edema is present surrounding the area, resulting in compression of the right lateral ventricle and deviation of midline structures to the left.",
    "BraTS-GLI-01221-000": "On the right frontal, insular, temporal lobes, and the basal ganglia region irregular abnormal signal foci are seen. These exhibit low signal on T1-weighted (T1W) images, and high signal on T2-weighted (T2W) and FLAIR sequences. With T1 post-contrast (T1C), there's marked annular enhancement. The borders are ill-defined, with the size approximately 68*139*81mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-01223-000": "An abnormal signal focus is observed adjacent to the lateral ventricle of the left frontal lobe, exhibiting mixed high and low signals on T1W, T2W, and FLAIR sequences, with a marked ring enhancement on T1C. The lesion has ill-defined boundaries and measures approximately 67*66*78mm. Perilesional brain parenchyma shows edema, the left lateral ventricle is compressed, and there is a rightward shift of the midline structures.",
    "BraTS-GLI-01238-000": "A mass-like abnormal signal is observed in the right parieto-occipital lobe, showing slightly low signal on T1-weighted images, slightly high signal on T2-weighted images, and slightly high signal on FLAIR. Post-contrast T1 imaging shows uneven enhancement. The lesion has a clear boundary and measures approximately 55*94*88mm, with perilesional edema. There is no midline shift. The posterior horn of the right lateral ventricle is mildly compressed and narrowed.",
    "BraTS-GLI-01252-000": "An abnormal signal focus is seen adjacent to the falx in the left parietal lobe, presenting as hypointense/isointense on T1W, hyperintense on T2W, hyperintense on FLAIR, and showing uneven enhancement on T1C. The border is ill-defined, with dimensions approximately 24*41*47 mm. There is perilesional cerebral edema, with no midline shift.",
    "BraTS-GLI-01259-000": "Multiple irregular abnormal signal foci are visible in the left basal ganglia and temporal lobe region, presenting with low signal on T1-weighted images, mixed high and low signals on T2-weighted and FLAIR images, and conspicuous ring-like enhancement on T1-weighted images post-contrast. The boundaries are ill-defined, with dimensions of approximately 61*80*58 mm. There is extensive edema in the surrounding brain parenchyma, the left lateral ventricle is compressed, and there is a mild rightward shift of the midline structures.",
    "BraTS-GLI-01262-000": "In the left frontal-parietal lobe and the pressure part of the corpus callosum, there is an irregular abnormal signal focus, which shows low signal on T1W with a few high signals, mixed high and low signal on T2W and FLAIR, and marked ring-like enhancement on T1C. The boundary is not clear, with a size of approximately 108*148*96mm. There is a significant amount of edema in the surrounding brain parenchyma, with no shift of midline structures.",
    "BraTS-GLI-01266-000": "An irregular abnormal signal focus can be seen in the left frontal lobe, presenting as a low signal on T1-weighted images, and a high signal on T2-weighted and FLAIR sequences, with nodular and ring-like enhancement on T1 contrast, and indistinct boundaries, measuring approximately 75*112*83mm. There is significant edema in the surrounding brain parenchyma, with compression of the lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-01268-000": "Two quasi-circular abnormal signal lesions can be visualized in the left parietal lobe, exhibiting mixed high and low signals on T1W, T2W, FLAIR sequences, and showing marked ring-like enhancement on T1C. The borders are not well-defined, with the larger one measuring approximately 53*60*52mm. Surrounding brain parenchyma edema is present. There is no obvious compression of the lateral ventricles, and no shift in midline structures.",
    "BraTS-GLI-01269-000": "An irregular abnormal signal focus can be seen in the left parieto-occipital lobe, showing low signal on T1-weighted imaging with a small amount of high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and marked ring-like enhancement on contrast-enhanced T1-weighted imaging. The boundaries are not clear, with dimensions of approximately 55*111*83mm. There is a large amount of edema in the surrounding brain parenchyma, compression of the posterior horn of the left lateral ventricle, and no shift of midline structures.",
    "BraTS-GLI-01284-000": "An irregular abnormal signal focus is observed in the right frontal-parietal-occipital-temporal lobe, showing a low signal on T1W with a small amount of high signal, mixed high and low signal on T2W and FLAIR. Notable garland-like enhancement is seen on T1C, with unclear boundaries, measuring approximately 64*104*79 mm. Extensive surrounding cerebral parenchyma edema, compression of the right lateral ventricle, and slight left deviation of midline structures.",
    "BraTS-GLI-01285-000": "Two irregular abnormal signal foci are visible in the left frontal temporal lobe, showing hypo-intense signal with a slight hyper-intense signal on T1W images, mixed high and low signal on T2W and FLAIR sequences, and marked 'garland-like' enhancement on T1C images. The borders are not well-defined, with approximate dimensions of 61*112*74mm. Extensive edema is noted in the surrounding brain parenchyma, with compression of the left lateral ventricle and a rightward shift of midline structures.",
    "BraTS-GLI-01286-000": "An irregular signal abnormality is observed in the left frontal operculum and basal ganglia region, which appears as mixed signal intensity on T2-weighted and FLAIR sequences and showing a hypointense signal with small areas of hyperintensity on T1-weighted images. Post-contrast T1-weighted images demonstrate significant ring-like enhancement of the lesion. The lesion has unclear boundaries and measures approximately 59*113*82 mm. There is substantial perilesional brain edema, compression on the left lateral ventricle, and slight rightward shift of midline structures.",
    "BraTS-GLI-01288-000": "An irregular abnormal signal focus is observed on the left frontal lobe and basal ganglia area. It is hypointense on T1-weighted imaging with slight hyperintense signals, and presents with mixed high and low signals on T2-weighted and FLAIR images. Post-contrast T1 imaging shows significant ring-like enhancement. The lesion crosses the midline, with unclear boundaries, approximately 66*91*71 mm in size. There is extensive edema in the surrounding brain parenchyma, compression of the lateral ventricles, and shift of midline structures to the right.",
    "BraTS-GLI-01294-000": "Multiple irregular abnormal signal foci can be seen in the left frontal-temporal-insular lobes, presenting as iso- to hypointense on T1-weighted images and hyperintense with mixed signals on T2-weighted and FLAIR images. Patchy and ring-like enhancements are noted post-contrast (T1C), with ill-defined boundaries, the largest of which is located in the left frontal lobe, measuring approximately 51*98*66mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and slight rightward deviation of the midline structures.",
    "BraTS-GLI-01307-000": "An irregular abnormal signal focus is visible in the left frontal lobe, presenting as isointense to hypointense on T1W images, hyperintense on T2W images, and mixed high and low signals on FLAIR images. Notable ring-like enhancement is seen following T1C, with unclear boundaries, measuring approximately 76*88*85mm. There is extensive edema in the surrounding brain parenchyma, compression of the frontal horns of both lateral ventricles, and a rightward shift of the midline structures.",
    "BraTS-GLI-01313-000": "A lesion with a quasi-circular abnormal signal is observed in the left frontal parietal occipital lobe, showing a T1W hypointense signal with a trace of hyperintense, mixed high and low signal on T2W/FLAIR, and obvious ring-like enhancement on T1C with unclear boundaries, measuring approximately 62*94*80mm. There is extensive cerebral edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and shift of midline structures to the right.",
    "BraTS-GLI-01324-000": "An irregular abnormal signal focus is observed in the right frontal lobe, displaying low signal on T1-weighted images, high signal on T2-weighted images, and mixed high and low signal on FLAIR. There is marked 'ring-like' enhancement post-contrast on T1-weighted images. The borders are poorly defined. The size is approximately 89*110*96 mm. Extensive edema is present in the surrounding brain parenchyma, bilateral lateral ventricles are compressed, and there is a shift of midline structures to the left.",
    "BraTS-GLI-01330-000": "Irregular abnormal signal foci can be seen in the left hippocampus and temporal lobe, exhibiting isointense to low signal on T1W, and hyperintense signal on T2W and FLAIR sequences. There is evident ring-like enhancement on T1C with unclear boundaries, measuring approximately 46*72*65mm. There is surrounding brain parenchymal edema, compression of the lower angle of the left lateral ventricle, and no midline shift.",
    "BraTS-GLI-01337-000": "An irregular abnormal signal focus is visible in the left occipital lobe, displaying low signal on T1-weighted (T1W) imaging with a small amount of high signal, mixed high signal on T2-weighted (T2W) and FLAIR sequences, and significant ring-like enhancement on contrast-enhanced T1 (T1C) imaging. The focus has indistinct boundaries and measures approximately 54*62*81 mm. There is surrounding brain parenchymal edema, and the posterior horn of the left lateral ventricle is compressed. No midline shift is observed.",
    "BraTS-GLI-01340-000": "An irregular abnormal signal focus is seen in the right frontal-parietal lobe, presenting as isointense to hypointense on T1-weighted imaging, hyperintense with mixed signals on T2-weighted and FLAIR sequences, and significant ring-like enhancement on contrast-enhanced T1-weighted imaging (T1C). The focus has ill-defined borders and measures approximately 46*65*43 mm. There is surrounding brain parenchyma edema, but no midline shift is observed.",
    "BraTS-GLI-01345-000": "An irregular abnormal signal focus can be seen in the left temporal lobe, which appears as low signal on T1W with partial high signal, mixed high and low signal on T2W and FLAIR, and significant ring-like enhancement on T1C with ill-defined boundaries, measuring approximately 47*66*53mm. There is a large amount of edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and a slight right shift of the midline structures. In the right parietal lobe, there is a patchy abnormal signal shadow, showing iso signal on T1W, and high signal on T2W and FLAIR, with no obvious enhancement after contrast.",
    "BraTS-GLI-01348-000": "An irregular abnormal signal focus is observed in the left parietal lobe, displaying low signal on T1W with a small amount of high signal, mixed high and low signal on T2W and FLAIR sequences, and marked ring-like enhancement on T1C. The boundary is poorly defined, with dimensions approximately 41*80*56mm. Perilesional brain parenchyma edema is present, and there is no midline shift.",
    "BraTS-GLI-01351-000": "An irregular abnormal signal focus can be seen in the left temporal lobe, presenting as low signal on T1-weighted images with local high signal areas. On T2-weighted and FLAIR images, there are mixed high and low signals. After contrast (T1C), there is obvious ring-like enhancement, and the boundary is not clear, measuring approximately 62*82*69mm. There is a significant amount of edema in the surrounding brain parenchyma. The left lateral ventricle is compressed, and there is a slight deviation of midline structures to the right.",
    "BraTS-GLI-01355-000": "A mass-like abnormal signal is observable in the left temporal lobe. It appears as a slightly hypointense signal on T1W, hyperintense signal on T2W, iso- to hyperintense signal on FLAIR, with uneven enhancement post-contrast (T1C). The mass has well-defined boundaries, measuring approximately 59*81*67mm, with peritumoral edema. There is rightward deviation of midline structures and compression with narrowing of the left lateral ventricle.",
    "BraTS-GLI-01357-000": "An irregular abnormal signal foci can be seen in the right parietal lobe, displaying low signal intensity on T1-weighted images, high signal intensity on T2-weighted images, mixed signal intensity on FLAIR, and significant heterogenous enhancement post contrast with a 'ring-like' appearance on T1C. The boundaries of the lesion are indistinct, measuring approximately 62*72*75 mm. There is substantial surrounding brain parenchymal edema, compression of the posterior horn of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-01358-000": "An irregular abnormal signal focus is observed in the right parieto-occipital lobe, which presents as a mixed signal of hypo- to isointensity with occasional hyperintensity on T1W imaging, mixed high and low signal on T2W and FLAIR sequences, and marked 'ring-like' enhancement on T1C imaging. The lesion has indistinct boundaries and approximately measures 68*99*74 mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-01365-000": "At the junction of the right frontal and parietal lobes, an irregular abnormal signal focus is observed. It presents as iso-signal on T1W, hyperintense on T2W and FLAIR, and demonstrates significant uneven enhancement on T1C. The boundary is ill-defined, with a size of approximately 42*78*41 mm. There is surrounding brain parenchymal edema, but no midline shift.",
    "BraTS-GLI-01377-000": "Irregular abnormal signal foci are seen in bilateral frontal lobes, the genu and body of the corpus callosum, showing isointense to low signal on T1W, and high signal on T2W and FLAIR sequences. There is marked enhancement on T1C. The boundaries are not clear, and the size is approximately 86*82*70 mm. Midline structures show no shift.",
    "BraTS-GLI-01394-000": "Two lesions resembling a round shape can be seen in the left parieto-occipito-temporal lobe, displaying low signal intensity on T1-weighted images and mixed high and low signal on T2-weighted and FLAIR images. After contrast (T1C), there is significant ring-like enhancement, with indistinct boundaries. The approximate size of the lesions is 48*72*64mm. Surrounding brain parenchyma shows edema, but there is no shift of midline structures.",
    "BraTS-GLI-01413-000": "There is an irregular abnormal signal focus in the right parietal lobe and the splenium of the corpus callosum, presenting as a hypointense signal on T1-weighted images and hyperintense on T2-weighted and FLAIR images. There is marked heterogeneous enhancement on T1 post-contrast series. The boundary is not clear, and the lesion crosses the midline along the splenium of the corpus callosum, measuring approximately 100*87*83 mm. There is extensive edema in the surrounding brain parenchyma. The posterior horn of the right lateral ventricle is compressed, and there is a slight leftward deviation of midline structures.",
    "BraTS-GLI-01431-000": "A mass-like abnormal signal is visible in the right thalamus, exhibiting slightly low signal on T1-weighted images, slightly high signal on T2-weighted images and FLAIR images, and uneven enhancement on T1 contrast. The lesion has a clear boundary and measures approximately 55*53*49 mm with peritumoral edema. There is a leftward shift of the midline structures.",
    "BraTS-GLI-01436-000": "An approximately round-shaped abnormal signal focus is visible on the left frontoinsula and basal ganglia region, demonstrating low signal on T1-weighted images with some high signal, mixed high and low signal on T2-weighted and FLAIR images, and partial, patchy enhancement on T1 contrast-enhanced images. The lesion size is approximately 46*61*57mm. There is extensive edema in the surrounding brain parenchyma with compression of the right lateral ventricle and a slight shift of the midline structures to the left.",
    "BraTS-GLI-01437-000": "An abnormal round-like signal lesion is observed in the left frontal lobe, characterized as isointense to hypointense on T1-weighted imaging, hyperintense on T2-weighted and FLAIR sequences, with slight heterogeneous enhancement post-contrast on T1, and poorly defined borders. The lesion measures approximately 49*64*50mm. There is surrounding brain parenchymal edema, and no midline shift is observed.",
    "BraTS-GLI-01439-000": "An irregular abnormal signal focus is seen in the right temporal lobe, displaying hypo-signal on T1WI, hyper-signal on T2WI, and hyper-signal on FLAIR sequence. Post-contrast T1-weighted images show uneven slight enhancement. The lesion has ill-defined borders and measures approximately 35*54*28mm. There is surrounding brain parenchymal edema, but the midline structures are not shifted.",
    "BraTS-GLI-01440-000": "An irregular abnormal signal focus is observed in the left frontal lobe, with mixed T1W hypointense and a few hyperintense signals. T2W and FLAIR sequences exhibit mixed high and low signals. There is ring-like enhancement on T1C, with ill-defined borders. The focus measures approximately 40*50*45 mm. There is surrounding cerebral edema, mild compression of the anterior horn of the left lateral ventricle, and a slight rightward shift of midline structures.",
    "BraTS-GLI-01447-000": "On the right parietal lobe, there is an irregular abnormal signal focus, demonstrating iso- to low signal on T1-weighted images, heterogeneous high signal on T2-weighted and FLAIR sequences, and marked ring-like enhancement on T1 post-contrast (T1C), with indistinct boundaries, measuring approximately 50*72*62mm. Extensive edema is noted in the surrounding brain parenchyma, with compression on the posterior horn of the right lateral ventricle. No midline shift is observed.",
    "BraTS-GLI-01452-000": "A lesion resembling a round shape can be seen in the left parietal lobe, which appears isointense to hypointense on T1-weighted images and shows mixed hyperintense and hypointense signals on T2-weighted and FLAIR sequences, with a prominent ring-like enhancement on T1 post-contrast imaging. The lesion has indistinct borders, measuring approximately 53*50*53mm. There is cerebral edema in the surrounding brain parenchyma, with no midline shift observed.",
    "BraTS-GLI-01456-000": "An irregular abnormal signal focus is observed in the right temporal lobe, presenting as low signal intensity on T1W and high signal intensity on T2W and FLAIR sequences. Post-contrast T1W (T1C) shows marked ring-like enhancement. The boundary is unclear, measuring approximately 60 x 82 x 61 mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a leftward shift of the midline structures.",
    "BraTS-GLI-01457-000": "An irregular abnormal signal focus is observed in the left temporal lobe, displaying low signal intensity on T1-weighted images and mixed high signal intensity on T2-weighted and FLAIR sequences. Post-contrast administration shows patchy and ring-like enhancement with unclear boundaries, measuring approximately 53*76*59 mm. Extensive edema is present in the surrounding brain parenchyma, with slight compression of the left lateral ventricle and mild deviation of midline structures to the right.",
    "BraTS-GLI-01459-000": "An irregular abnormal signal focus is seen in the left temporal lobe, exhibiting low signal on T1-weighted imaging, high signal on T2-weighted and FLAIR sequences, and significant ring-like enhancement on post-contrast T1-weighted imaging, with ill-defined boundaries, measuring approximately 40*42*40 mm. There is extensive pericerebral edema, without shift of midline structures.",
    "BraTS-GLI-01476-000": "In the right basal ganglia and insular region, an approximately round-shaped abnormal signal focus is observed. It is hypo-intense on T1-weighted images with a slight hyperintense signal, hyperintense on T2-weighted and FLAIR images. After contrast (T1C), there is partial patchy enhancement with unclear boundaries. The dimensions of the lesion are approximately 42*61*62 mm. There is surrounding brain parenchyma edema, compression of the right lateral ventricle, and a mild shift of the midline structures to the left.",
    "BraTS-GLI-01479-000": "A mass-like abnormal signal is visible in the right frontal lobe, presenting as isointense to hypointense on T1W, mixed signal intensity on T2W, mixed signal intensity on FLAIR, with non-uniform enhancement post-contrast (T1C). The margin is indistinct. The size is approximately 92*86*82 mm. There is slight surrounding edema. The midline structures are deviated to the left, and the bilateral lateral ventricles are compressed and narrowed.",
    "BraTS-GLI-01480-000": "An irregular abnormal signal focus is observed in the left temporal lobe and hippocampal region, presenting as isointense signal on T1-weighted imaging, mixed high and low signal on T2-weighted and FLAIR sequences, with localized patchy enhancement on T1 post-contrast imaging. The boundaries are ill-defined, and the size is approximately 54*74*45 mm. There is extensive edema in the surrounding brain parenchyma, mild compression of the left lateral ventricle, and no shift in midline structures.",
    "BraTS-GLI-01482-000": "A patchy abnormal signal focus is observed in the left parietal lobe, exhibiting as low signal on T1W, high signal on T2W, and high signal on FLAIR sequences, with patchy and ring-like enhancement on T1C. The lesion has indistinct boundaries and measures approximately 53*68*71 mm. There is surrounding brain parenchymal edema, with no midline shift.",
    "BraTS-GLI-01486-000": "An irregular abnormal signal focus is seen in the right basal ganglia region and the insula, presenting as low signal on T1-weighted imaging and high signal on T2-weighted and FLAIR sequences, with no significant enhancement on T1 post-contrast. The margins are not clearly defined, with approximate dimensions of 69*93*83 mm. There is surrounding brain parenchymal edema, compression of the right lateral ventricle, and mild leftward shift of the midline structures.",
    "BraTS-GLI-01494-000": "A lesion with a quasi-circular abnormal signal is visible in the right frontal operculum, presenting as low signal on T1-weighted imaging with some high signal, mixed high and low signal on T2-weighted and FLAIR imaging, and uneven enhancement on T1-weighted imaging with contrast (T1C). The lesion has ill-defined borders and measures approximately 76*104*82 mm. There is significant surrounding edema in the brain parenchyma, with compression of the right lateral ventricle and a leftward shift of midline structures.",
    "BraTS-GLI-01497-000": "An irregular abnormal signal focus is visible in the right temporal-occipital lobe, exhibiting low signal on T1W with localized high signals, mixed high and low signal on T2W and FLAIR, nodular and ring-like enhancement on T1C, with indistinct boundaries, measuring approximately 55*79*56mm. There is extensive edema of the surrounding brain parenchyma, compression of the posterior horn of the right lateral ventricle, and a slight left deviation of midline structures.",
    "BraTS-GLI-01502-000": "An abnormal signal focus is observed in the left parietal lobe, presenting as hypointense on T1-weighted images, hyperintense on T2-weighted images, and hyperintense on FLAIR images. There is no significant enhancement after contrast (T1C) administration. The boundaries are indistinct, with dimensions of approximately 63*69*78mm. There is no midline shift.",
    "BraTS-GLI-01503-000": "An irregular abnormal signal lesion is visible in the right frontal lobe, presenting with isointense signal on T1-weighted imaging, hyperintense signal on T2-weighted and FLAIR imaging, and patchy enhancement on T1 post-contrast. The boundaries are ill-defined, with the lesion measuring approximately 48*76*57mm. There is extensive edema in the surrounding brain parenchyma. The anterior horn of the right lateral ventricle is compressed, with a slight leftward deviation of midline structures.",
    "BraTS-GLI-01518-000": "An irregular abnormal signal focus is observed in the right frontal parietal lobe, which presents as iso- to hypointense on T1W images, hyperintense on T2W images, and mixed high and low signals on FLAIR images. After contrast administration, there is partial patchy enhancement. The boundary is indistinct, and measures approximately 73*99*76mm. Extensive cerebral edema is present in the surrounding brain parenchyma. The right lateral ventricle is compressed, with a shift of midline structures to the left.",
    "BraTS-GLI-01519-000": "A mass-like abnormal signal is observed in the left parietal lobe, presenting as slightly hypointense on T1-weighted images, slightly hyperintense on T2-weighted images, and slightly hyperintense on FLAIR. Post-contrast T1 images show uneven enhancement. The lesion has clear boundaries and measures approximately 51*51*51 mm, with surrounding edema. No midline shift is observed.",
    "BraTS-GLI-01524-000": "An irregular abnormal signal focus is seen on the right temporal lobe, displaying mixed iso- to hypointense signal on T1-weighted imaging, hyperintense signal on T2-weighted imaging, mixed hyperintense and hypointense signal on FLAIR imaging, with indistinct enhancement on T1-weighted imaging with contrast. The lesion has poorly defined borders and measures approximately 60*86*59 mm. Surrounding brain parenchyma shows edema, with compression of the right lateral ventricle and a leftward shift of midline structures.",
    "BraTS-GLI-01535-000": "Irregular abnormal signal foci can be seen in the left frontal-opercular-temporal lobe, presenting as low signal on T1-weighted imaging (T1W), high signal on T2-weighted imaging (T2W) and Fluid Attenuated Inversion Recovery (FLAIR), with marked ring-like enhancement on contrast (T1C). The boundaries are not clearly defined, with an approximate size of 55*62*54 mm. Perilesional brain parenchyma shows edema, without any shift of midline structures.",
    "BraTS-GLI-01661-000": "In the left temporal lobe and hippocampus, there is an irregular lesion with abnormal signal intensity, presenting as low signal with some high signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR sequences, and markedly heterogeneous enhancement on T1 contrast-enhanced images. The lesion has poorly defined borders and measures approximately 74*87*78 mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and a shift of midline structures to the right."
}