{
    "BraTS-MET-00002-000": "Multiple punctate, patchy, and nodular abnormal signals are observed in the right cerebral hemisphere, left frontal lobe, and bilateral cerebellar hemispheres. The larger lesion, located in the left cerebellar hemisphere, displays a slightly hypointense signal on T1-weighted images, mixed signals on T2-weighted and FLAIR sequences, with surrounding extensive edema. On T1-weighted images with contrast (T1C), there is obvious enhancement of the lesion, measuring approximately 45*39*47 mm. There is no displacement of midline structures.",
    "BraTS-MET-00003-000": "A large cystic-solid occupying mass is visible within the right lateral ventricle, presenting with mixed signal intensity on T2W imaging and iso- to hypointense signal on T1W imaging. Post-contrast, the solid portion of the lesion demonstrates significant enhancement, measuring approximately 70*127*88 mm. Multiple punctate to patchy abnormal signal shadows are seen in both frontal lobes, the left temporal lobe, the right occipital lobe, and both cerebellar hemispheres, the largest of which is located in the left temporal lobe. This lesion shows low signal on T1W, high signal on T2W, and low signal on FLAIR imaging, with post-contrast ring enhancement and a size of about 70*127*88 mm. There is no displacement of midline structures.",
    "BraTS-MET-00004-000": "Multiple patchy abnormal signal shadows are visible in the left cerebellar hemisphere, occipital lobe, and adjacent to the anterior horn of the right lateral ventricle. These appear with low signal intensity on T1-weighted images and mixed signal intensity on T2-weighted and FLAIR images. Post-enhancement shows peripheral enhancement, and edema signals are visible around the lesions, with the larger one located in the left occipital lobe measuring approximately 26*31*37 mm. At the left Sylvian fissure and the frontal lobe, there are abnormal enhancing nodules, measuring approximately 26*31*37 mm. There is no midline shift.",
    "BraTS-MET-00005-000": "Small patchy abnormal signal shadows are visible in the bilateral frontal lobes and left occipital lobe. The larger one is located in the right frontal lobe, showing slightly hypointense on T1W, hyperintense on T2W and FLAIR sequences. Surrounding edema can be seen, and there is significant enhancement of the lesion post-contrast, measuring approximately 16*19*18 mm. No midline shift is present.",
    "BraTS-MET-00006-000": "A large irregular abnormal signal shadow can be seen in the left parieto-occipital lobe, appearing slightly hypointense on T1W, isointense on T2W, and slightly hyperintense on FLAIR. There is extensive surrounding edema, and post-contrast there is evident enhancement of the lesion measuring approximately 59*99*88mm. The right lateral ventricle is compressed, with a slight shift of the midline to the right; bilateral frontal lobes, left temporal lobe, and right parieto-occipital lobe show scattered abnormal signal nodules, with the larger ones located in the left temporal lobe displaying low signal on T1W and FLAIR, high signal on T2W with internal fluid levels, and mild peripheral enhancement observed post-contrast, measuring approximately 59*99*88mm.",
    "BraTS-MET-00007-000": "Multiple small nodules are observed in the right frontal lobe and left parieto-occipital-temporal lobe, with the larger ones located in the left parietal lobe. These exhibit low signal on T1-weighted imaging, mixed high and low signal on T2-weighted imaging, and mixed high and low signal on FLAIR imaging. After contrast enhancement (T1C), notable enhancement is seen, with the largest measuring approximately 69*88*93mm. Surrounding this area, there is patchy low signal on T1-weighted imaging, and a high signal on both T2-weighted and FLAIR imaging. The lateral ventricles are compressed, with midline structures shifted to the right.",
    "BraTS-MET-00008-000": "Multiple patchy and nodular abnormal signals are observed in the bilateral frontal and parietal lobes, and the left temporal lobe. The larger lesion, which is located in the left temporal lobe, appears as a hypo- or isointense signal on T1-weighted images, and has a mixed signal on T2-weighted and FLAIR sequences. Surrounding edema is visible. On T1-weighted imaging with contrast (T1C), the lesion shows heterogeneous enhancement, measuring approximately 50*65*49 mm. There is no shift in midline structures.",
    "BraTS-MET-00009-000": "Multiple clustered abnormal signals are seen in the bilateral parieto-occipital lobes. The larger lesion is located in the left occipital lobe, presenting with mixed iso- to hypo-intense signals on T1-weighted images, mixed high- to low-intense signals on T2-weighted images, high signal on FLAIR, and peripheral enhancement on T1 post-contrast with non-enhancing regions within, measuring approximately 77*60*74 mm. Flaky T1 low signal, T2 high signal, and FLAIR high signal are visible around. Midline structures are not shifted.",
    "BraTS-MET-00010-000": "Multiple patchy abnormal signal foci can be seen in the right frontal, parietal, temporal, occipital lobes, thalamus, and cerebellar hemisphere, with the larger ones located in the right frontal lobe, showing isointense on T1-weighted imaging (T1WI), high signal on T2-weighted imaging (T2WI) and Fluid Attenuated Inversion Recovery (FLAIR), with surrounding large-scale edema, and ring enhancement after contrast; Multiple abnormal enhancing nodules can be seen in the left basal ganglia region, thalamus, and temporal lobe, about 33*30*30mm in size. No shift in midline structures.",
    "BraTS-MET-00011-000": "Multiple punctate, patchy, and irregular abnormal signal shadows can be seen in the right frontotemporal lobe, periventricular area, left frontoparietal lobe, and cerebellar hemisphere. The larger lesion is located near the right lateral ventricle, exhibiting cystic and solid characteristics. The solid part shows iso-signal on T1W and T2W images, slightly hyperintense on FLAIR, with a surrounding large area of edema. Post-enhancement, the solid part of the lesion shows significant enhancement, measuring approximately 72*123*92 mm. The right lateral ventricle is compressed, and there is a mild leftward shift of the midline structures.",
    "BraTS-MET-00012-000": "Multiple small nodules are seen in bilateral frontal and parietal lobes, bilateral cerebellum and left external capsule area. The larger one is located in the left cerebellum, exhibiting low signal on T1-weighted images, high signal on T2-weighted images, and high signal on FLAIR. Post-contrast T1 images reveal rim enhancement, with the size approximately 62*56*54 mm. Surrounding these lesions, there is patchy low signal on T1-weighted images, high signal on T2-weighted images, and high signal on FLAIR. The fourth ventricle is compressed. There is no midline shift.",
    "BraTS-MET-00014-000": "Multiple grouped and patchy abnormal signal shadows can be seen in both cerebral hemispheres and the cerebellum, with the larger ones located in the left occipital lobe. These are showing hypointense signal on T1-weighted images, and mixed hyperintense signal on T2-weighted and FLAIR sequences. Perilesional edema signal is visible. The lesions exhibit significant uneven enhancement after contrast administration, measuring approximately 48*65*55mm. No midline shift is observed.",
    "BraTS-MET-00015-000": "Multiple round-like abnormal signal shadows are seen in the left cerebellar hemisphere, occipital lobe, temporal lobe, and right temporal lobe, with the larger one located in the right temporal lobe, presenting as low signal on T1-weighted imaging (T1W), high signal on T2-weighted imaging (T2W), and ring enhancement seen in the lesion on post-contrast T1 imaging (T1C), measuring approximately 18*23*31mm. There is no displacement of midline structures.",
    "BraTS-MET-00016-000": "Multiple nodular and mass-like abnormal signal shadows are visible in the left frontal lobe, bilateral parietal lobes, right occipital lobe, and on the right side of the brainstem. The largest lesion is located in the left frontal lobe, presenting as cystic and solid, with the solid part showing isointense signal on T1W, slightly hyperintense signal on T2W and FLAIR. Surrounding the lesion is a large area of edema signal. Post-contrast, the solid part of the lesion shows obvious enhancement. The size is approximately 65*155*86 mm. There is no shift in midline structures.",
    "BraTS-MET-00017-000": "Multiple small nodules are seen in the left cerebellum and bilaterally in the frontal, parietal, and occipital lobes, with the larger ones located at undesignated locations, exhibiting isointense signals on T1-weighted imaging, hyperintense signals on T2-weighted imaging and FLAIR, and are clearly enhanced on T1-weighted imaging with contrast. The approximate size of the lesions is 21*21*22mm. Peripheral to the lesions, there are patchy areas of low signal on T1-weighted imaging and high signal on T2-weighted imaging and FLAIR. There is no shift in the midline structure.",
    "BraTS-MET-00019-000": "Abnormal round-like signal shadows can be seen in the left parieto-occipital lobe and the right frontal lobe, with the larger one located in the left parietal lobe. It presents as a slightly low signal on T1W, mixed signal on T2W/FLAIR, surrounded by widespread edema, and shows obvious enhancement post-contrast administration, with the larger lesion measuring approximately 68*82*92mm. There is no midline shift.",
    "BraTS-MET-00020-000": "Irregular abnormal signal can be seen in the left temporal lobe, exhibiting low signal on T1W, high signal on T2W, and low signal on FLAIR sequence, with surrounding edema signal. After enhancement, marginal enhancement of the lesion can be observed, measuring approximately 46*51*39 mm. A small patch of abnormal enhancement can be observed in the right cerebellar hemisphere, measuring approximately 46*51*39 mm. No displacement of midline structures.",
    "BraTS-MET-00021-000": "Multiple small patchy lesions with slightly hyperintense FLAIR signals are observed in the left cerebellar hemisphere and right frontal parietal lobe, with the larger lesion located in the left cerebellar hemisphere measuring approximately 16*22*18mm. After enhancement, the lesion margins show enhancement. No midline shift is observed.",
    "BraTS-MET-00022-000": "Multiple small patchy and nodular abnormal signals can be seen in both cerebral hemispheres and the cerebellum, with the larger lesion located in the left frontal lobe. This lesion exhibits slightly low signal on T1-weighted images, slightly high signal on T2-weighted and FLAIR images, with surrounding edema signal. On T1-weighted images with contrast, rim enhancement is visible, measuring approximately 41*61*39mm. There is no shift of midline structures.",
    "BraTS-MET-00023-000": "Multiple abnormal signal shadows can be seen in both parietal lobes and the right frontal lobe, with the larger lesion located in the left parietal lobe. This lesion appears isointense on T1-weighted images and isointense on T2-weighted images, with mixed signal on FLAIR images. There is significant edema surrounding the lesion. Post-contrast, the lesion exhibits ring enhancement, approximately measuring 116*102*87 mm. No midline shift is observed.",
    "BraTS-MET-00024-000": "Multiple cystic and solid lesions are observed in the bilateral cerebral hemispheres, cerebellar hemispheres, and brainstem, with a larger lesion located in the right frontal lobe, measuring approximately 33*31*32mm, showing low signal on T1-weighted images and high signal on T2-weighted images. There is ring enhancement after contrast administration. There is no midline shift.",
    "BraTS-MET-00025-000": "Mass-like abnormal signals can be seen in the left occipital lobe and the right frontal lobe; the larger lesion is located in the left occipital lobe, exhibiting cystic and solid features. The solid part of the lesion shows isointense signals on T1W and T2W sequences, with slightly hypointense signals on FLAIR. Extensive edema surrounds the lesions, and there is enhancement of the lesion's margin after contrast administration, measuring approximately 43*69*46 mm. There is no midline shift.",
    "BraTS-MET-00026-000": "There is a mass-like abnormal signal shadow in the left cerebellar hemisphere, which appears as a slightly hypointense signal on T1-weighted images, and as hyperintense on T2-weighted and FLAIR sequences, with a large area of surrounding edema. Post-contrast enhancement shows peripheral enhancement of the lesion, measuring approximately 74*63*49 mm. In the right parietal lobe, there is a small round abnormal signal shadow, which appears as hypointense on T1-weighted images, hyperintense on T2-weighted images, and hypointense on FLAIR images, with a small amount of surrounding edema. Post-enhancement reveals mild peripheral enhancement of the lesion, measuring approximately 74*63*49 mm. There is no shift of the midline structures.",
    "BraTS-MET-00027-000": "Multiple abnormal signal shadows are observed in the bilateral frontal lobes, left parietal lobe, and right thalamus, with the larger ones located in the right thalamus. These lesions present with equal signal intensity on T1W and T2W, slightly hyperintense on FLAIR, with a small amount of perilesional edema signal evident along the margins. Post-contrast T1 imaging shows mild enhancement of the lesions, measuring approximately 22*25*27mm. No shift of midline structures.",
    "BraTS-MET-00028-000": "A mass-like abnormal signal is visible in the left temporal lobe, with an irregular shape, showing a slightly hypointense signal on T1W, mixed signal on T2W and FLAIR, and surrounding large area of edema signal. Post-enhancement, the lesion exhibits obvious uneven enhancement, measuring approximately 77*100*82 mm. No displacement of midline structures is observed.",
    "BraTS-MET-00029-000": "A small nodule is observed in the left frontal lobe, exhibiting low signal intensity on T1-weighted images, high signal intensity on T2-weighted images, isointense on FLAIR, and marginal enhancement on T1 post-contrast. The size is approximately 31*25*28mm. Surrounding the nodule, there is a patchy area that shows low signal on T1-weighted images, high signal on T2-weighted images, and high signal on FLAIR. There is no displacement of midline structures.",
    "BraTS-MET-00030-000": "Multiple clustered abnormal signal shadows are seen in the cerebellum, the junction of the left frontal parietal lobes, and the right frontal lobe; the larger one is located in the right cerebellar hemisphere, showing slightly low signal on T1W, and signals on T2W, FLAIR. Perilesional edema signal is visible; significant enhancement of the lesion is seen on T1C, measuring approximately 69*60*55 mm. There is no shift of midline structures.",
    "BraTS-MET-00031-000": "Multiple patchy abnormal signals are seen in both cerebral hemispheres and the cerebellum, with the larger ones located in the right cerebellar hemisphere, presenting with iso-intense on T1W, hypo-intense on T2W and FLAIR sequences. There is mild enhancement on T1 post-contrast with dimensions of approximately 21*28*29 mm. No shift in midline structures.",
    "BraTS-MET-00032-000": "Multiple small nodules are seen in both frontal lobes and the right occipital lobe, with the largest one located in the right occipital lobe, which appears as a low signal on T1W, high signal on T2W, low signal on FLAIR, and shows peripheral enhancement on T1C, measuring approximately 36*52*51 mm. There is no shift in midline structures.",
    "BraTS-MET-00033-000": "A lesion resembling a quasi-circular abnormal signal is visible in the right frontal lobe, presenting with isointense signal on T1-weighted imaging, and slightly hyperintense signal on T2-weighted and FLAIR imaging. There is a large area of edema signal around it, and lesion margin enhancement is seen post-contrast on T1-weighted imaging, with dimensions of approximately 49*90*61 mm. There is no displacement of midline structures.",
    "BraTS-MET-00034-000": "Small patchy abnormal signals are observed in both occipital lobes, displaying isointense on T1-weighted images, slightly hyperintense on T2-weighted and FLAIR images, with a small amount of perilesional edema signal. Enhanced margins of the lesion are visible on T1-weighted images post-contrast, measuring approximately 14*19*31 mm. There is no midline shift.",
    "BraTS-MET-00035-000": "A lesion resembling a round abnormal signal can be seen in the right frontal lobe, presenting as a slightly hypointense signal on T1W, mixed signal on T2W and FLAIR, with large edema around it. The lesion shows obvious uneven enhancement on T1C, with an approximate size of 55*70*62 mm. No midline shift is observed.",
    "BraTS-MET-00036-000": "A small nodular abnormal signal shadow is seen in the left parietal lobe, presenting signals on T1W, T2W, FLAIR, etc. Perilesional edema is observed, and the lesion exhibits significant enhancement on T1C, measuring approximately 12*21*24 mm. No midline shift is observed.",
    "BraTS-MET-00037-000": "There is a space-occupying lesion in the right frontal lobe, exhibiting mixed high and low signals on T1W, mixed high and low signals on T2W, and mixed high and low signals on FLAIR. There is significant enhancement observed post T1 contrast, with dimensions approximately 65*101*69mm. Surrounding the lesion, band-like T1W low signal and T2W high signal, as well as high signal on FLAIR, are visible. The midline structures are deviated to the left.",
    "BraTS-MET-00086-000": "Multiple clustered abnormal signal shadows are visible in the right cerebellar hemisphere and vermis, which present with iso- to hypointense signals on T1-weighted images and slightly hyperintense signals on T2-weighted images. Perilesional edema is observed. On T1-weighted images with contrast (T1C), obvious enhancement of the lesions is visible, with an approximate size of 35*19*22 mm. No midline shift is observed.",
    "BraTS-MET-00089-000": "An abnormal signal nodule can be seen in the left frontal lobe, showing isointense signal on T1-weighted (T1W) and T2-weighted (T2W) images, slightly hyperintense on FLAIR sequence, and significant enhancement on T1-weighted contrast-enhanced (T1C) images. The size is approximately 14*11*13 mm. No midline shift is observed.",
    "BraTS-MET-00090-000": "In the left frontal lobe, an abnormal enhancement nodule is visible, measuring approximately 9*11*11mm. There is no shift in midline structures.",
    "BraTS-MET-00096-000": "Two abnormal enhancing nodules can be seen in the right cerebellar hemisphere with the larger one measuring approximately 12*9*10 mm and presenting ring enhancement. There is no midline shift.",
    "BraTS-MET-00097-000": "Abnormal flake-like signal shadows are visible in the right parietal lobe and the left occipital lobe. The larger lesion is located in the right parietal lobe, showing T1W hypointense signal, T2W hyperintense signal, and FLAIR hypointense signal. There is slight edema signal around the edges. After enhancement, the lesion shows mild marginal enhancement, with approximate size of 25*30*33mm; there is a nodular spot-like abnormal enhancement in the right cerebellar hemisphere, with approximate size of 25*30*33mm. There are no deviations of the midline structures.",
    "BraTS-MET-00098-000": "In the right frontal lobe, there is an abnormal signal nodule, presenting as low signal on T1W and T2W sequences, slightly hyperintense on FLAIR sequence. Surrounding the nodule is a large area of edema. After T1 with contrast (T1C), the lesion exhibits significant enhancement. The size of the lesion is approximately 34*39*43mm. There is no midline shift.",
    "BraTS-MET-00100-000": "Scattered patchy and nodular abnormal signals can be observed in the left side of the brainstem, left parietal lobe, and temporal lobe. The larger lesions are located on the left side of the brainstem, presenting slightly hyperintense on T1-weighted images, and slightly hyperintense on T2-weighted and FLAIR images, with surrounding edema signals. On T1-contrast images, the lesion shows obvious enhancement, measuring approximately 35*33*28 mm. There is no shift in midline structures.",
    "BraTS-MET-00102-000": "Multiple small nodules are noted in the right frontal, parietal-occipital lobes, left frontal-temporal lobe, bilateral cerebellum, and periventricular areas. The largest lesion, located in the right frontal lobe, exhibits low signal intensity on T1-weighted imaging, high signal intensity on T2-weighted imaging, and high signal intensity on FLAIR sequence. Post-contrast T1 demonstrates significant enhancement, with the lesion measuring approximately 7x10x12 mm. There is no midline shift.",
    "BraTS-MET-00104-000": "A large area of abnormal signal is seen in the left occipital lobe, appearing as isointense on T1-weighted imaging, hypointense on T2-weighted imaging, and hypointense on FLAIR imaging. Surrounding the lesion, a large area of edema signal is observed. Post-contrast imaging shows enhancement around the edges of the lesion. No midline shift is seen.",
    "BraTS-MET-00105-000": "Multiple abnormal signal shadows can be seen in the left frontal parietal lobe, right frontal lobe, occipital lobe, and the right cerebellar hemisphere, with the larger ones located in the left frontal lobe. They exhibit slightly low signal on T1W, mixed high and low signal on T2W and FLAIR, and obvious uneven enhancement on T1C. A large area of peritumoral edema is visible, measuring approximately 49*117*55 mm. There is no displacement of the midline structures.",
    "BraTS-MET-00106-000": "A small area of abnormal signal intensity is seen in the right cerebellar hemisphere, displaying slightly low signal on T1-weighted images, and slightly high signal on T2-weighted and FLAIR sequences. Post-contrast enhancement shows enhancement of the lesion margin, measuring approximately 11*11*9 mm. There is no shift of midline structures.",
    "BraTS-MET-00107-000": "A small nodule is observed in the left temporal lobe, exhibiting isointense signal on T1-weighted (T1W) imaging, hyperintense signal on T2-weighted (T2W) imaging, and hyperintense signal on FLAIR imaging. Post-contrast T1 images demonstrate marked enhancement of the nodule, with approximate dimensions of 11*9*12 mm. No midline shift is noted.",
    "BraTS-MET-00108-000": "Abnormal signal nodules are observed in both frontal lobes and the cerebellar hemispheres, appearing isointense on T1-weighted images and slightly hyperintense on T2-weighted and FLAIR sequences. After enhancement, the nodules show enhancement, with the larger one measuring approximately 11*8*7 mm. There is no midline shift.",
    "BraTS-MET-00109-000": "Two abnormal signal nodules can be observed in the right frontal lobe, showing slightly low signal on T1W, similar signals on T2W and FLAIR, with surrounding edema signal. The lesions show obvious enhancement on T1C, measuring approximately 30*30*26mm. No shift in midline structures.",
    "BraTS-MET-00110-000": "A cystic-predominant lesion is visible in the left parieto-occipital lobe, exhibiting low signal on T1W images and high signal on T2W images, with a small amount of low signal fluid level within the lesion. There is a large area of edema around the tumor, and peripheral enhancement is observed post-contrast administration. The size of the lesion is approximately 61*84*87mm. No midline shift is observed.",
    "BraTS-MET-00111-000": "A small area of abnormal signal is visible in the right temporal lobe, exhibiting slightly hypointense on T1-weighted images, slightly hyperintense on T2-weighted images, and hyperintense on FLAIR sequences; perilesional edema is observed. Enhancement of the lesion is seen on post-contrast T1 images, measuring approximately 10*11*12 mm. No midline shift is observed.",
    "BraTS-MET-00112-000": "Multiple small nodules are observed in both frontal lobes, with the larger lesion located in the right frontal lobe, exhibiting high signal intensity on T1-weighted imaging, mixed high and low signal intensity on T2-weighted imaging, high signal intensity on FLAIR imaging, and marginal enhancement on contrast-enhanced T1-weighted imaging. The size of the largest lesion is approximately 68*86*70mm. Surrounding the lesion, there is a patchy area of low signal intensity on T1-weighted imaging, and high signal intensity on T2-weighted and FLAIR imaging. No midline shift is present.",
    "BraTS-MET-00113-000": "Several abnormal enhancing nodules are visible in the left frontal and temporal lobes, with the larger measuring approximately 12*15*6mm. No midline shift is observed.",
    "BraTS-MET-00114-000": "Multiple nodules are seen in the bilateral frontal, parietal, temporal, occipital lobes, and cerebellum, the larger one is located in the right parietal lobe, displaying low signal on T1-weighted images, mixed high and low signals on T2-weighted images, low signal on FLAIR, with significant enhancement on T1 post-contrast sequence, measuring approximately 51*63*60 mm, with surrounding patchy areas of low signal on T1-weighted, high signal on T2-weighted and FLAIR sequences. No midline shift is observed.",
    "BraTS-MET-00115-000": "Multiple nodular abnormal signals are observed in the bilateral frontal lobes, the right parietal lobe, the left occipital lobe, and the cerebellar hemispheres, with the larger one located in the right frontal lobe, displaying low signal on T1-weighted images, and abnormal signals on T2-weighted and FLAIR sequences, with surrounding edema signal observed. After contrast enhancement (T1C), the lesions demonstrate significant enhancement, with the largest measuring approximately 25*21*22mm. No midline shift is observed.",
    "BraTS-MET-00116-000": "In the left frontal lobe, a cystic-solid lesion is visible, exhibiting low signal on T1-weighted images and high signal on T2-weighted images. Around the lesion, a large area of edema signal can be seen. After contrast enhancement, the solid part of the lesion shows significant enhancement, measuring approximately 60*90*69 mm. There is no shift in the midline structures.",
    "BraTS-MET-00117-000": "An abnormal signal nodule can be seen in the right insular lobe, presenting with a low signal on T1-weighted images, a high signal on T2-weighted images, and a low signal on FLAIR. There is edema surrounding the lesion. On T1-weighted imaging with contrast (T1C), the lesion shows ring enhancement, measuring approximately 26*25*20 mm. A punctate abnormal enhancement nodule can also be seen in the left frontal lobe, measuring approximately 26*25*20 mm. There is no shift in midline structures.",
    "BraTS-MET-00118-000": "A patchy abnormal signal is observed in the left frontal lobe, displaying a slightly low signal on T1-weighted images, and high signal on T2-weighted and FLAIR sequences. Surrounding edema is observed. On T1 with contrast, the lesion exhibits ring enhancement, measuring approximately 26*30*22 mm. There is no displacement of midline structures.",
    "BraTS-MET-00119-000": "A small enhancing nodule is observed in the left parietal lobe, measuring approximately 8*13*8 mm. There is no shift of the midline structures.",
    "BraTS-MET-00120-000": "A small nodular lesion with abnormal enhancement can be seen in the right frontal lobe, measuring approximately 7*8*8 mm. There is no midline shift.",
    "BraTS-MET-00121-000": "Multiple small nodules are observed within the left frontal-parietal-temporal lobes and bilaterally within the cerebellum. The larger nodule is located in the right cerebellum, displaying low signal intensity on T1-weighted images, high signal intensity on T2-weighted images, low signal intensity on FLAIR images, and enhancement on T1 post-contrast images, measuring approximately 58*53*36mm. Surrounding this nodule, there is a patchy area showing low signal intensity on T1-weighted images, high signal intensity on T2-weighted images, and high signal intensity on FLAIR images. There is no midline shift.",
    "BraTS-MET-00122-000": "An abnormal signal nodule can be seen in the left parietal lobe, which presents as isointense on T1-weighted imaging, slightly hyperintense on T2-weighted and FLAIR imaging, with peripheral enhancement seen on T1-weighted imaging post-contrast. The size is approximately 15*14*12mm. There is no midline shift.",
    "BraTS-MET-00123-000": "Multiple quasi-circular abnormal signal shadows are visible in the right cerebellar hemisphere and the left occipitoparietal lobe, presenting with low signal on T1-weighted (T1W) images, high signal on T2-weighted (T2W) imaging and Fluid-Attenuated Inversion Recovery (FLAIR) sequences. Surrounding edema signal is observable, with lesion margin enhancement seen after contrast, measuring approximately 50*58*63 mm. Scattered spot-like and small patchy abnormal signal shadows are visible in the left frontal temporal lobe and cerebellar hemisphere, with the larger ones positioned in the left cerebellar hemisphere, surrounded by edema, displaying isointense signal on T1W and slightly hyperintense signal on T2W and FLAIR images. Notable nodular enhancement is seen after contrast, measuring approximately 50*58*63 mm. Midline structures show no displacement.",
    "BraTS-MET-00124-000": "Multiple large abnormal signal shadows are visible in both cerebral hemispheres, with the larger ones located in the frontal lobes. These display low signal intensity on T1W images, iso-intensity on T2W images, and iso-intensity on FLAIR images. Extensive edema signal is observed surrounding the lesions, and there is significant enhancement of the lesions post-contrast, with approximate dimensions of 56*68*59 mm. No midline shift is observed.",
    "BraTS-MET-00125-000": "Two nodular abnormal signal shadows can be observed in the left frontal-parietal lobe, with the larger one located in the left parietal lobe, showing slightly low signal on T1W, slightly low signal on T2W and FLAIR, with surrounding large area of edema. T1C shows enhancement on the edge of the lesion, measuring approximately 61*92*68mm; punctate abnormal signal shadows can be observed in the right cerebellar hemisphere, showing iso signal on T1W, slightly high signal on T2W and FLAIR, with mild enhancement seen after contrast. There is no midline shift.",
    "BraTS-MET-00126-000": "Multiple clustered abnormal signal shadows can be seen in the right cerebellar hemisphere, showing slightly lower signal on T1W, mixed signal on T2W and FLAIR, with surrounding large areas of edema. On T1C, the lesions show obvious uneven enhancement, with the larger lesions measuring approximately 78*68*51 mm. There is no shift of midline structures.",
    "BraTS-MET-00127-000": "A mass-like abnormal signal is visible in the right frontal lobe, presenting mixed signals on T1W, T2W, and FLAIR sequences. Edema is seen around this area, and after administration of contrast (T1C), the lesion shows uneven enhancement. The size of the lesion is approximately 37*45*38mm. There is no midline shift.",
    "BraTS-MET-00128-000": "A cystic lesion is visible in the right parietal lobe, presenting as hypo-intense on T1W and FLAIR sequences, and hyperintense on T2W sequence. Surrounding edema is seen, with nodular enhancement at the lesion margin observed on T1C, measuring approximately 61*83*73mm. There is no shift in midline structures.",
    "BraTS-MET-00129-000": "A mass-like abnormal signal lesion is visible in the right occipital lobe, presenting as a low signal on T1-weighted images with a few punctate high signals at the center, mixed signals on T2-weighted and FLAIR sequences, and a large area of surrounding edema. Post-enhancement, the lesion exhibits peripheral enhancement, measuring approximately 66*109*72 mm. The right lateral ventricle is slightly compressed, and there is a slight shift of the midline to the left; in the right frontal lobe, there is a small patch of abnormal signal that is slightly hyperintense on T1-weighted images, isointense on T2-weighted and FLAIR images with a small amount of surrounding edema signal, and shows mild enhancement after contrast, measuring approximately 66*109*72 mm.",
    "BraTS-MET-00130-000": "An abnormal mass-like signal is observed in the right occipital lobe, characterized by low signal on T1-weighted images (T1W), high signal on T2-weighted images (T2W), and low signal on FLAIR sequence. There is a large area of surrounding edema, and marked enhancement of the solid portion of the lesion is seen on T1 post-contrast (T1C) imaging, measuring approximately 45*61*49mm. There is no shift of midline structures.",
    "BraTS-MET-00131-000": "A mass-like abnormal signal is observed at the posterior horn of the right lateral ventricle, presenting as low signal on T1W, and high signal on T2W and FLAIR sequences. After enhancement, the lesion shows obvious heterogeneous enhancement, measuring approximately 27*28*26mm. A small patch of abnormal signal is observed in the left occipital lobe, presenting as low signal on T1W, high signal on T2W and FLAIR sequences. Post-enhancement, enhancement is seen at the edge of the lesion, measuring approximately 27*28*26mm. There is no midline shift.",
    "BraTS-MET-00132-000": "Multiple punctate, patchy, and round-like abnormal signal shadows can be observed in the left frontal lobe, right lateral ventricle, temporal operculum, cerebellar hemisphere, and on the left side of the brainstem. The larger lesion is located in the right lateral ventricle, which exhibits a high signal on T1-weighted images, slightly higher signal on T2-weighted images, and high signal on FLAIR. Post-contrast enhancement shows lesion border enhancement, with a size of approximately 27*35*23 mm. There is no midline shift.",
    "BraTS-MET-00133-000": "Multiple nodular and patchy abnormal signal foci are seen in the bilateral cerebral hemispheres and cerebellum. The larger lesion is located in the right cerebellar hemisphere, which exhibits low signal in the center and iso-signal on the periphery on T1-weighted images, and high signal in the center with low signal on the periphery on T2-weighted images. Surrounding edema is observed, and after enhancement, the solid part of the lesion is significantly enhanced, measuring approximately 71*68*53mm. There is no shift of the midline structures.",
    "BraTS-MET-00136-000": "In the right cerebellar hemisphere, a patchy abnormal signal shadow is visible, showing isointense on T1-weighted imaging, slightly hyperintense on T2-weighted and FLAIR imaging. Surrounding edema is visible. The lesion demonstrates significant enhancement after contrast (T1C), with approximate dimensions of 25*44*21mm. There is no midline shift.",
    "BraTS-MET-00138-000": "A lesion with a quasi-circular abnormal signal is visible in the left thalamus, exhibiting mixed signal on T1W, T2W, and FLAIR sequences, with the presence of a slight edema signal around it. After enhancement, there is mild ring-like enhancement of the lesion, measuring approximately 34*32*30 mm; multiple abnormal signal nodules are seen in the left frontal lobe and the right cerebellar hemisphere, presenting as isointense on T1W and hypointense on T2W, FLAIR sequences. After enhancement, there is mild enhancement of the lesions, with the larger ones measuring about 34*32*30 mm. There is no displacement of midline structures.",
    "BraTS-MET-00150-000": "Multiple nodular and patchy abnormal signal foci are visible in both cerebral hemispheres and the cerebellum, with the larger ones located in the right frontal lobe, showing isointense to low signal on T1W, high signal in the center and isointense on the periphery on T2W, with extensive edema signal around, and the solid part of the lesions shows obvious enhancement on T1C, measuring approximately 63*83*64 mm. No midline shift is observed.",
    "BraTS-MET-00156-000": "A patchy abnormal signal is observed at the base of the right middle cranial fossa, displaying isointense on T1-weighted imaging, and slightly hyperintense on T2-weighted and FLAIR sequences. After contrast enhancement, the lesion shows significant enhancement, with thickening and enhancement of the adjacent meninges. The lesion measures approximately 21*31*22 mm. There is no midline shift.",
    "BraTS-MET-00164-000": "Multiple nodules are seen in both cerebellar hemispheres, with the larger one located in the left cerebellum displaying mixed high and low signals on T1W images, mixed high and low signals on T2W images, and mixed high and low signals on FLAIR. After contrast administration (T1C), a ring enhancement is observed, measuring approximately 74*62*53mm. Surrounding the lesion, low signal intensity on T1W images, high signal intensity on T2W images, and high signal intensity on FLAIR images are visible. The fourth ventricle is compressed. There is no shift of the midline structures.",
    "BraTS-MET-00165-000": "A mass-like abnormal signal is seen in the right occipital lobe, presenting as high signal on T1 weighted (T1W), T2 weighted (T2W), and FLAIR sequences, with surrounding edema signal. After enhancement, the lesion shows marginal enhancement, with approximate dimensions of 56*87*64 mm. Multiple round-like abnormal signal lesions are seen in the left occipital lobe and bilateral cerebellar hemispheres, the larger one located in the left occipital lobe, presenting as slightly low signal on T1W and slightly high signal on T2W and FLAIR sequences. After enhancement, annular enhancement is visible, with approximate dimensions of 56*87*64 mm. Midline structure shows no shift.",
    "BraTS-MET-00166-000": "The MRI reveals multiple large abnormal signal areas in both frontal lobes, the left parietal lobe, and the cerebellar hemispheres. The largest lesion is located in the left frontal lobe, measuring approximately 53*45*57mm, exhibiting a slightly hyperintense signal on T1-weighted images, with the center hyperintense and the periphery hypointense on T2-weighted images. Surrounding the lesions, extensive vasogenic edema is observed. Post-contrast imaging shows ring enhancement. There is no shift in midline structures.",
    "BraTS-MET-00167-000": "Multiple nodular abnormal signal shadows are observed in the left parietal lobe and bilateral occipital lobes. The larger lesions are located in the left parietal lobe, exhibiting isointense to hypointense signals on T1-weighted images, mixed signals on T2-weighted and FLAIR images, with surrounding edema observed, and the lesions showing obvious enhancement on T1-weighted images with contrast, measuring approximately 59*77*75 mm. No shift in the midline structures.",
    "BraTS-MET-00172-000": "Multiple nodular and patchy abnormal signals are observable in both cerebral hemispheres and the right cerebellar hemisphere, with the larger ones located in the right parietal lobe, presenting mixed high and low signals on T1W and T2W sequences. Around the larger lesions, extensive edema signals can be seen. After enhancement, the lesions demonstrate mild peripheral enhancement, with size approximately 57*76*79mm. No shift in midline structures.",
    "BraTS-MET-00175-000": "A nodular abnormal signal shadow is visible in the left cerebellar hemisphere, presenting as low signal on T1W, high signal on T2W, and slightly high signal on FLAIR. There is significant edema signal around it. Lesion edge enhancement is seen on T1C, measuring approximately 36*47*23mm. There is no shift of midline structures.",
    "BraTS-MET-00182-000": "Multiple round-like abnormal signal shadows are seen in both cerebellar hemispheres, the left temporal-parieto-occipital lobes, the right frontal lobe, and adjacent to the posterior horn of the lateral ventricle. The largest of these lesions is located in the right cerebellar hemisphere with a mixed signal on T1W, T2W, and FLAIR sequences, with surrounding edema signal. Enhancement on the margins of the lesions is noted on the T1C sequence, with dimensions approximately 55*84*76mm. No midline shift is present.",
    "BraTS-MET-00183-000": "Abnormal mass-like signals are seen in the right frontal and occipital lobes, with the larger lesion located in the right frontal lobe, exhibiting mixed high signal on T1W imaging, slightly low signal on T2W imaging, and mixed signal on FLAIR imaging. A large area of edema signal can be observed around the lesion. Post-contrast T1 imaging shows lesion margin enhancement. The lesion measures approximately 59*86*72 mm. No midline shift is observed.",
    "BraTS-MET-00202-000": "A mass-like abnormal signal is observed in the left temporal-occipital lobe, presenting mixed signals on T1W, T2W, and FLAIR sequences, with an internal low signal fluid level. Perilesional edema is present. After enhancement, the lesion shows mild peripheral enhancement, measuring approximately 56*82*56 mm. Multiple smaller abnormal signal foci are seen in the right frontal lobe, left parietal lobe, bilateral temporal lobes, and surrounding the third ventricle, with the largest located in the right frontal lobe, presenting as isointense on T1W, mixed signal on T2W, and FLAIR sequences. Perilesional edema is observed, and the lesion demonstrates ring enhancement post-contrast. No midline shift is noted.",
    "BraTS-MET-00214-000": "Mass-like abnormal signals are visible in the left frontal lobe and right parietal lobe, displaying high signal on T1-weighted sequences (T1W), T2-weighted sequences (T2W), and FLAIR sequences. Surrounding the lesions, there is a slight edema signal, and mild peripheral enhancement is observed after contrast administration, with sizes approximately in millimeters. A punctate abnormal enhancement nodule is visible in the right occipital lobe, approximately measuring 35*37*38mm. No midline shift is observed.",
    "BraTS-MET-00217-000": "Multiple small nodules are seen in the bilateral frontal, parietal, temporal, and occipital lobes, both cerebellar hemispheres, and the left thalamus, with the larger lesions located in the left cerebellum, exhibiting low signal intensity on T1-weighted images, mixed high and low signal intensity on T2-weighted images, low signal intensity on FLAIR, and peripheral enhancement observed on T1-weighted images post-contrast. The size of the largest is approximately 64*70*45 mm. There is no shift in midline structures.",
    "BraTS-MET-00219-000": "A mass-like abnormal signal is observed in the right cerebellar hemisphere, showing iso- to low signal on T1W, mixed signal on T2W and FLAIR, with surrounding edema signal. The lesion shows evident uneven enhancement on T1C, measuring approximately 63*55*46mm. There is no midline shift.",
    "BraTS-MET-00222-000": "A nodule is observed in the left occipital lobe, presenting as a low signal on T1-weighted imaging, mixed high and low signal on T2-weighted imaging, and mixed high and low signal on FLAIR. Post-contrast T1 imaging shows ring enhancement of the nodule, which is approximately 58*89*87 mm in size. Surrounding the nodule is a patchy area with low T1W signal, high T2W signal, and high FLAIR signal. There is no shift in the midline structures.",
    "BraTS-MET-00224-000": "A mass-like abnormal signal focus is visible in the left cerebellar hemisphere, appearing cystic-solid, with the solid part showing slightly low signal on T1-weighted images, and slightly high signal on T2-weighted and FLAIR images. Extensive surrounding edema signal is seen. Post-contrast shows enhancement around the lesion's margin, measuring approximately 38*54*32 mm. In the right frontal lobe, a lesion resembling a round abnormal signal is observed, showing slightly low signal on T1-weighted images, high signal on T2-weighted images, and slightly low signal on FLAIR sequences. Edema is visible around the margins, and post-contrast shows enhancement around the lesion's edges, also measuring approximately 38*54*32 mm. No midline shift is evident.",
    "BraTS-MET-00230-000": "Multiple cystic lesions are observed in the left frontal-parietal-occipital lobes, right frontal lobe, and occipital lobe. The larger lesion is located in the left occipital lobe, presenting with low signal on T1-weighted images, high signal on T2-weighted and FLAIR images. Post-contrast enhancement shows rim enhancement of the lesions, with the largest measuring approximately 51*78*57 mm. There is compression of the left lateral ventricle and slight rightward shift of midline structures.",
    "BraTS-MET-00233-000": "There is a predominantly cystic lesion in the right cerebellar hemisphere, exhibiting low signal on T1-weighted images and high signal on T2-weighted images, surrounded by a large area of edema signal. Post-contrast imaging shows ring enhancement, with dimensions of approximately 67*57*47 mm. Scattered patchy abnormal signals are visible in the bilateral cerebral hemispheres, with the largest located at the junction of the temporal and occipital lobes, showing high signal on both T1-weighted and T2-weighted images. Surrounding edema signal is visible, and post-contrast imaging shows enhancement at the periphery of the lesion, with dimensions of approximately 67*57*47 mm. There is no midline shift.",
    "BraTS-MET-00238-000": "A small abnormal signal focus is visible in the right midbrain tegmentum, presenting as a low signal on T1-weighted images, and low signal on T2-weighted and FLAIR sequences. A small amount of perilesional edema signal is present. On post-contrast T1 images, ring enhancement of the lesion is observed, measuring approximately 26*18*20 mm. No midline shift is evident.",
    "BraTS-MET-00243-000": "Multiple enhancing nodules are visible in both cerebral hemispheres, measuring approximately 11*9*6mm. There is no shift of the midline structures.",
    "BraTS-MET-00255-000": "Multiple patchy and nodular abnormal signals can be seen in both occipital lobes and the right temporal lobe, showing mixed signals on T1W, T2W, and FLAIR sequences. A large area of edema signal can be observed around the lesions. The lesions show heterogeneous enhancement on T1C, measuring approximately 25*41*24mm. There is no midline shift.",
    "BraTS-MET-00260-000": "A mass-like abnormal signal is visible in the right basal ganglia area, presenting with a mixed signal intensity on T1W, T2W, FLAIR sequences, with a large surrounding area of edema signal. On T1C, enhancement of the lesion's margin is seen. The size of the lesion is approximately 79*117*74 mm. The right lateral ventricle is compressed, with slight leftward shifting of midline structures.",
    "BraTS-MET-00262-000": "An irregular abnormal signal shadow can be seen in the left occipital lobe, showing slightly low signal on T1W images, slightly high signal on T2W images, and mixed signals on FLAIR. A large area of edema can be seen around the lesion, with marked uneven enhancement of the lesion on T1C imaging, measuring approximately 54*77*78mm. No midline shift is observed.",
    "BraTS-MET-00263-000": "Large abnormal signal shadows can be seen in the vermis of the cerebellum and right occipital lobe. The larger lesion is located in the cerebellar vermis, presenting as low signal on T1-weighted images, slightly hyperintense on T2-weighted and FLAIR images, surrounded by extensive regions of edema. After enhancement, the lesion exhibits significant inhomogeneous enhancement, with approximate dimensions of 74*64*49mm. There is no shift of midline structures.",
    "BraTS-MET-00264-000": "A cystic and solid lesion is visible in the left frontal parietal lobe, irregular in shape, showing iso to low signal on T1W and mixed high signal on T2W. A large area of peritumoral edema is visible, with significant enhancement of the solid part after contrast, measuring approximately 55*83*64 mm. The midline structures are slightly displaced to the right.",
    "BraTS-MET-00266-000": "A lesion resembling a round shape with abnormal signal intensity is observed in the left temporal lobe, presenting with low signal on T1-weighted (T1W) imaging, high signal on T2-weighted (T2W) imaging, and low signal on Fluid Attenuated Inversion Recovery (FLAIR) sequences. Post-contrast enhancement shows enhancement around the margins of the lesion, measuring approximately 19*22*19 mm. There is no shift of the midline structures.",
    "BraTS-MET-00271-000": "Multiple round-like abnormal signal shadows can be seen in the bilateral cerebral hemispheres and the right cerebellar hemisphere. The larger one is located in the left frontal lobe, showing mixed signals on T1W, slightly heightened signals on T2W and FLAIR. Edema signals can be observed at the edge of the lesions. After enhancement, uneven strengthening is noticeable, with the size of about 22*25*16mm. No displacement of midline structures.",
    "BraTS-MET-00273-000": "In the posterior horn of the right lateral ventricle, an irregular abnormal signal shadow is visible, presenting with a cystic and solid nature. The solid part shows a slightly hypointense signal on T1-weighted images, mixed signal on T2-weighted and FLAIR sequences, with extensive surrounding edema noted. On post-contrast T1-weighted images, the lesion demonstrates inhomogeneous enhancement, measuring approximately 78*112*83mm in size. The right lateral ventricle is compressed, and there is a shift of midline structures to the left.",
    "BraTS-MET-00274-000": "In the left frontal lobe, there is an irregular cystic and solid lesion with mixed signals on T1W, T2W, and FLAIR sequences. Surrounding the lesion, there is a significant area of edema. On the T1C sequence, the solid component of the lesion shows pronounced enhancement. The size of the lesion is approximately 64*87*70 mm. The left lateral ventricle is slightly compressed, and there is a slight rightward shift of midline structures.",
    "BraTS-MET-00280-000": "A mass-like abnormal signal is seen in the left occipital lobe, presenting with a slightly hyperintense signal on T1W, an obvious hyperintense signal on T2W and FLAIR, with surrounding large edema signal. Post-contrast T1 shows enhancement at the edge of the lesion, which measures approximately 74*92*92 mm. There is no midline shift.",
    "BraTS-MET-00281-000": "Multiple small patchy abnormal signal shadows are seen in the vermis and the right cerebellar hemisphere, presenting with an isointense signal on T1WI, slightly hyperintense on T2WI, and hyperintense on FLAIR. Lesion enhancement is visible on T1C, with the larger lesion measuring approximately 10*10*16mm. No midline shift.",
    "BraTS-MET-00285-000": "A small nodule is observed in the right cerebellum, presenting as isointense on T1W sequences, hypointense on T2W and FLAIR sequences, with conspicuous enhancement on T1 post-contrast (T1C), measuring approximately 57*56*33mm. There is also surrounding patchy hypointense signal on T1W, hyperintense on T2W and FLAIR. No midline shift observed.",
    "BraTS-MET-00286-000": "Scattered small patchy abnormal signal shadows are seen in the bilateral frontal lobes, the left parietal lobe, and the temporal lobe, presenting as slightly hyperintense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, isointense on FLAIR, with lesion enhancement observed in T1C, measuring approximately 14*18*13 mm. No shift of midline structures.",
    "BraTS-MET-00288-000": "Multiple nodular and patchy abnormal signal shadows can be seen in the bilateral frontal parietal lobes, the right occipital lobe, and the cerebellar hemispheres. The larger lesion is located in the right occipital lobe, presenting with mixed signal on T1W and T2W images. A large area of edema signal surrounds the lesions. On contrast-enhanced T1 (T1C), the lesions show obvious uneven enhancement, with the size of the largest approximately 66*108*85 mm. The right lateral ventricle is slightly compressed. There is no midline shift.",
    "BraTS-MET-00290-000": "A cystic-solid lesion is observed in the left frontal lobe, irregular in shape, displaying iso- to hypointense signal on T1-weighted (T1W) images and mixed signal intensity on T2-weighted (T2W) images. Surrounding the lesion, there is a large area of edema signal. After contrast enhancement, the lesion shows marked inhomogeneous enhancement, measuring approximately 65*96*74 mm. The right lateral ventricle is compressed, and there is a slight rightward shift of the midline structures.",
    "BraTS-MET-00292-000": "On the left frontal lobe, there is a mass-like abnormal signal shadow, presenting with isointense to low signal on T1W and mixed signal on T2W. Extensive edema signal is observed around the lesion. After enhancement, the lesion shows marked uneven enhancement with a non-enhanced area inside, measuring approximately 64*77*74 mm; On the right frontal lobe, there is an abnormal signal nodule visible, presenting with isointense signal on T1W and T2W, slightly hyperintense on FLAIR, with obvious enhancement after contrast, measuring approximately 64*77*74 mm. There is no displacement of midline structures.",
    "BraTS-MET-00296-000": "A small, approximately round abnormal signal shadow can be observed in the left cerebellar hemisphere, presenting with isointense signal on T1-weighted images, hyperintense signal on T2-weighted and FLAIR sequences, and peripheral enhancement visible on contrast-enhanced T1 images, measuring approximately 11*11*12 mm. There is no midline shift.",
    "BraTS-MET-00304-000": "Large abnormal signal shadows can be seen in the right occipital lobe and cerebellar hemisphere; the larger lesion is located in the right cerebellar hemisphere, presenting as slightly hypointense on T1-weighted images, mixed hyperintense signal on T2-weighted images, and mixed hyperintense on FLAIR. There's extensive edema signal around the lesions. Post-contrast T1 images show peripheral enhancement of the lesions, measuring approximately 84*64*50 mm. No shift in midline structures.",
    "BraTS-MET-00306-000": "Multiple clustered and nodular abnormal signal shadows can be seen in the left cerebral hemisphere and the right parieto-occipital lobe, with the larger ones located in the right occipital lobe, showing hypo- to isointense signal on T1-weighted images, mixed signal on T2-weighted and FLAIR images, surrounded by extensive edematous signal. Post-contrast T1 images reveal markedly inhomogeneous enhancement of the lesions, measuring approximately 59*95*87 mm. No midline shift is observed.",
    "BraTS-MET-00307-000": "A small nodule is observed in the left temporal lobe, presenting as a low signal on T1W sequence, low signal on T2W sequence, and slightly low signal on FLAIR sequence. After contrast administration (T1C), the nodule shows peripheral ring enhancement, with dimensions approximately 61*84*53mm. Adjacent to the nodule, there is an extensive area demonstrating low signal on T1W sequence, high signal on T2W sequence, and high signal on FLAIR sequence. There is a deviation of midline structures to the right.",
    "BraTS-MET-00347-000": "A small abnormal signal area is observed in the right frontal lobe, presenting as a high signal on T1W, high signal on T2W, and high signal on FLAIR. Notable enhancement is seen on T1C, and perilesional edema is visible, measuring approximately 12*19*20mm. There is no shift of midline structures.",
    "BraTS-MET-00348-000": "Multiple small nodules are observed in the right temporal-parietal lobe, with the larger located in the right parietal lobe, exhibiting high signal on T1W, high signal on T2W, and high signal on FLAIR. On T1C, uniform enhancement is visible, measuring approximately 37*29*36 mm. There are patchy areas around it showing low signal on T1W and high signal on T2W and FLAIR. There is no midline shift.",
    "BraTS-MET-00349-000": "On the right frontal lobe, there is an oval-shaped lesion with abnormal signal intensity, presenting with low signal on T1-weighted (T1W) MRI sequences and high signal on T2-weighted (T2W) MRI sequences. On FLAIR sequences, the lesion shows low signal. Surrounding the lesion is a large area of edema signal. After contrast administration (T1C), enhancement is seen around the edges of the lesion, which measures approximately 47*63*53mm. There is no midline shift observed.",
    "BraTS-MET-00350-000": "Multiple abnormal signal nodules are visible in the cerebellum, with the larger ones located in the vermis of the cerebellum, showing high signal on T1W, isointense signal on T2W and FLAIR, with large edema around, and rim enhancement of the lesion on T1C, measuring approximately 50*42*43 mm. No displacement of midline structures.",
    "BraTS-MET-00375-000": "On the right frontal lobe, there are patchy and mass-like abnormal signal shadows, which appear as slightly low signals on T1-weighted images (T1W), mixed signals on T2-weighted images (T2W) and FLAIR sequences, with patchy edema signal observed around. On post-contrast T1 (T1C), there is an enhancement along the edges, measuring approximately 35*55*49 mm. There is no midline shift.",
    "BraTS-MET-00376-000": "In the left temporal lobe, a mass-like abnormal signal is visible, presenting as mixed high and low signals on T1W, T2W, and FLAIR sequences. Surrounding the mass, a large area of edema signal is evident. After enhancement, the solid part of the lesion shows significant enhancement, measuring approximately 57*113*63mm. There is no displacement of midline structures.",
    "BraTS-MET-00378-000": "Small nodular shadows with abnormal signals are observed in the left parietal lobe and the right occipital lobe, exhibiting slightly low signal on T1-weighted images, high signal on T2-weighted images and FLAIR sequences, with obvious perilesional edema. Post-contrast T1 images show enhancement around the edges of the lesions, measuring approximately 34*47*37 mm. There is no midline shift.",
    "BraTS-MET-00379-000": "In the left frontal lobe, there is an approximately round abnormal signal shadow, presenting as hyperintense on T1-weighted imaging, mixed signal on T2-weighted and FLAIR sequences. Surrounding the abnormality, a large area of edema is visible. Post-contrast enhancement shows peripheral enhancement of the lesion, which measures about 45*56*53 mm; Near the midline of the left frontal lobe, an abnormal enhancing nodule is observed, approximately 45*56*53 mm in size. No midline shift is noted.",
    "BraTS-MET-00380-000": "Patchy abnormal signal shadows are seen in the splenium of the corpus callosum and the right parieto-occipital lobe, with the larger lesion located in the right parieto-occipital lobe, crossing the midline locally, and presenting with uneven hyperintense signal on T1-weighted images (T1W), hyperintense signal on T2-weighted images (T2W) and Fluid Attenuated Inversion Recovery (FLAIR) sequence, with extensive perilesional edema signal. Edge enhancement of the lesion is noted on post-contrast T1 images (T1C), measuring approximately 44*56*69mm. No midline shift is observed.",
    "BraTS-MET-00381-000": "A mass-like area of abnormal signal is observed in the right parietal lobe, which appears as a low signal on T1-weighted imaging, a high signal on T2-weighted imaging, and a high signal on FLAIR sequence. The signal inside is uniform, and peripheral ring enhancement can be seen on post-contrast T1-weighted imaging (T1C), with dimensions approximately 44*71*73mm. Adjacent to this, there is flake-like signal characteristics that are isointense on T1-weighted imaging, high signal on T2-weighted imaging, and high signal on FLAIR. There is no midline shift.",
    "BraTS-MET-00382-000": "In the left parietal lobe, there is a mass-like abnormal signal shadow with central low signal and peripheral iso signal on T1W, mixed signal on T2W, iso to low signal on FLAIR, and significant heterogeneous enhancement of the lesion on T1C with surrounding large edematous signal. The dimensions of the lesion are approximately 44*58*60mm. There is no midline shift.",
    "BraTS-MET-00404-000": "Multiple patchy and nodular abnormal signal shadows are seen in both cerebral hemispheres and the right cerebellar hemisphere, with the larger ones located in the left parietal lobe, exhibiting iso- to low signal on T1W, mixed signal on T2W/FLAIR, with a large area of perilesional edema. Post-contrast T1-weighted images show enhancement around the edge of the lesion, measuring approximately 77*104*68mm. The right lateral ventricle is slightly compressed. Midline structures are slightly shifted to the right.",
    "BraTS-MET-00405-000": "Multiple small nodules are observed in both cerebellar hemispheres and the right temporal-occipital lobe, with the larger lesion situated at the junction of the right temporal and occipital lobes. It presents a high signal on the T1-weighted sequence and a high signal on the T2-weighted sequence. The lesion exhibits low signal intensity on FLAIR, with peripheral enhancement visible on T1 post-contrast. The larger lesion measures approximately 58*88*74mm and is surrounded by a patchy area that displays low signal on T1-weighted sequence and high signal on T2-weighted sequence and FLAIR. There is no shift of the midline structures.",
    "BraTS-MET-00406-000": "Abnormal patchy signal changes are observed in both cerebral hemispheres and the cerebellum, displaying slightly hypointense signal on T1-weighted images (T1W), and hyperintense signal on T2-weighted images (T2W) and Fluid Attenuated Inversion Recovery images (FLAIR). There is surrounding edema signal, and after contrast enhancement, significant enhancement is observed. The larger lesions measure approximately 44*60*45 mm in size. No midline shift is present.",
    "BraTS-MET-00407-000": "Multiple patchy and irregular abnormal signal shadows can be seen in the bilateral cerebral hemispheres and cerebellum, with the larger ones located in the left frontal lobe. They appear as isointense to low signal on T1-weighted images, mixed signal on T2-weighted and FLAIR images, with extensive surrounding edema signal. There is uneven enhancement of the lesion on T1 post-contrast (T1C), measuring approximately 46*45*53mm. No midline shift is noted.",
    "BraTS-MET-00408-000": "Multiple punctate and patchy abnormal signals are seen in both cerebral hemispheres, the cerebellum, and the brain stem. A larger lesion is located in the left frontal lobe, exhibiting a slightly low signal on T1-weighted (T1W) imaging, and mixed signals on T2-weighted (T2W) and Fluid Attenuated Inversion Recovery (FLAIR) imaging. Surrounding the lesion is extensive edema, with the lesion's margins showing enhancement on post-contrast T1 (T1C), measuring approximately 38*45*43 mm. No midline shift is observed.",
    "BraTS-MET-00409-000": "Multiple nodular abnormal signals are visible in the left temporal pole and the right frontal parietal lobe, with the larger lesions located in the right frontal lobe, presenting as low signal on T1-weighted images and mixed signal on T2-weighted and FLAIR images. Perilesional edema is observed. After enhancement, lesion margin enhancement is seen, with a size of approximately 22*21*26 mm. No midline shift is observed.",
    "BraTS-MET-00410-000": "A small nodule is seen in the left temporal lobe, exhibiting hyperintense signal on T1-weighted (T1W) imaging, hyperintense signal on T2-weighted (T2W) imaging, hypointense signal on Fluid-Attenuated Inversion Recovery (FLAIR) imaging, and significant enhancement on post-contrast T1 (T1C) imaging, measuring approximately 21*23*28 mm, surrounded by patchy areas showing hypointense signal on T1W, hyperintense signal on T2W, and hyperintense signal on FLAIR. No midline shift is observed.",
    "BraTS-MET-00411-000": "A large abnormal signal shadow is visible in the left occipital lobe, presenting as a low signal on T1W imaging, a high signal on T2W imaging, and a low signal on FLAIR sequence. Perilesional edema is visible. The lesion exhibits significant enhancement on T1C, measuring approximately 36*54*48mm. There is no midline shift.",
    "BraTS-MET-00412-000": "Multiple patchy abnormal signal shadows are seen in the left frontal-parietal lobes and bilateral temporal lobes, with the larger ones located in the left temporal lobe. These are isointense on T1W sequences; slightly hypointense on T2W and FLAIR sequences; and demonstrate perilesional edema. Heterogeneous enhancement of the lesion is noted on T1C sequences, measuring approximately 42*36*51mm. There is no midline shift.",
    "BraTS-MET-00413-000": "A mass-like abnormal signal is seen in the left temporal-occipital lobe, predominantly high signal on T1W, T2W, and FLAIR sequences. After enhancement, the lesion shows some punctate enhancement, measuring approximately 38*27*36 mm. There is no midline shift.",
    "BraTS-MET-00414-000": "A lesion with a quasi-circular abnormal signal is visible in the left cerebellar hemisphere, exhibiting a low signal on T1W images, and slightly high signals on T2W and FLAIR images. There is significant enhancement of the lesion visible on T1C with an approximate size of 26*27*35 mm. There is no displacement of midline structures.",
    "BraTS-MET-00415-000": "Large abnormal signal shadows can be observed in the right parietal lobe and left occipital lobe, presenting as low signal on T1-weighted imaging, and slightly high signal on T2-weighted and FLAIR imaging. An extensive area of edematous signal surrounds the lesion. After enhancement, the lesion shows obvious intensification, with the larger one located in the right parietal lobe, measuring approximately 52*70*78 mm. A small abnormal enhancing nodule can be observed in the right frontal lobe, measuring approximately 52*70*78 mm. There is no shift in midline structures.",
    "BraTS-MET-00416-000": "Multiple abnormal signals are present in the right frontal lobe, temporal lobe, left occipital lobe, and bilateral cerebellar hemispheres. The larger lesions are located in the right frontal lobe, showing low signal on T1-weighted imaging and high signal on T2-weighted imaging. There is a large area of edema signal around the lesion. After enhancement, the solid part of the lesion is significantly enhanced, measuring approximately 56*62*60 mm. No midline shift is observed.",
    "BraTS-MET-00417-000": "In the right frontal lobe, there is an approximately round abnormal signal shadow visible, presenting as a slightly hyperintense signal on T1-weighted images, mixed signal on T2-weighted and FLAIR images with a peripheral low signal rim, and extensive surrounding edema signal. On T1-weighted images with contrast (T1C), peripheral enhancement can be seen, measuring approximately 46*74*50mm. Near the ventricle of the right frontal lobe, there is a similar round abnormal signal shadow, showing as a slightly hypointense signal on T1-weighted imaging, isointense on T2-weighted imaging, and slightly hyperintense on FLAIR. A small amount of surrounding edema signal can also be seen, with the lesion showing significant enhancement after contrast. There is no midline shift.",
    "BraTS-MET-00418-000": "Nodular and patchy abnormal signals are seen in the right frontal lobe and the left occipital lobe, with the larger lesion located in the right frontal lobe. It presents with signals in T1W, T2W, FLAIR sequences and shows perilesional edema. Post-contrast T1 (T1C) imaging reveals a significant enhancement of the lesion, measuring approximately 21*18*28mm. There is no midline shift.",
    "BraTS-MET-00507-000": "Small patches of high signal intensity on FLAIR imaging are seen in the right frontal lobe and left occipital lobe. The larger lesion is located in the right frontal lobe, with prominent enhancement on T1C, measuring approximately 21*18*28 mm. There is no shift of midline structures.",
    "BraTS-MET-00529-000": "Multiple small nodules are seen in the right cerebellum and right frontal lobe, with the larger nodules located in the right cerebellum, exhibiting low signal on T1W, isointense signal on T2W, and slightly hyperintense signal on FLAIR. Within the lesion, punctate high signals are observed on T1W, T2W, and FLAIR. Uneven enhancement is seen on T1C with dimensions approximately 62*51*46 mm. No midline shift.",
    "BraTS-MET-00530-000": "Abnormal mass-like signals are visible in the left frontal and occipital lobes. The larger lesion is located in the left frontal lobe, showing mixed signals on T1W, T2W, and FLAIR sequences. Extensive edema can be seen around it. On T1C, the lesion exhibits uneven enhancement with approximate dimensions of 36*48*47 mm. There is no midline shift.",
    "BraTS-MET-00531-000": "Bilateral frontal lobes exhibit round-like abnormal enhancement nodules measuring approximately 8*8*8mm. No displacement of midline structures.",
    "BraTS-MET-00532-000": "A small abnormal signal shadow on the right frontal lobe, which shows signals on T1W, T2W, FLAIR sequences, with surrounding edema. On T1C, there is evident nodular enhancement of the lesion, measuring approximately 28*30*30mm. There is no midline shift.",
    "BraTS-MET-00533-000": "A nodule-like abnormal signal shadow is visible in the right frontal lobe, presenting with iso-signal on T1W and T2W, and slightly hyperintense signal on FLAIR. After enhancement, the lesion shows obvious enhancement, measuring approximately 32*33*31 mm; in the right occipital lobe, a patchy abnormal signal shadow is visible with low signal on T1W, high signal on T2W and FLAIR. After enhancement, the lesion shows obvious nodular enhancement, measuring approximately 32*33*31 mm, surrounded by non-enhancing edematous zones. There is no displacement of midline structures.",
    "BraTS-MET-00534-000": "A small patch of abnormal signal is visible in the left cerebellar hemisphere, presenting with T1W and T2W isointense signals, slightly hyperintense on FLAIR, mildly enhanced on T1C with the size of approximately 8*15*11mm. There is no midline shift.",
    "BraTS-MET-00535-000": "A mass-like abnormal signal is visible in the left occipital lobe, showing a low signal on T1-weighted images with a slight central high signal, a mixed signal on T2-weighted and FLAIR images, and the presence of extensive surrounding edema. After enhancement, the lesion shows a clearly uneven enhancement, with a size of approximately 48*68*54mm. Small patchy and nodular abnormal signals are visible in the right frontal lobe and brainstem, with the larger lesions located in the right frontal lobe, presenting an isointense signal on T1-weighted, and a high signal on T2-weighted and FLAIR images, with a clear enhancement of the lesion observed on contrast-enhanced T1-weighted images, measuring about 48*68*54mm. There is no shift in midline structures.",
    "BraTS-MET-00536-000": "A mass-like abnormal signal is observed in the vermis of the cerebellum, presenting as an iso- to low signal on T1W images, and hyperintense on T2W and FLAIR images. Perilesional edema is visible. After enhancement, the lesion demonstrates uneven enhancement, measuring approximately 46*56*59 mm. A cystic-solid lesion is visible in the left parietal lobe, with the solid part showing slightly low signal on T1W, iso-signal on T2W, and slightly hyperintense on FLAIR. Perilesional edema is also visible. The solid portion of the lesion shows marked enhancement on T1C, measuring approximately 46*56*59 mm. There is no midline shift.",
    "BraTS-MET-00537-000": "Small patchy abnormal signal foci are observed in the left occipital lobe and the vermis of the cerebellum, showing isointense signal on T1W and T2W sequences, slightly hyperintense on FLAIR sequence, with obvious enhancement post-contrast administration. The largest of these is located in the left occipital lobe, measuring approximately 12*13*15 mm. No midline shift is noted.",
    "BraTS-MET-00538-000": "A small nodular abnormal signal is observed in the left occipital lobe, showing isointense on T1-weighted images and slightly hyperintense on T2-weighted and FLAIR sequences. Post-contrast enhancement reveals a ring-enhancing lesion with dimensions of approximately 13*11*18 mm. There is no shift of midline structures.",
    "BraTS-MET-00539-000": "A small patch of abnormal signal can be seen in the left frontal lobe, which appears as isointense on T1W images, slightly hyperintense on T2W images, hyperintense on FLAIR images, and shows significant enhancement after contrast (T1C) with approximate dimensions of 10*11*10 mm. There is no midline shift observed.",
    "BraTS-MET-00540-000": "Abnormal enhancement nodules are visible in the left occipital lobe and right cerebellar hemisphere, approximately 7*7*12 mm in size. There is no shift of midline structures.",
    "BraTS-MET-00541-000": "A mass-like abnormal signal is visible in the left cerebellar hemisphere, presenting with mixed high signal intensity on T1-weighted images, and mixed low signal intensity on T2-weighted and FLAIR sequences. There is extensive surrounding edema, and the lesion shows uneven enhancement post-contrast T1, measuring approximately 64*53*50 mm. No midline shift is observed.",
    "BraTS-MET-00542-000": "Large abnormal signal shadows are visible in the right occipital lobe and bilateral cerebellar hemispheres, with the largest located in the right cerebellar hemisphere, measuring approximately 100*55*47mm. It shows low signal on T1W, mixed high and low signal on T2W, and isointense to low signal on FLAIR. Peritumoral edema is observed, and the lesion displays uneven enhancement post-contrast with dimensions of about 100*55*47mm. There is no midline shift.",
    "BraTS-MET-00543-000": "Multiple nodular and patchy abnormal signal foci are observed in the left frontal lobe, bilateral parietal lobes, and the vermis of the cerebellum, with the larger ones located in the left frontal lobe presenting as slightly hypointense on T1W, mixed signal on T2W and FLAIR, surrounded by extensive edema signal. After enhancement, the lesion shows obvious peripheral enhancement, measuring approximately 35*56*52 mm. There is no shift of midline structures.",
    "BraTS-MET-00544-000": "A nodular lesion with abnormal signal is present in the right external capsule area, exhibiting high signal on T1W, isointense signal on T2W, and low signal on FLAIR. There is no evident enhancement post-contrast, approximately 8*7*8 mm in size. There is no shift in midline structures.",
    "BraTS-MET-00545-000": "Multiple nodular and mass-like lesions with abnormal signals are observed in both the frontal and parietal lobes, as well as in the right cerebellar hemisphere. The larger lesion is located at the junction of the right frontal and parietal lobes, which exhibits mixed signals on T1W and T2W sequences. Surrounding the tumor, extensive edema is observable. After enhancement, marked uneven enhancement is evident, with dimensions approximately 50*41*53 mm; there is no shift of midline structures.",
    "BraTS-MET-00546-000": "An abnormal enhancing nodule is visible in the right parietal lobe, measuring approximately 6*4*6 mm. There is no shift of midline structures.",
    "BraTS-MET-00547-000": "Multiple small nodules are observed in both frontal and parietal lobes, as well as the right occipital lobe. The largest nodule, located in the right occipital lobe, presents with a T1-weighted low signal, a T2-weighted high signal, and is hyperintense on FLAIR sequences. On T1 post-contrast (T1C) imaging, ring enhancement is noted around the edges of the lesion, with dimensions approximately 24*28*33 mm. Adjacent to the lesion, there are strip-like areas that show T1-weighted low signal and T2-weighted high signal, and are hyperintense on FLAIR. There is no midline shift observed.",
    "BraTS-MET-00548-000": "In the left parietal lobe, there is a small area of abnormal signal observed, which appears as slightly hypointense on T1-weighted images, slightly hyperintense on T2-weighted and FLAIR sequences, with marked enhancement of the lesion post-contrast (T1C), measuring approximately 16*10*10 mm. There is no midline shift.",
    "BraTS-MET-00549-000": "A small nodule is seen in the left frontal lobe, displaying a high signal on T1-weighted images, a low signal on T2-weighted images, and a low signal on FLAIR. There is obvious enhancement on T1-weighted images post-contrast, with dimensions of approximately 7*6*6 mm. There is no shift of midline structures.",
    "BraTS-MET-00550-000": "At the junction of the left frontal and parietal lobes, an abnormal signal nodule can be observed. It presents as isointense on T1-weighted images, hypointense on T2-weighted images, and isointense on FLAIR sequences. A large area of edema signal is visible around it. After contrast enhancement (T1C), the lesion shows obvious enhancement, with dimensions of approximately 53*83*67 mm. A small nodular abnormal signal can be seen in the left frontal lobe, presenting as isointense on T1-weighted and hyperintense on T2-weighted and FLAIR sequences. After enhancement, it shows obvious enhancement, with dimensions of approximately 53*83*67 mm. There is no midline shift.",
    "BraTS-MET-00551-000": "A small abnormal signal is observed in the left frontal lobe, showing iso-intense on T1-weighted images, and slightly hyperintense on T2-weighted images and FLAIR sequences. Mild enhancement of the lesion is seen on the T1-weighted image with contrast (T1C), measuring approximately 14*10*15 mm. No midline shift is noted.",
    "BraTS-MET-00552-000": "Multiple small nodules are seen in the right temporal lobe and the left frontal lobe. The larger lesion is located in the left frontal lobe, which exhibits a low signal on T1-weighted (T1W) images, is iso- to slightly hyperintense on T2-weighted (T2W) images, and slightly hyperintense on Fluid-attenuated inversion recovery (FLAIR) sequences. After contrast administration (T1C), the lesion shows marked and inhomogeneous enhancement with approximate dimensions of 51*60*54 mm. Around this lesion, there are flake-like areas showing low signal on T1W, and high signal on T2W and FLAIR images. There is no shift in midline structures."
}