{
    "BraTS-MEN-00017-000": "A mass-like abnormal signal is observed in the left cerebellopontine angle region, displaying isointense signal on T1-weighted images (T1W), slightly hyperintense signal on T2-weighted images (T2W), hyperintense signal on Fluid Attenuated Inversion Recovery (FLAIR) sequence, and showing significant enhancement post-contrast (T1C). The size of the lesion is approximately 33*44*39 mm. No midline shift is seen.",
    "BraTS-MEN-00018-000": "A mass-like abnormal signal focus can be seen in the right frontal lobe, showing a slightly low signal on T1W, slightly high signal on T2W, high signal on FLAIR, with evident enhancement on T1C, however, the enhancement is not uniform. The size is approximately 80*124*88mm. Surrounding the lesion, a cerebrospinal fluid cleft and a large area of non-enhancing edema can be seen. The right lateral ventricle is compressed. There is a slight leftward shift of midline structures.",
    "BraTS-MEN-00020-000": "A small patchy abnormal signal shadow is visible on the right side of the longitudinal fissure of the brain, displaying isointense on T1-weighted imaging (T1W), slightly hyperintense on T2-weighted imaging (T2W), hyperintense on Fluid-attenuated inversion recovery (FLAIR), and shows obvious enhancement on T1 post-contrast (T1C). The dimensions are approximately 8*12*11 mm. There is no shift of midline structures.",
    "BraTS-MEN-00021-000": "A mass-like abnormal signal shadow is observed beneath the right frontal cranial plate, showing an isointense signal on T1-weighted images, slightly hyperintense on T2-weighted images, and slightly hyperintense on FLAIR images. After contrast enhancement with T1, there is moderate enhancement. The size of the lesion is approximately 69*82*66 mm. The adjacent brain parenchyma and the right lateral ventricle are compressed, with mild edema in the brain parenchyma. The midline structures are shifted to the left.",
    "BraTS-MEN-00023-000": "A mass-like cystic-solid occupying lesion is observed in the right frontal-parietal lobe, with an irregular shape. It appears as an iso- to hypointense signal on T1-weighted images, and presents with a mixed high and low signal on T2-weighted and FLAIR images. There is surrounding edema, and the solid part of the lesion shows significant enhancement on T1-weighted post-contrast images. The size of the lesion is approximately 93*100*70 mm. There is no midline shift.",
    "BraTS-MEN-00028-000": "Multiple clustered abnormal signal shadows are visible beneath the left frontal parietal region, under the right temporal cranial plate, around the left lateral ventricle, and in the posterior longitudinal fissure of the cerebrum, presenting as isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, and slightly hyperintense on FLAIR imaging. Following administration of contrast (T1C), there is marked enhancement. The size of the lesions is approximately 29*40*30 mm, with some peritumoral edema. No midline shift is observed.",
    "BraTS-MEN-00034-000": "A mass-like abnormal signal is observed at the cerebral falx of the anterior cranial fossa. The lesion has a clear boundary and measures approximately 59*57*59 mm. It shows iso- to low signal on T1-weighted imaging, high signal on T2-weighted imaging, and high signal on FLAIR sequences. Perilesional edema is visible. The lesion shows significant enhancement post-contrast (T1C). There is no midline shift.",
    "BraTS-MEN-00037-000": "A small cluster-like abnormal signal shadow can be seen below the cranial plate of the left frontal temporal region. It presents as isointense on T1-weighted imaging, isointense on T2-weighted imaging, slightly hyperintense on FLAIR imaging, and shows obvious enhancement on T1-weighted imaging post-contrast. The size is approximately 17*18*10 mm. There is no midline shift.",
    "BraTS-MEN-00041-000": "A mass-like abnormal signal focus can be seen under the left frontal bone plate, presenting with slight hypo-intensity on T1W images, slight hyper-intensity on T2W images, and slight hyper-intensity on FLAIR images, with surrounding edema observed. There is obvious enhancement on T1 post-contrast (T1C) images with uneven enhancement, measuring approximately 47*47*58mm. There is no midline shift.",
    "BraTS-MEN-00052-000": "A mass-like abnormal signal shadow can be seen beneath the right frontal-temporal skull plate, presenting with an isointense signal on T1W, an isointense signal on T2W, a hyperintense signal on FLAIR, and marked enhancement on T1 post-contrast. The dimensions are approximately 67*101*73 mm. There is peritumoral edema, with compression and narrowing of the adjacent brain parenchyma and the right lateral ventricle. The midline structures are shifted to the left.",
    "BraTS-MEN-00071-000": "A mass-like abnormal signal is observed in the anterior interhemispheric fissure, presenting with an isointense signal on T1-weighted imaging (T1WI), an isointense signal on T2-weighted imaging (T2WI), a slightly hyperintense signal on Fluid Attenuated Inversion Recovery (FLAIR), and heterogeneous enhancement on T1 post-contrast (T1C) imaging. The dimensions of the abnormality are approximately 106*88*75 mm. There is peritumoral edema, and the frontal horns of both lateral ventricles are compressed and narrowed. The midline structures are slightly shifted to the right.",
    "BraTS-MEN-00074-005": "An abnormal signal nodule is visible on the left side behind the falx cerebri, presenting with isointense signal on T1-weighted images, slightly hyperintense signal at the center and hypointense signal at the edges on T2-weighted images, mixed-signal on FLAIR sequence, and significant enhancement after contrast administration with clear boundaries, measuring approximately 15*13*16 mm. No midline shift is observed.",
    "BraTS-MEN-00074-007": "A mass-like abnormal signal shadow is visible adjacent to the posterior longitudinal fissure pool of the brain, presenting with isointense signal on T1WI, isointense signal on T2WI, slightly hyperintense signal on FLAIR, and significant enhancement on T1C post-contrast, measuring approximately 12*12*15 mm. There is no shift of midline structures.",
    "BraTS-MEN-00075-000": "In the anterior interhemispheric fissure, a mass-like abnormal signal is noted, displaying an isointense signal on T1-weighted imaging (T1W), isointense signal on T2-weighted imaging (T2W), hyperintense signal on Fluid Attenuated Inversion Recovery (FLAIR) sequences, with significant enhancement on T1 post-contrast (T1C) imaging. The size of the mass is approximately 48*56*45 mm with perilesional edema. There is a slight leftward shift of the midline structures.",
    "BraTS-MEN-00093-000": "A mass-like abnormal signal is observed beneath the right cranial vault, demonstrating an isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR images, and significant enhancement on T1-weighted images with contrast. The mass measures approximately 17 x 16 x 20 mm. There is no shift of midline structures.",
    "BraTS-MEN-00102-000": "A mass-like abnormal signal shadow can be seen at the left skull base, presenting with isointense signal on T1-weighted (T1W) imaging, isointense signal on T2-weighted (T2W) imaging, hyperintense signal on FLAIR sequence, and moderate enhancement on T1 post-contrast (T1C) imaging. The size of the lesion is approximately 34*42*38 mm, with adjacent brain parenchyma being compressed. There is no midline shift.",
    "BraTS-MEN-00103-000": "A small clustered abnormal signal shadow is visible in the cerebral fissure, with iso-intense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, slightly hyperintense signal on FLAIR sequence, and significant enhancement on T1-weighted images with contrast, measuring approximately 8*18*18mm. There is no shift of midline structures.",
    "BraTS-MEN-00108-004": "A nodular abnormal signal is observed in the left temporal region with an isointense signal on T1W, an isointense signal on T2W, hyperintense on FLAIR, and shows obvious enhancement post-T1 contrast, measuring approximately 15*23*15mm. No midline shift is noted.",
    "BraTS-MEN-00112-000": "A mass-like abnormal signal is seen in the interhemispheric fissure of the brain, which appears isointense on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR images, and shows obvious enhancement post-contrast administration with dimensions approximately 14*24*22 mm. There is no midline shift.",
    "BraTS-MEN-00131-000": "A mass-like abnormal signal shadow is seen in the anterior interhemispheric fissure, showing iso-signal on T1W, iso-signal on T2W, slightly hyperintense signal on FLAIR, and significant uneven enhancement on T1C. The size is approximately 111*117*95mm, with peritumoral edema. The midline structures are slightly deviated to the left, and the anterior horns of the bilateral lateral ventricles are compressed and narrowed.",
    "BraTS-MEN-00132-000": "A mass-like abnormal signal is visible below the cranial plate in the left frontal area, presenting with an isointense signal on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, and slightly hyperintense on FLAIR imaging. After contrast (T1C), there is marked enhancement, with an approximate size of 19*31*26mm. There is no shift of midline structures.",
    "BraTS-MEN-00136-000": "Small patchy abnormal signal shadows can be observed beneath the skull plate on both sides of the frontal regions, exhibiting isointense signal on T1-weighted imaging, isointense to hypointense signal on T2-weighted imaging and Fluid-Attenuated Inversion Recovery (FLAIR) sequences, with marked enhancement on T1-weighted imaging with contrast (T1C). The size is approximately 14*13*13 mm. There is no shifting of the midline structures.",
    "BraTS-MEN-00138-000": "A patchy abnormal signal is seen at the base of the right middle cranial fossa, displaying isointense signal on T1-weighted and T2-weighted images, slightly hyperintense signal on FLAIR sequence, with significant enhancement of the lesion on T1 post-contrast, measuring approximately 30*42*13 mm. No midline shift is observed.",
    "BraTS-MEN-00150-000": "A mass-like abnormal signal is observed beneath the right parietal bone, showing isointense signal on T1W, slightly hyperintense signal on T2W, slightly hyperintense signal on FLAIR, with marked enhancement on T1C. The dimensions of the lesion are approximately 44*70*62mm. There is peritumoral edema, and adjacent brain parenchyma is compressed. No midline shift is observed.",
    "BraTS-MEN-00154-000": "A mass-like abnormal signal is observed on the left periventricular area and the cerebellopontine angle region, presenting with isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, and hyperintense signal on FLAIR sequence. Post-contrast T1-weighted images show marked enhancement of the lesion, measuring approximately 24*25*28mm. There is no shift of the midline structures.",
    "BraTS-MEN-00156-000": "Under the right frontal calvarium, a mass-like abnormal signal shadow can be observed, presenting as isointense to low signal on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR, and conspicuously enhancing with T1 contrast. The size of the lesion is approximately 59*114*73mm, with significant edema around the tumor. The right lateral ventricle is compressed and narrowed, and the 'tail sign' of the meninges is visible. There is a slight leftward deviation of midline structures.",
    "BraTS-MEN-00161-000": "A mass-like abnormal signal shadow is seen in the right frontal lobe, appearing as isointense on T1-weighted imaging (T1W), slightly hyperintense on T2-weighted imaging (T2W), hyperintense on FLAIR imaging, with marked enhancement on T1 with contrast (T1C). The dimensions are approximately 76*107*94 mm, with peritumoral edema. There is a leftward shift of midline structures and compression and narrowing of the right lateral ventricle's anterior horn.",
    "BraTS-MEN-00165-000": "A mass-like abnormal signal shadow can be seen beneath the right frontal cranial plate, with T1W isointense signal, T2W isointense signal, FLAIR mixed signal, and significant enhancement on T1C. The dimensions are approximately 66*78*61mm, with peritumoral cystic foci and edema noted. Midline structures are shifted to the left, and the anterior horn of the right lateral ventricle is compressed and narrowed.",
    "BraTS-MEN-00169-000": "A mass-like abnormal signal is observed beneath the cranial plate of the right frontal-temporal region, displaying an isointense signal on T1W sequence, slightly hyperintense on T2W sequence, slightly hyperintense on FLAIR sequence, with marked enhancement on T1C. The mass measures approximately 50*95*57 mm, with adjacent brain parenchyma showing compression and edema. There is a slight leftward shift of midline structures.",
    "BraTS-MEN-00176-000": "A mass-like abnormal signal is observed below the cranial plate in the frontal lobe. It appears isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, and slightly hyperintense on FLAIR imaging. After administration of T1 contrast (T1C), there is significant enhancement. The size of the lesion is approximately 94*122*79 mm. There is peritumoral edema, and the bilateral lateral ventricles are compressed and narrowed. The midline structures are displaced to the right.",
    "BraTS-MEN-00181-000": "A mass-like abnormal signal is observed below the calvarium in the right parietotemporal region, exhibiting iso-signal on T1WI, slightly hyperintense signal on T2WI, mixed signals on FLAIR, and non-uniform enhancement on T1 with contrast. The approximate dimensions are 61*100*88 mm, with perilesional edema, and a mild compression and narrowing of the right lateral ventricle. No shift in midline structures.",
    "BraTS-MEN-00183-000": "An abnormal signal nodule can be seen at the base of the left middle cranial fossa, exhibiting iso-intense signals on T1W and T2W, slightly hyperintense on FLAIR, and the lesion shows obvious enhancement after T1C contrast administration. The boundary is clear, and the size is approximately 8*13*8 mm. There is no midline shift.",
    "BraTS-MEN-00194-000": "A small, nodular abnormal signal shadow can be seen beneath the left frontal bone plate, showing isointense signal on T1W, isointense signal on T2W, hyperintense signal on FLAIR, and significant enhancement on T1C. The dimensions are approximately 16*18*16mm. There is no midline shift.",
    "BraTS-MEN-00196-000": "There is a mass-like abnormal signal shadow beneath the left cranial vault, showing isointensity on T1-weighted imaging, slightly hyperintensity on T2-weighted imaging, and slightly hyperintensity on FLAIR imaging. After contrast (T1C), marked enhancement is noted. The size of the lesion is approximately 67*78*71 mm. There is perilesional edema, compression and narrowing of the posterior horn of the left lateral ventricle, and compression of the adjacent brain parenchyma, with evidence of the dural tail sign. No midline shift is observed.",
    "BraTS-MEN-00199-000": "A small nodule can be observed beneath the left frontal bone plate, exhibiting signal characteristics of isointense on T1-weighted imaging, isointense on T2-weighted imaging, slightly hyperintense on FLAIR sequence, and shows obvious enhancement post T1 contrast. The size is approximately 7x11x9 mm. No midline shift is observed.",
    "BraTS-MEN-00210-000": "A mass-like abnormal signal is observed beneath the skull plate in the right frontal temporal region, exhibiting isointense signal on T1-weighted sequence, isointense signal on T2-weighted sequence, slightly hyperintense signal on FLAIR, and uneven enhancement post-contrast (T1C), measuring approximately 66*84*68 mm, with peritumoral edema. Midline structures are shifted to the left, with compression and narrowing of the right lateral ventricle's anterior horn.",
    "BraTS-MEN-00217-000": "A small patchy area of abnormal signal is visible beneath the calvarium in the left frontal region, showing isointense signal on T1-weighted, T2-weighted, and FLAIR sequences, with significant enhancement on T1 post-contrast, measuring approximately 10x10x10 mm. There is no midline shift.",
    "BraTS-MEN-00225-000": "A small nodular lesion is visible inferior to the skull plate at the left temporal pole, exhibiting isointense signal on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR, and shows significant uniform enhancement with contrast on T1. The lesion has a clear boundary and presents with a meningeal tail sign, measuring approximately 16*26*25mm. No midline shift is observed.",
    "BraTS-MEN-00231-000": "A mass-like abnormal signal shadow can be seen beneath the left parietal bone, presenting with an isointense signal on T1-weighted images, isointense on T2-weighted images, and isointense on FLAIR sequences. It displays non-uniform enhancement upon T1 post-contrast, measuring approximately 101*110*75 mm in size. There is peritumoral edema. The left lateral ventricle is compressed and narrowed. The midline structures are slightly shifted to the right.",
    "BraTS-MEN-00244-000": "A mass-like abnormal signal is visible in the left periventricular and temporal regions, presenting as isointense on T1-weighted imaging, isointense on T2-weighted imaging, hyperintense on FLAIR sequence, and showing marked enhancement on T1 post-contrast imaging, measuring approximately 25*33*22mm. There is no shift of midline structures.",
    "BraTS-MEN-00269-000": "At the junction of the left frontal and parietal bones, beneath the calvarium, there is a mass-like abnormal signal shadow visible, displaying isointense signal on T1-weighted (T1W) and T2-weighted (T2W) images, slightly hyperintense signal on Fluid-attenuated inversion recovery (FLAIR), and marked enhancement on T1 post-contrast (T1C), measuring approximately 32*31*36mm. There is no shift of midline structures.",
    "BraTS-MEN-00270-000": "On the right side of the cerebral falx, there is a mass-like abnormal signal shadow, which presents as isointense on T1W images, isointense on T2W images, slightly hyperintense on FLAIR images, and shows significant enhancement on T1W post-contrast images. Its approximate size is 41*78*58 mm, with peritumoral edema. The midline structures are slightly shifted to the left.",
    "BraTS-MEN-00286-000": "A mass-like abnormal signal shadow is visible adjacent to the falx cerebri in the right frontal lobe, showing low signal on T1W, isointense signal on T2W, slightly hyperintense signal on FLAIR, and mild enhancement on T1C. The lesion has well-defined boundaries, with dimensions of approximately 26*32*17mm. There is no midline shift.",
    "BraTS-MEN-00298-000": "Right parafalcine mass with abnormal signal shadow at the vertex, showing iso- to low signal on T1-weighted images, slightly hyperintense on T2-weighted images, and hyperintense on FLAIR images. The lesion has a clear boundary, with a slight edema band around the edges. It shows obvious enhancement on T1 post-contrast images with uniform enhancement, measuring approximately 31*41*48mm. Additionally, a small nodular lesion is observed beneath the right frontal cranial plate, presenting with iso signal on T1-weighted and T2-weighted images, and hyperintense on FLAIR images. It shows a clear boundary and marked enhancement after contrast administration, measuring approximately 31*41*48mm. No midline shift is seen.",
    "BraTS-MEN-00299-000": "A mass-like abnormal signal is observed beneath the left occipital calvarium, presenting as isointense on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR sequences, and showing marked enhancement on T1 post-contrast images, measuring approximately 26*27*30mm. No midline shift is present, with mild compression of the left occipital lobe brain parenchyma.",
    "BraTS-MEN-00303-000": "A mass-like abnormal signal shadow is seen beneath the skull plate in the left frontal-parietal-temporal region, exhibiting an isointense signal on T1-weighted images, a slightly hyperintense signal on T2-weighted images, a hyperintense signal on FLAIR sequences, and significant enhancement post-contrast administration on T1-weighted images, with dimensions approximately 61*82*84mm. Peritumoral edema is present, and the left lateral ventricle is compressed and narrowed. There is a slight rightward shift of the midline structures.",
    "BraTS-MEN-00308-000": "A small cluster-like abnormal signal shadow can be observed under the right parietal bone, presenting as isointense on T1W images, slightly hyperintense on T2W images, and slightly hyperintense on FLAIR images. There is marked enhancement with contrast on T1C images, measuring approximately 12*11*11mm. There is no shift of midline structures.",
    "BraTS-MEN-00318-000": "A small cluster of abnormal signal shadow is visible beneath the left occipital bone plate, exhibiting isointense signal on T1W, isointense signal on T2W, isointense signal on FLAIR, and mildly enhanced on T1C. The size is approximately 12*10*14mm. No shift of the midline structures.",
    "BraTS-MEN-00327-000": "A mass-like abnormal signal is observed in the right temporal lobe, presenting as isointense on T1-weighted images and slightly hyperintense on T2-weighted and FLAIR sequences. After contrast administration (T1C), there is mild enhancement. The lesion measures approximately 65*111*67mm and is associated with perilesional edema. There is a leftward shift of midline structures, and the right lateral ventricle is compressed and narrowed.",
    "BraTS-MEN-00330-000": "A mass-like abnormal signal is visible at the falx cerebri in the anterior cranial fossa, crossing the midline, exhibiting low signal intensity on T1-weighted images, slightly high signal intensity on T2-weighted images, and high signal intensity on FLAIR sequence. The lesion has a clear boundary, and shows marked enhancement on T1 post-contrast sequence, measuring approximately 36*43*26 mm. There is no shift of midline structures.",
    "BraTS-MEN-00335-000": "A mass-like abnormal signal shadow can be seen beneath the skull plate in the right occipital region, exhibiting iso-intense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR images, and uneven enhancement on T1-weighted images with contrast, measuring approximately 30*38*39mm, with light edema around the tumor. There is no shift in the midline structures.",
    "BraTS-MEN-00342-000": "A mass-like abnormal signal shadow is visible adjacent to the falx cerebri on the right frontal parietal region, exhibiting isointense signal on T1-weighted images (T1W), mixed signal on T2-weighted images (T2W) and Fluid-Attenuated Inversion Recovery (FLAIR) sequences. Post-contrast enhancement shows uneven enhancement of the lesion with a non-enhanced small area in the center, approximately 40*42*41 mm in size; An abnormal signal nodule is also visible adjacent to the falx cerebri in the right frontal region, presenting isointense signals on T1W, T2W and slightly hyperintense signal on FLAIR. Post-contrast enhancement shows significant uniform enhancement. No midline shift is observed.",
    "BraTS-MEN-00346-000": "A mass-like abnormal signal shadow is observed in the anterior longitudinal fissure of the brain, displaying isointense signal on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR, with marked enhancement on T1-weighted images with contrast (T1C), with approximate dimensions of 77*69*66mm. Surrounding edema is present as well as compression of the anterior horns of the lateral ventricles on both sides. There is a shift of midline structures to the right.",
    "BraTS-MEN-00349-000": "A mass-like abnormal signal is observed in the left cranial base, presenting an isointense signal on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, and slightly hyperintense on FLAIR. There is moderate enhancement post-contrast on T1-weighted imaging. The mass measures approximately 46*39*35 mm, causing compression and mild edema on the left cerebellar hemisphere. No midline shift is observed.",
    "BraTS-MEN-00353-000": "A mass-like abnormal signal is observed in the right frontal lobe, exhibiting isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, and isointense signal on FLAIR. After contrast administration, the lesion shows uneven enhancement, measuring approximately 78*97*84 mm in size, with marked surrounding edema. The midline structures are shifted to the left, and the frontal horns of both lateral ventricles are compressed.",
    "BraTS-MEN-00357-000": "A small patchy area of abnormal signal is visible below the skull plate on the left frontal part, displaying isointense on T1-weighted imaging, isointense on T2-weighted imaging, hyperintense on FLAIR, and demonstrates significant enhancement on contrast-enhanced T1-weighted imaging, measuring approximately 12*15*11 mm. There is no displacement of midline structures.",
    "BraTS-MEN-00367-000": "A mass-like abnormal signal is visible adjacent to the superior sagittal sinus above the posterior cerebral longitudinal fissure, showing an isointense signal on T1W, slightly hyperintense on T2W, slightly hyperintense on FLAIR, and a marked enhancement on T1C with a size of approximately 23*31*27 mm. The midline structures are not displaced, and there is mild compression of brain parenchyma in the left parieto-occipital lobe.",
    "BraTS-MEN-00369-000": "A mass-like abnormal signal shadow can be seen beneath the skull plate in the right frontal-temporal region, showing isointense on T1W images, slightly hyperintense on T2W images, hyperintense on FLAIR images, and significant enhancement on T1C images. The size is approximately 49*55*48 mm with peritumoral cystic foci and edema. There is mild leftward deviation of the midline structures.",
    "BraTS-MEN-00380-000": "A mass-like abnormal signal intensity is observed adjacent to the falx cerebri in the left parietal region, presenting as isointense to low signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, hyperintense signal on FLAIR sequence, and exhibits significant enhancement on T1 post-contrast imaging. The size of the lesion is approximately 26*29*32 mm. No midline shift is noted.",
    "BraTS-MEN-00381-000": "Mass-like abnormal signals are visible in the bilateral cerebellopontine angle region, presenting with isointense signal on T1W images, isointense signal on T2W images, slightly hyperintense signal on FLAIR images, and markedly inhomogeneous enhancement on T1C images. The lesion on the left side is larger, approximately 46*51*39mm in size, with peritumoral edema. There is no shift of midline structures.",
    "BraTS-MEN-00382-000": "A mass-like abnormal signal is observed beneath the left frontal bone, showing isointensity on T1-weighted imaging, isointensity on T2-weighted imaging, slightly hyperintense on FLAIR, and significant enhancement on T1 post-contrast. The size of the lesion is approximately 53*62*68 mm, with surrounding edema. The midline structures are slightly deviated to the right.",
    "BraTS-MEN-00405-000": "A mass with abnormal signal is present in the left cerebellopontine angle region, displaying isointense on T1W images, mixed signal intensity on T2W and FLAIR images, and showing uneven enhancement post-contrast with gadolinium on T1C images. The mass measures approximately 74 * 61 * 62 mm and is exerting pressure on the adjacent brain tissue and the fourth ventricle, accompanied by peritumoral edema. There is no midline shift.",
    "BraTS-MEN-00415-000": "A mass of abnormal signal shadow can be seen under the left frontal cranial plate, with an irregular shape, partially crossing the midline, displaying isointense signal on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, slightly hyperintense on FLAIR sequence imaging. Around the lesion, a large area of edema is visible, and the lesion shows evident, uneven enhancement on T1C imaging. The adjacent meninges and falx cerebri appear thickened, with approximate dimensions of 77*90*74mm. The left lateral ventricle is compressed with a rightward shift of midline structures.",
    "BraTS-MEN-00416-000": "A mass-like abnormal signal shadow is visible beneath the skull plate of the right temporal region, showing T1W isointense signal, slightly hyperintense on T2W, slightly hyperintense on FLAIR, with marked enhancement on T1C. The size of the lesion is approximately 41*59*43 mm, with perilesional edema, and compression and narrowing of the right lateral ventricle. The midline structures are mildly deviated to the left.",
    "BraTS-MEN-00423-000": "A small nodule is visible adjacent to the falx cerebri at the junction of the left frontal and parietal lobes, showing isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR, and significant enhancement on T1 post-contrast images. The nodule has a clear boundary, measuring approximately 10*14*20 mm. There is no midline shift.",
    "BraTS-MEN-00425-000": "A mass-like abnormal signal shadow is visible beneath the cranial plate of the right frontal part, with dimensions approximately 90*110*85 mm. It exhibits an isointense signal on T1-weighted imaging and T2-weighted imaging, a high signal on FLAIR, and marked enhancement on T1 post-contrast. There is significant peritumoral edema, and the bilateral lateral ventricles are compressed and narrowed. Midline structures are displaced to the left.",
    "BraTS-MEN-00437-000": "A mass-like abnormal signal is observed beneath the skull plate of the right temporal region, presenting as isointense on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR sequences, and demonstrating significant enhancement post-T1 contrast, measuring approximately 11*14*15 mm. There is no midline shift.",
    "BraTS-MEN-00438-000": "A mass-like abnormal signal is observed on the right side of the falx cerebri, showing isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, slightly hyperintense on FLAIR, and moderate enhancement on T1 post-contrast. The size is approximately 52*69*57mm, with peritumoral edema. There is a slight leftward shift of the midline structures.",
    "BraTS-MEN-00451-000": "A small lesion with an abnormal signal is visible near the large foramen of the occipital bone on the right side of the posterior cranial fossa, presenting as isointense on T1W, and slightly hyperintense on T2W and FLAIR sequences. After enhancement, there is obvious strengthening with dimensions of approximately 25*34*26mm; the medulla oblongata shows an abnormal signal, presenting as hypointense on T1W and hyperintense on T2W and FLAIR sequences, with no obvious enhancement after contrast. The midline structures are not displaced.",
    "BraTS-MEN-00465-000": "A mass-like abnormal signal shadow is visible in the right frontal temporal lobe, showing isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, and hyperintense signal on FLAIR. After administration of contrast (T1C), there is marked enhancement of the lesion, which measures approximately 62*89*81mm. Peritumoral edema is present, and the right lateral ventricle is compressed and narrowed. There is a slight leftward shift of the midline structures.",
    "BraTS-MEN-00467-000": "A small patchy area of abnormal signal is noted in the right frontal lobe, exhibiting iso-signal on T1W sequence, slightly hyperintense on T2W sequence, slightly hyperintense on FLAIR sequence, with significant enhancement on T1C, measuring approximately 33*17*21mm. There is no midline shift.",
    "BraTS-MEN-00468-000": "A mass-like abnormal signal is observed beneath the calvaria of the left temporal-occipital region, displaying isointense signals on T1W and T2W sequences, and hyperintense signal on FLAIR sequence. Within the center of the lesion, there is a small area that exhibits low signal on T1W and high signal on T2W. A large area of edema signal is present around the lesion. Post-contrast enhancement is uneven, with the solid portion of the lesion showing marked enhancement, measuring approximately 43*55*51 mm. There is no shift of midline structures.",
    "BraTS-MEN-00478-000": "An abnormal signal nodule is observed beneath the skull plate in the left frontal region, presenting with isointense signals on T1W and T2W sequences, slightly hyperintense on FLAIR, and showing marked enhancement on T1C, with dimensions approximately 11*14*11mm. No midline shift is detected.",
    "BraTS-MEN-00491-000": "In the anterior interhemispheric fissure, a mass-like abnormal signal shadow is seen, which presents as isointense on T1-weighted imaging, isointense on T2-weighted imaging, slightly hyperintense on FLAIR, and shows significant enhancement post-contrast administration with dimensions of about 63*48*37 mm. There is perilesional edema, and the adjacent brain parenchyma is mildly compressed. There is no midline shift.",
    "BraTS-MEN-00497-000": "A patchy abnormal signal is visible on the right side of the cerebellar tentorium, presenting as an isointense or hypointense signal on T1W, a mixed high and low signal on T2W, a mixed high and low signal on FLAIR, and non-uniform enhancement on T1C. The size of the lesion is approximately 52*81*34mm. There is no shift in midline structures.",
    "BraTS-MEN-00511-000": "A mass-like abnormal signal is seen adjacent to the falx cerebri on the right frontal region, displaying isointense signal on T1-weighted (T1W) images and slightly hyperintense signal on T2-weighted (T2W) and FLAIR sequences. Surrounding edema is observed, with compression of the adjacent brain tissue. After contrast administration (T1C), the lesion exhibits marked but inhomogeneous enhancement, measuring approximately 43*55*52 mm. There is no midline shift detected.",
    "BraTS-MEN-00512-000": "A mass-like abnormal signal shadow can be seen below the skull plate of the left frontal temporal region, presenting as isointense on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR images, and exhibiting uneven enhancement on T1-weighted images with contrast. The approximate size of the lesion is 58*102*84 mm, with surrounding edema. The right lateral ventricle is compressed and narrowed. There is a slight deviation of the midline structures to the right.",
    "BraTS-MEN-00523-000": "On the left side, around the circumpool and in the pontine-cerebellar angle region, a mass-like abnormal signal is visible. It presents with an isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, hyperintense signal on FLAIR, and mild enhancement on T1-weighted imaging with contrast. The dimensions are approximately 43*52*44 mm, with surrounding edema. There is no midline shift. The brainstem and the left cerebellar hemisphere are compressed.",
    "BraTS-MEN-00530-000": "An abnormal signal nodule shadow is visible adjacent to the falx cerebri in the right frontal lobe, with a clear boundary, showing iso-signal on T1W, iso-signal on T2W, and high signal on FLAIR. T1C exhibits obvious enhancement. The size of the lesion is approximately 13*16*16 mm. There is no midline shift.",
    "BraTS-MEN-00534-000": "A small cluster-like abnormal signal shadow is observed in the suprasellar region, presenting with iso-signal on T1W, iso-signal on T2W, iso-signal on FLAIR, and significant enhancement on T1C. The size is approximately 20*15*12mm. There is no shift of midline structures.",
    "BraTS-MEN-00540-000": "Mass-like abnormal signals are observed under the left frontal-temporal lobes and the right temporal part of the cranial plate. The signals are iso-intense on T1-weighted images and T2-weighted images, slightly hyperintense on FLAIR sequences, and show significant enhancement on T1-weighted images with contrast (T1C). The approximate size of the lesion is 81*103*78 mm. Surrounding the left lesion, there is peritumoral edema and cystic degeneration. The midline structures are shifted to the right, and the left lateral ventricle is compressed and narrowed.",
    "BraTS-MEN-00547-000": "A mass-like abnormal signal shadow can be seen beneath the calvaria in the left frontotemporal region, showing isointense signal on T1W, isointense signal on T2W, and high signal on FLAIR. There is obvious enhancement with T1C. The size of the lesion is approximately 21*24*22 mm. There is a mild rightward deviation of midline structures.",
    "BraTS-MEN-00553-000": "A mass-like abnormal signal is observed in the right temporal lobe, presenting as an isointense signal on T1-weighted imaging, hypointense on T2-weighted imaging, hypointense on FLAIR, and demonstrates significant enhancement post-contrast administration with approximate dimensions of 30*41*34mm, accompanied by perilesional edema. There is no midline shift.",
    "BraTS-MEN-00555-000": "A small nodule can be seen beneath the right frontal bone plate, displaying iso-intense signal on T1W and T2W sequences, slightly hyperintense on FLAIR, and significantly enhanced on T1 post-contrast (T1C), with clear boundaries, measuring approximately 11*12*7 mm. There is no shift in midline structures.",
    "BraTS-MEN-00566-000": "A mass-like abnormal signal shadow is visible beneath the right parietal calvarium, presenting an isointense signal on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, hyperintense on FLAIR imaging, and showing marked enhancement after T1 contrast. The approximate size of the lesion is 48x54x63mm, with peritumoral edema. There is no midline shift.",
    "BraTS-MEN-00583-000": "An abnormal signal nodule shadow can be seen at the base of the left anterior cranial fossa, displaying iso-signal on T1W, T2W sequences, slightly hyperintense on FLAIR, and significantly enhanced on T1C, with a clear boundary, measuring approximately 14*16*15mm. There is no shift in midline structures.",
    "BraTS-MEN-00594-000": "A mass-like abnormal signal is observed beneath the left frontal cranial plate, presenting with iso-signal intensity on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR images, and significant enhancement on T1-weighted images with contrast. The size is approximately 14*12*13mm. There is no displacement of midline structures.",
    "BraTS-MEN-00601-000": "Beneath the left parietal bone and on the right temporal side, a mass-like abnormal signal shadow is visible, which shows isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, hyperintense signal on FLAIR, and marked enhancement on T1 post-contrast imaging, approximately 61*77*67mm in size. There is cerebral edema around the tumor at the left parietal top. The midline structures are slightly shifted to the right.",
    "BraTS-MEN-00606-000": "Underneath the left parietal bone, a mass-like abnormal signal shadow can be seen. It presents with an isointense signal on T1W, slightly hyperintense on T2W, slightly hyperintense on FLAIR, and shows significant enhancement post-contrast (T1C), along with a dural tail sign. The size is approximately 19*22*24 mm. There is no midline shift.",
    "BraTS-MEN-00608-000": "Bilateral mass-like abnormal signals are observed adjacent to the falx cerebri in the frontal lobes. These lesions appear dumbbell-shaped, crossing the midline, showing iso- or low signal intensity on T1W, slightly high signal intensity on T2W and FLAIR. The lesions demonstrate obvious enhancement post-contrast (T1C), with the enhancement being uniform. The approximate size of the lesion is 69*53*59mm. There is no midline shift.",
    "BraTS-MEN-00619-000": "A mass-like abnormal signal is observed beneath the right frontal cranial plate, which shows isointense signal on T1W, isointense signal on T2W, hyperintense signal on FLAIR, and significant enhancement on T1C, measuring approximately in 31*39*32 millimeters. The midline structures demonstrate a leftward deviation without displacement, and the right frontal lobe parenchyma is compressed.",
    "BraTS-MEN-00621-000": "A mass-like abnormal signal is visible in the anterior interhemispheric fissure of the brain, demonstrating iso signal on T1-weighted imaging (T1W), iso signal on T2-weighted imaging (T2W), slightly hyperintense signal on Fluid-Attenuated Inversion Recovery (FLAIR) sequences, and inhomogeneous enhancement on post-contrast T1 imaging (T1C). The approximate size of the lesion is 114*96*75 mm, with perilesional edema observed. There is a rightward shift of the midline structures.",
    "BraTS-MEN-00622-000": "Under the left parietal bone and in the left frontal-temporal region, a mass-like abnormal signal shadow is observed, presenting with iso-signal on T1W imaging, slightly hyperintense signal on T2W imaging, and hyperintense signal on FLAIR imaging. The lesion shows significant enhancement on T1W imaging post-contrast (T1C) with approximate dimensions of 21*24*21 mm. There is no shift of midline structures.",
    "BraTS-MEN-00625-000": "A mass-like abnormal signal is visible in the left frontal region, showing iso to low signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR sequences, with marked and uneven enhancement on contrast-enhanced T1-weighted images. There is a cerebrospinal fluid cleft and edema band visible around the edge of the lesion, with approximate dimensions of 54*62*63mm. There is no shift in midline structures.",
    "BraTS-MEN-00630-000": "At the midline of the anterior cranial fossa, there is a mass-like abnormal signal focus that is low signal on T1W, slightly high signal on T2W, high signal on FLAIR, and shows obvious enhancement on contrast-enhanced T1-weighted images (T1C). Surrounding the lesion, there is a non-enhanced edematous band. The dimensions of the lesion are approximately 88*70*67 mm. There is no shift of the midline structures.",
    "BraTS-MEN-00636-000": "A mass-like abnormal signal is seen below the skull plate of the right frontal region, which presents with isointense signal on T1-weighted imaging (T1W), isointense signal on T2-weighted imaging (T2W), and hyperintense signal on Fluid-attenuated inversion recovery (FLAIR). There is uneven mild enhancement post-contrast (T1C) with approximate dimensions of 60*61*60 mm. There is mild edema around the tumor, and adjacent brain parenchyma is compressed. The midline structures are shifted to the left.",
    "BraTS-MEN-00637-000": "A mass-like abnormal signal is seen in the left cerebellopontine angle region, which appears isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, hyperintense on FLAIR, and demonstrates mild enhancement on T1 post-contrast. The size is approximately 20*21*20 mm. There is no shift of midline structures.",
    "BraTS-MEN-00648-000": "A small nodular shadow can be seen beneath the cranial plate of the left frontal lobe, presenting with isointense signal on T1-weighted and T2-weighted imaging, slightly hyperintense on FLAIR imaging, and significant enhancement on T1 post-contrast imaging. The nodule has a clear boundary and measures approximately 11*13*6 mm. There is no midline shift.",
    "BraTS-MEN-00650-000": "A small mass-like abnormal signal is visible beneath the skull plate in the right frontal region, presenting as isointense on T1W, isointense on T2W, slightly hyperintense on FLAIR, with marked enhancement on T1C, measuring approximately 13*12*13mm. There is no shift of midline structures.",
    "BraTS-MEN-00658-000": "A mass-like abnormal signal is seen in the right cerebellopontine angle region, which appears isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, hyperintense on FLAIR sequence, and shows significant enhancement on T1-weighted imaging post-contrast administration. The size of the lesion is approximately 19*20*22 mm. There is no shift of midline structures.",
    "BraTS-MEN-00659-000": "A mass-like abnormal signal shadow can be seen beneath the cranial plate of the right frontal region. It presents with an isointense signal on T1W, slightly hyperintense on T2W, hyperintense on FLAIR, and shows obvious enhancement on T1C. The size of the lesion is approximately 36*22*17mm. There is no shift in the midline structures.",
    "BraTS-MEN-00686-000": "A mass-like abnormal signal shadow is seen beneath the skull plate in the right frontal area, which shows iso-intense signal on T1-weighted imaging, and T2-weighted imaging, and iso-intense signal on FLAIR. Moderate enhancement is seen on T1C with the size of approximately 94*122*90 mm. Surrounding edema is noted, and the frontal horn of the lateral ventricles on both sides are compressed and narrowed. There is a left deviation of midline structures.",
    "BraTS-MEN-00688-000": "A mass with abnormal signal intensity is observed in the left middle cranial fossa, presenting with a broad base and irregular shape. It shows isointense on both T1-weighted and T2-weighted images, slightly hyperintense on FLAIR sequence. Extensive edema signal is noted around the lesion. After contrast administration (T1C), there is significant enhancement of the lesion with the presence of the 'tail sign.' The lesion measures approximately 53 x 82 x 55 mm. Compression of the right lateral ventricle is seen, with a mild rightward shift of midline structures.",
    "BraTS-MEN-00696-000": "On the right side of the cerebral longitudinal fissure, there is a mass-like abnormal signal shadow, exhibiting isointense on T1-weighted images, slightly hyperintense on T2-weighted images, and hyperintense on FLAIR. It shows obvious enhancement on T1 with contrast and measures approximately 47*96*58mm, with surrounding edema. No midline shift is observed. Adjacent to the posterior longitudinal fissure of the brain, below the right temporal bone plate, and on the right side of the cerebellar tentorium, there is a mass-like abnormal signal shadow which has a similar signal pattern to the lesion in the cerebral longitudinal fissure and measures approximately the same. No midline shift is observed.",
    "BraTS-MEN-00703-000": "A small cluster-like abnormal signal is observed in the left cerebellopontine angle region, showing isointense on T1-weighted images, isointense on T2-weighted images, slightly hyperintense on FLAIR, and significantly enhanced on T1 post-contrast. The size is approximately 12 x 9 x 11 mm. There is no shift in midline structures.",
    "BraTS-MEN-00706-000": "Bilateral frontoparietal skull plate lesions are visible with mass-like abnormal signals, showing isointense signals on T1WI, isointense signals on T2WI, slightly hyperintense signals on FLAIR, and significantly enhanced after T1 contrast, measuring approximately 69*70*47mm, with mild edema around the tumor. No midline shift.",
    "BraTS-MEN-00712-000": "Multiple grouped abnormal signal shadows are seen under the cerebral longitudinal fissure, sub-parieto-occipital bone plate and at the cranial base, presenting with isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, hyperintense signal on FLAIR, and marked enhancement on T1 with contrast, measuring approximately 46*29*82mm. Midline structures are not displaced.",
    "BraTS-MEN-00717-003": "A nodular abnormal signal is visible on the right side of the cerebral longitudinal fissure, presenting as isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, hyperintense on FLAIR, and shows significant enhancement post-contrast with size approximately 12*22*20mm. There is no midline shift.",
    "BraTS-MEN-00725-000": "A mass-like abnormal signal shadow is seen under the meninges on the right side of the top of the head in the cerebral longitudinal fissure, showing isointense signal on T1-weighted imaging, isointense signal on T2-weighted imaging, and isointense signal on FLAIR sequence. After administration of T1 contrast, there is obvious enhancement, with dimensions of approximately 74*114*68 mm, with peritumoral edema. There is no midline shift.",
    "BraTS-MEN-00726-000": "There is a small patchy abnormal signal shadow in the right temporal region, which shows isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, and slightly hyperintense on FLAIR imaging, and exhibits significant enhancement after contrast (T1C). The size is approximately 16*26*17 mm. There is no shift in the midline structures.",
    "BraTS-MEN-00743-001": "There is a mass-like abnormal signal in the left cerebellopontine angle region. It appears isointense on T1-weighted imaging (T1W), isointense on T2-weighted imaging (T2W), and hyperintense on FLAIR sequence. After administration of contrast (T1C), there is mild and uneven enhancement. The size of the lesion is approximately 48*51*44mm. There is mild edema around the tumor, with the adjacent brain parenchyma being compressed. The midline structures are shifted to the right.",
    "BraTS-MEN-00758-000": "A mass-like abnormal signal is seen below the cranial plate on the right temporal side, displaying iso-signal on T1 weighted imaging, slightly hyperintense signal on T2 weighted imaging, high signal on FLAIR, and moderate enhancement on T1 weighted post-contrast imaging. The size is approximately 51*53*58 mm with mild edema around the tumor. Midline structures are slightly deviated to the left.",
    "BraTS-MEN-00759-000": "A mass-like abnormal signal shadow is observed below the calvarium of the right frontal part, presenting with iso-intense signal on T1-weighted images, iso-intense signal on T2-weighted images, and hyperintense signal on FLAIR. After T1 contrast administration, there is evident enhancement. Its size is approximately 13x14x11 mm. There is no displacement of midline structures.",
    "BraTS-MEN-00768-000": "A small abnormal signal focus can be seen beneath the skull plate in the left frontal region. It presents with isointense signals on T1W, T2W, slightly hyperintense on FLAIR, and shows significant enhancement on T1C. The size is approximately 22*31*16mm. There is no shift of midline structures.",
    "BraTS-MEN-00774-000": "A mass-like abnormal signal shadow can be observed under the skull plate of the right frontal lobe, presenting as isointense on T1-weighted imaging, slightly hyperintense on T2-weighted and FLAIR sequences, with obvious enhancement of the lesion after contrast (T1C) and visible signs of meningeal tailing. The dimensions are approximately 43 * 51 * 49 mm, causing compression of the right lateral ventricle. There is no shift of midline structures.",
    "BraTS-MEN-00777-000": "A mass-like abnormal signal is seen adjacent to the cerebellar tentorium in the right occipital region, exhibiting iso- to low signal on T1-weighted images, high signal on T2-weighted images, and high signal on FLAIR sequences, with significant enhancement on T1-weighted images with contrast. The boundary is clear, with approximate dimensions of 27*32*37 mm. There is no midline shift.",
    "BraTS-MEN-00779-000": "Under the skull plate in the left parieto-occipital region, a mass-like abnormal signal is observed, showing isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR, and marked enhancement on T1 post-contrast images, with a size of approximately 48*61*61mm, accompanied by peritumoral edema. There is no midline shift.",
    "BraTS-MEN-00781-008": "A mass-like abnormal signal is seen under the cranial plate in the right skull base and the left frontal region, showing iso-intensity on T1-weighted imaging (T1WI), iso-intensity on T2-weighted imaging (T2WI), slightly hyperintense on FLAIR, and marked enhancement on T1WI post-contrast (T1C). The size is approximately 24*26*23 mm. There is no midline shift.",
    "BraTS-MEN-00781-010": "A mass-like abnormal signal is observed at the right skull base, showing isointense signal on T1W images, isointense signal on T2W images, and isointense signal on FLAIR. After contrast (T1C), there is significant enhancement. The size is approximately 23*25*24 mm. There is no midline shift.",
    "BraTS-MEN-00790-000": "A fusiform abnormal signal shadow can be seen beneath the skull plate of the right temporal region, showing isointense signal on T1W, slightly hyperintense signal on T2W, hyperintense signal on FLAIR, with marked enhancement on T1C, measuring approximately 19*17*21mm. No shift of midline structures.",
    "BraTS-MEN-00805-000": "A small nodular lesion is observed beneath the right frontal calvarium, which exhibits iso-intense signal on T1-weighted and T2-weighted images, slightly hyperintense signal on FLAIR sequence, and marked enhancement on T1-weighted contrast (T1C) images. The lesion has clear boundaries and measures approximately 13*11*18 mm. There is no midline shift.",
    "BraTS-MEN-00809-000": "A mass-like abnormal signal is seen on the left side of the posterior longitudinal fissure of the brain, presenting with isotense on T1-weighted images, isotense on T2-weighted images, and slightly hyperintense on FLAIR images. The lesion is markedly enhanced after contrast (T1C) and measures approximately 56*67*84 mm, with significant surrounding edema. There is no shift of midline structures.",
    "BraTS-MEN-00817-000": "A mass-like abnormal signal focus is seen below the left temporal pole skull plate, showing hypointense on T1W images, isointense on T2W images, hyperintense on FLAIR images, and demonstrating significant enhancement on T1C, measuring approximately 43*42*34mm. In the right frontal operculum, a patchy abnormal signal shadow is observed, displaying hypointense on T1W images, hyperintense on T2W images, with a center presenting low signal and the periphery showing high signal on FLAIR images, without obvious enhancement post-contrast. No midline shift is noted.",
    "BraTS-MEN-00820-000": "A mass-like abnormal signal is observed in the anterior interhemispheric fissure, showing isointense signal on T1-weighted imaging (T1W), isointense signal on T2-weighted imaging (T2W), hyperintense on FLAIR, with marked enhancement on T1 post-contrast (T1C). The size is approximately 11*18*19 mm. No midline shift is detected.",
    "BraTS-MEN-00825-000": "A mass-like abnormal signal focus can be seen beneath the skull plate on the right frontal part, presenting with isointense on T1-weighted (T1W) and T2-weighted (T2W) images, slightly hyperintense on FLAIR sequence, and showing apparent uniform enhancement after administering gadolinium-based contrast material (T1C) with evidence of the dural tail sign, measuring approximately 34*35*51 mm. No shift in midline structures.",
    "BraTS-MEN-00833-000": "Two mass-like abnormal signal shadows are visible on the right frontal parietal region, presenting as isointense on T1W, slightly hyperintense on T2W, hyperintense on FLAIR, with significant enhancement on T1C. The dimensions are approximately 82*92*65mm. There is mild edema around the tumor, and the right lateral ventricle is compressed and narrowed. Midline structures are shifted to the left.",
    "BraTS-MEN-00837-000": "A small patchy abnormal signal shadow is visible below the cranial plate in the left frontal region, showing isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, slightly hyperintense signal on FLAIR, and significant enhancement on T1 contrast-enhanced imaging, measuring approximately 12*10*12 mm. No midline shift.",
    "BraTS-MEN-00840-000": "A mass-like abnormal signal shadow is seen adjacent to the superior sagittal sinus in the posterior interhemispheric fissure, with signals iso-intense on T1W, slightly hypo-intense on T2W, slightly hyper-intense on FLAIR, and shows obvious enhancement on T1C, measuring approximately 12*12*13 mm. There is no midline shift.",
    "BraTS-MEN-00848-000": "A mass-like abnormal signal shadow can be seen beneath the right parietal bone, showing isointense signal on T1W, isointense signal on T2W, hyperintense signal on FLAIR, with marked enhancement post T1 contrast, measuring approximately 18*21*26mm. There is no midline shift.",
    "BraTS-MEN-00854-000": "A mass-like abnormal signal is observed in the right parieto-occipital lobe and the posterior horn of the lateral ventricle. The shape is irregular with parts extending across the midline. It appears as a low signal on T1-weighted imaging, slightly hyperintense on T2-weighted and FLAIR sequences. Surrounding the lesion, there is an extensive edema signal, and after contrast administration, there is marked enhancement of the lesion which measures approximately 90*113*86 mm. The right lateral ventricle is compressed. There is a slight shift of midline structures to the left.",
    "BraTS-MEN-00861-000": "A mass-like abnormal signal is observed beneath the left parietal calvarium, exhibiting isointense signal on T1W, slightly hyperintense signal on T2W and FLAIR, with marked enhancement on T1C. The lesion measures approximately 34*32*25 mm and the adjacent brain parenchyma is compressed. There is no midline shift.",
    "BraTS-MEN-00876-000": "A mass-like abnormal signal shadow is visible in the cerebral anterior interhemispheric fissure, presenting as isointense on T1-weighted imaging (T1WI), isointense on T2-weighted imaging (T2WI), hyperintense on Fluid-Attenuated Inversion Recovery (FLAIR) imaging, and demonstrates significant enhancement on contrast-enhanced T1WI (T1C). The size of the lesion is approximately 24*25*13 mm. There is no shift of midline structures.",
    "BraTS-MEN-00878-000": "A small patchy abnormal signal shadow can be seen in the left frontal lobe, showing isointense signals on T1W, T2W, FLAIR, with marked enhancement on T1W post-contrast (T1C), measuring approximately 8*9*7 mm in size. There is no shift in midline structures.",
    "BraTS-MEN-00895-000": "A small plaque-like abnormal signal shadow can be seen beneath the cranial plate of the left frontal region, presenting with an isointense signal on T1-weighted images, isointense on T2-weighted images, isointense on FLAIR, and significant enhancement on T1-weighted imaging with contrast. The size is approximately 11 x 9 x 10 mm. There is no shift of midline structures.",
    "BraTS-MEN-00897-000": "A mass-like abnormal signal shadow is visible in the right cerebellopontine angle region, presenting with iso-signal intensity on T1W, slightly hyperintense on T2W, hyperintense on FLAIR, and marked enhancement on T1 post-contrast. The size is approximately 31*33*37 mm, with mild peritumoral edema. There is no midline shift.",
    "BraTS-MEN-00898-000": "A mass-like abnormal signal is visible in the left frontal lobe, presenting with iso-intense signal on T1-weighted sequence, iso-intense signal on T2-weighted sequence, slightly hyperintense signal on FLAIR sequence, and obvious enhancement on T1-weighted contrast sequence; with an approximate size of 55*70*70mm, and peritumoral edema. There is a slight deviation of midline structures to the right, and mild compression and narrowing of the anterior horn of the left lateral ventricle.",
    "BraTS-MEN-00906-000": "A mass-like abnormal signal focus is visible in the right cerebellopontine angle region, with a broad base, compressing the brainstem and showing isointense signal on T1W and T2W sequences, slightly hyperintense on FLAIR sequence, and significant enhancement on T1C with evidence of a dural tail sign. The dimensions of the lesion are approximately 43*53*42 mm. No midline shift is observed.",
    "BraTS-MEN-00911-000": "A mass-like abnormal signal is visible beneath the right frontal calvarium, displaying isointense signal on T1W, isointense signal on T2W, slightly hyperintense signal on FLAIR, and significant enhancement after contrast (T1C); measuring approximately 38*49*36mm, the adjacent brain parenchyma is compressed. There is no shift of midline structures.",
    "BraTS-MEN-00920-000": "A nodular abnormal signal shadow is observed adjacent to the anterior interhemispheric fissure of the brain, presenting as isointense on T1W, slightly hypointense on T2W, slightly hyperintense on FLAIR, with significant enhancement on T1C; the size is approximately 13*16*8 mm. There is no midline shift.",
    "BraTS-MEN-00930-000": "A mass-like abnormal signal shadow can be seen beneath the right parietal bone, presenting as isointense on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR, and showing uneven enhancement on T1 post-contrast images, measuring approximately 64*45*33 mm. There is no midline shift, and the right parietal lobe brain parenchyma is mildly compressed.",
    "BraTS-MEN-00932-006": "An abnormal signal nodule is seen in front of the left pons, showing slightly low signal on T1-weighted imaging, isointense signal on T2-weighted imaging, hyperintense signal on FLAIR sequences, and marked enhancement on T1-weighted imaging post-contrast. The lesion has a clear boundary and measures approximately 16*11*14 mm. There is no midline shift.",
    "BraTS-MEN-00932-009": "A nodular abnormal signal is observed in the left cerebellopontine angle, showing isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, hyperintense on FLAIR, and with significant enhancement on T1-contrast imaging, measuring approximately 12*11*13 mm. There is no midline shift.",
    "BraTS-MEN-00940-000": "A mass-like abnormal signal is observable under the right frontal bone plate, showing isointense signal on T1-weighted images (T1W), isointense signal on T2-weighted images (T2W), slightly hyperintense signal on Fluid-attenuated inversion recovery (FLAIR), and marked enhancement on T1-weighted contrast-enhanced images (T1C); the mass measures approximately 18*20*15 mm. There is no midline shift.",
    "BraTS-MEN-00941-000": "In the left cerebellopontine angle region, there is a lesion with an isointense signal on T1-weighted images, isointense signal on T2-weighted images, hyperintense signal on FLAIR sequence, and prominent enhancement on T1-weighted images with contrast. The lesion measures approximately 21*21*20 mm. No shift of midline structures.",
    "BraTS-MEN-00942-000": "A mass-like abnormal signal is seen in the cerebral longitudinal fissure pool, displaying equal signal intensity on T1-weighted sequences, equal signal intensity on T2-weighted sequences, high signal on FLAIR, and marked enhancement on T1 post-contrast, measuring approximately 17*17*24 mm. There is no midline shift.",
    "BraTS-MEN-00950-000": "A small patchy abnormal signal shadow can be seen in the right temporal region, presenting with iso-intense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, iso-intense signal on FLAIR, and pronounced enhancement on T1 post-contrast series, measuring approximately 10*9*9 mm. There is no shift of midline structures.",
    "BraTS-MEN-00951-000": "Group-like abnormal signal shadows are visible beneath the precentral cerebellar cistern, in the right cerebellopontine angle area, and beneath the calvarium of the left temporal region, presenting with an isointense signal on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR, and showing marked enhancement with contrast medium (T1C). The size of the lesion is approximately 35*51*19 mm. There is no displacement of midline structures.",
    "BraTS-MEN-00971-000": "A mass-like abnormal signal is observed beneath the skull plate of the left frontal area, showing a signal intensity on T1-weighted images (T1W) equivalent to the surrounding tissue, slightly hyperintense on T2-weighted images (T2W), slightly hyperintense on Fluid-attenuated inversion recovery sequence (FLAIR) images, and significantly enhanced following contrast (T1C). The dimensions of the abnormality are approximately 43*48*39 mm, with surrounding edema. There is no shift of the midline structures.",
    "BraTS-MEN-00983-008": "A mass-like abnormal signal is visible in the right temporal region, showing an isointense signal on T1-weighted imaging, isointense signal on T2-weighted imaging, slightly hyperintense signal on FLAIR imaging, and marked enhancement post-contrast administration with size approximately 21*31*24mm. There is no shift of midline structures.",
    "BraTS-MEN-00989-000": "A mass-like abnormal signal is observed in the right frontal lobe, presenting with an isointense signal on T1W, isointense signal on T2W, slightly hyperintense signal on FLAIR, and moderate enhancement on T1C. The dimensions of the lesion are approximately 52*64*41 mm, with perilesional edema. There is slight leftward deviation of midline structures.",
    "BraTS-MEN-00991-000": "A mass-like abnormal signal is observed on the right side of the longitudinal fissure of the brain, presenting with an isointense signal on T1-weighted images, isointense on T2-weighted images, slightly hyperintense on FLAIR with uneven signal, and showing uneven enhancement on T1 with contrast. The dimensions of the lesion are approximately 40 x 60 x 47 mm, with mild perilesional edema. There is a slight deviation to the left of the midline structures.",
    "BraTS-MEN-00999-000": "A nodular abnormal signal is visible in the anterior interhemispheric fissure, showing isointense signal on T1W, isointense signal on T2W, slightly hyperintense signal on FLAIR, and moderate enhancement on T1C, measuring approximately 13*15*14mm. There is no midline shift.",
    "BraTS-MEN-01003-008": "An abnormal signal nodule is visible below the skull plate in the left frontal region, showing isointense signal on T1W and T2W sequences, slightly hyperintense signal on FLAIR, with conspicuous enhancement after contrast (T1C), measuring approximately 14*20*16 mm. No midline shift is observed.",
    "BraTS-MEN-01006-000": "A small mass-like abnormal signal is observed on the right side of the skull base, presenting with an isointense signal on T1W, an isointense signal on T2W, a hyperintense signal on FLAIR, and marked enhancement on T1C. The size of the lesion is approximately 17*17*23mm. There is no midline shift.",
    "BraTS-MEN-01008-011": "A mass-like abnormal signal is observed in the right cerebellar tentorium, presenting with isointense signal on T1W, T2W, and FLAIR sequences. Post-contrast T1-weighted imaging shows marked enhancement. The lesion measures approximately 16*17*17 mm, with mild surrounding edema. There is no midline shift.",
    "BraTS-MEN-01014-000": "A mass-like abnormal signal shadow is seen on both sides of the cerebral falx in the frontal lobes. The mass crosses the midline and shows isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted and FLAIR imaging, and marked inhomogeneous enhancement on T1 post-contrast imaging. The size of the mass is approximately 56*51*54 mm. There is no midline shift.",
    "BraTS-MEN-01031-000": "A mass-like abnormal signal is observed in the anterior interhemispheric fissure, showing isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR, with marked enhancement post-gadolinium administration. The size is approximately 68*72*58 mm, with surrounding edema. There is a slight deviation of midline structures to the left.",
    "BraTS-MEN-01035-000": "A mass-like abnormal signal is seen underneath the skull plate in the left frontal lobe, presenting with isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, slightly hyperintense signal on FLAIR, and significant enhancement on T1 post-contrast. The dimensions are approximately 43*83*60mm, with surrounding edema. There is a slight shift of midline structures to the right, and compression and narrowing of the anterior horn of the left lateral ventricle.",
    "BraTS-MEN-01036-000": "A mass-like abnormal signal is observed beneath the left-sided calvarial vault, displaying isointense signal on T1-weighted (T1W) images, slightly hyperintense signal on T2-weighted (T2W) images, slightly hyperintense signal on Fluid Attenuated Inversion Recovery (FLAIR) images, and pronounced enhancement on T1 post-contrast (T1C) images. The size of the mass is approximately 54*67*66 mm with mild peritumoral edema. There is no midline shift.",
    "BraTS-MEN-01050-000": "A mass-like abnormal signal is observed underneath the right parietal calvarium, displaying isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, and slightly hyperintense signal on FLAIR imaging. The lesion exhibits non-homogeneous enhancement post-contrast (T1C) and measures approximately 30*26*34mm. There is mild edema around the tumor. No shift of midline structures is seen.",
    "BraTS-MEN-01052-000": "There is a small nodular abnormal signal shadow under the calvarial plate on the right frontal region, showing isointense on T1-weighted imaging, isointense on T2-weighted imaging, hyperintense on FLAIR sequence, with significant enhancement on T1 post-contrast. The lesion's size is approximately 9*14*16mm. No midline shift is observed.",
    "BraTS-MEN-01058-000": "A mass-like abnormal signal is observed adjacent to the cerebral longitudinal fissure, showing isointense signal on T1-weighted images, isointense signal on T2-weighted images, and isointense signal on FLAIR. Moderate enhancement is seen on T1-weighted post-contrast images, measuring approximately 12*12*12 mm. There is no midline shift.",
    "BraTS-MEN-01062-000": "An abnormal signal nodule is visible beneath the skull plate in the right frontal region, showing isointense on T1-weighted and T2-weighted imaging, slightly hyperintense on the FLAIR sequence, and marked enhancement upon administration of T1 contrast, measuring approximately 14*6*13 mm. There is no shift of the midline structures.",
    "BraTS-MEN-01065-000": "In the left cerebellopontine angle region, a mass-like abnormal signal is observed, which appears isointense on T1-weighted, T2-weighted, and FLAIR sequences. After T1 contrast (T1C) administration, there is significant enhancement. Its approximate size is 42*57*41 mm, with surrounding edema and compression of the adjacent brain parenchyma. No shift in midline structures.",
    "BraTS-MEN-01073-000": "A small patchy abnormal signal is visible in the left temporal region, showing isointense signal on T1 weighted images, isointense signal on T2 weighted images, slightly hyperintense signal on FLAIR sequences, and moderate enhancement on T1 with contrast. The dimensions of the lesion are approximately 11*14*11mm. There is no midline shift.",
    "BraTS-MEN-01090-000": "A mass-like abnormal signal is observed beneath the left parieto-occipital calvarium, presenting with isointense signal on T1-weighted images, isointense signal on T2-weighted images, slightly hyperintense signal on FLAIR, and marked enhancement on T1-weighted images with contrast. The lesion measures approximately 37x37x45 mm and is compressing the adjacent brain parenchyma. No midline shift is noted.",
    "BraTS-MEN-01102-000": "A mass-like abnormal signal shadow can be seen beneath the left frontal bone plate, presenting as isointense on T1-weighted images, slightly hypointense on T2-weighted images, hyperintense on FLAIR, and showing marked enhancement on contrast-enhanced T1-weighted images, measuring approximately 23*34*24mm. There is no shift of midline structures.",
    "BraTS-MEN-01108-000": "A mass-like abnormal signal is visible in the left temporal region, presenting as isointense on T1-weighted imaging, isointense on T2-weighted imaging, slightly hyperintense on FLAIR imaging, with significant enhancement on T1-weighted imaging following contrast (T1C). The lesion measures approximately 53 x 71 x 70 mm, accompanied by perilesional edema and compression of the adjacent brain parenchyma. There is a slight rightward shift of the midline structures.",
    "BraTS-MEN-01116-000": "A mass-like abnormal signal is observed in the right frontal-temporal region, presenting with iso-intense signal on T1-weighted imaging, T2-weighted imaging, and Fluid-attenuated inversion recovery (FLAIR) sequence. After contrast administration, the lesion exhibits moderate enhancement measuring approximately 50*72*52 mm. Surrounding edema is noted, and there is mild compression and narrowing of the anterior horn of the right lateral ventricle. There is a slight deviation of midline structures to the left.",
    "BraTS-MEN-01121-000": "A mass-like abnormal signal is visible adjacent to the falx cerebri in the right parietal lobe, which is irregular in shape, shows iso-signal on T1W and T2W, slightly hyperintense signal on FLAIR, and is significantly enhanced on T1C, measuring approximately 68*113*81mm. A large non-enhancing edematous zone can be seen around the lesion, and there is slight compression on the posterior horn of the right lateral ventricle. There is no shift of midline structures.",
    "BraTS-MEN-01126-000": "A mass-like abnormal signal shadow can be seen below the skull plate of the left frontal part, presenting as isointense on T1W, isointense on T2W, and isointense on FLAIR sequences. After T1C (contrast enhancement), it shows obvious enhancement. The size of the lesion is approximately 55*58*56 mm. The adjacent brain parenchyma is compressed with mild edema. There is a slight rightward shift of midline structures.",
    "BraTS-MEN-01128-000": "A strip-like abnormal signal shadow can be seen beneath the cranial plate in the left frontal-temporal region, presenting with iso-signal on T1W, iso-signal on T2W, high signal on FLAIR, and marked enhancement on T1C, measuring approximately 35*37*36mm. There is no displacement of midline structures.",
    "BraTS-MEN-01130-000": "A mass-like abnormal signal shadow is visible below the skull plate in the right frontal region, presenting with isointense signal on T1W, isointense signal on T2W, high signal on FLAIR, and marked enhancement on T1C, with approximate dimensions of 38*46*40mm. The adjacent brain parenchyma is compressed, and meningeal tail sign is observed. There is no midline shift.",
    "BraTS-MEN-01138-000": "In the anterior interhemispheric fissure of the brain, there are two mass-like abnormal signal shadows. They appear isointense on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR, and show marked enhancement with contrast (T1C). The masses are approximately 28*31*25 mm in size, with mild perilesional edema. There is no midline shift.",
    "BraTS-MEN-01148-000": "Two mass-like abnormal signal shadows are visible beneath the skull plate on the left parietal lobe top, showing isointense signal on T1-weighted imaging (T1W), isointense signal on T2-weighted imaging (T2W), slightly hyperintense signal on Fluid-attenuated inversion recovery (FLAIR) sequence, and significant enhancement on contrast-enhanced T1-weighted imaging (T1C), with a size of approximately 35*38*33mm. There is slight deviation of midline structures to the right.",
    "BraTS-MEN-01152-000": "A mass-like abnormal signal can be observed beneath the skullcap in the right parietal region, presenting with iso-intense signal on T1-weighted imaging, and slightly hyperintense signal on T2-weighted and FLAIR sequences. Within the center of the lesion, there are small areas of hypo-intense signal on T1WI and hyperintense signal on T2WI. After contrast enhancement, the solid portion of the tumor enhances significantly, with presence of the dural tail sign. The dimensions are approximately 56*55*59mm. The posterior horn of the right lateral ventricle is slightly compressed, and there is no midline shift.",
    "BraTS-MEN-01156-000": "A mass-like abnormal signal is observed in the left frontal parietal lobe, showing iso to low signal on T1W, slightly high signal on T2W and FLAIR, with uneven enhancement on T1 post-contrast. The size is approximately 98*105*69 mm, with perilesional edema. Both lateral ventricles are compressed and narrowed. There is a rightward shift of midline structures.",
    "BraTS-MEN-01170-000": "Under the left parietal bone, there is a mass-like abnormal signal, which appears as low signal on T1W, slightly high signal on T2W, and high signal on FLAIR. After contrast administration (T1C), it shows marked enhancement. The size is approximately 21*22*18mm, and the adjacent brain parenchyma is mildly compressed. There is no midline shift.",
    "BraTS-MEN-01179-000": "A mass-like abnormal signal is visible adjacent to the posterior interhemispheric fissure of the brain, presenting as isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, hyperintense on FLAIR imaging, with marked enhancement on T1 post-contrast, measuring approximately 34*34*42mm. No midline shift is observed.",
    "BraTS-MEN-01183-000": "On the right side of the cerebral longitudinal fissure, there is a mass-like abnormal signal shadow, showing mixed signal on T1-weighted images, mixed signal on T2-weighted images, mixed signal on FLAIR, and uneven enhancement on T1-weighted images with contrast (T1C). The dimensions of the mass are approximately 68*119*74 mm, with peritumoral edema. Both lateral ventricles are compressed and narrowed. The midline structures are displaced to the left.",
    "BraTS-MEN-01189-000": "A mass-like abnormal signal shadow is seen in the right frontal temporal lobe, presenting as isointense on T1-weighted imaging, isointense on T2-weighted imaging, hyperintense on FLAIR sequence, and shows mild enhancement on contrast-enhanced T1-weighted imaging, measuring approximately 40*42*41mm, causing compression and narrowing of the third ventricle. The midline structures are shifted to the left.",
    "BraTS-MEN-01191-000": "A mass-like abnormal signal shadow can be seen under the left vertex calvarium, presenting as isointense on T1W, slightly hyperintense on T2W, slightly hyperintense on FLAIR, with significant enhancement on T1C, measuring approximately 49*72*62mm. There is peritumoral edema, a dural tail sign is visible, and the posterior horn of the left lateral ventricle is mildly compressed and narrowed. No midline shift is observed.",
    "BraTS-MEN-01198-004": "A small cluster-like abnormal signal shadow is observed beneath the skull plate on the left frontal part, presenting as isointense on T1-weighted (T1W) imaging, isointense on T2-weighted (T2W) imaging, and hyperintense on Fluid Attenuated Inversion Recovery (FLAIR) imaging. The lesion demonstrates significant enhancement after T1 contrast (T1C), measuring approximately 13x13x12 mm. There is no shift in mid-line structures.",
    "BraTS-MEN-01202-000": "A mass-like abnormal signal is visible on the left side of the anterior interhemispheric fissure, showing isointense signal on T1W, slightly hyperintense on T2W, isointense on FLAIR, and uneven enhancement on T1C, measuring approximately 44*62*54mm, with peritumoral edema. The midline structures are slightly deviated to the right, and the left lateral ventricle is compressed and narrowed.",
    "BraTS-MEN-01214-000": "A mass-like abnormal signal shadow can be seen in the right frontal parietal lobe, presenting as isointense on T1W, slightly hyperintense on T2W, hyperintense on FLAIR, and showing prominent enhancement on T1C. The size is approximately 76*111*75 mm, with peritumoral edema noted. The midline structure is deviated to the left, and the right lateral ventricle is compressed and narrowed.",
    "BraTS-MEN-01216-000": "A mass-like abnormal signal shadow is visible beneath the skull plate of the left temporal region, showing isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR sequence, and marked enhancement on T1-weighted contrast (T1C) images, measuring approximately 48*86*70 mm, with peritumoral edema. No midline shift is observed.",
    "BraTS-MEN-01224-000": "A nodular abnormal signal shadow can be seen at the right cranial base, presenting as isointense on T1-weighted sequence, and hypointense on T2-weighted and FLAIR sequences. Post-contrast T1 (T1C) imaging shows marked enhancement. The size is approximately 12*7*12 mm. There is no shift of midline structures.",
    "BraTS-MEN-01225-000": "A mass with abnormal signal intensity is seen beneath the right frontal cranial plate, with a broad base, showing isointensity to low signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, and slightly hyperintense on FLAIR images. The lesion shows clear boundaries and significant enhancement after contrast administration (T1C). The dimensions of the lesion are approximately 17*29*27 mm. There is no midline shift detected.",
    "BraTS-MEN-01231-000": "A small nodule is visible adjacent to the cerebellar tentorium on the right side, showing isointense signal on T1-weighted and T2-weighted sequences, slightly hyperintense signal on FLAIR sequences, and significant enhancement on T1-weighted contrast-enhanced sequence, with dimensions of approximately 10*11*10mm. There is no midline shift.",
    "BraTS-MEN-01233-000": "On the right side of the posterior longitudinal fissure and the left side of the anterior longitudinal fissure, there is a mass-like abnormal signal shadow, presenting as isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, slightly hyperintense on FLAIR imaging, with moderate enhancement on T1-weighted imaging with contrast. The size of the lesion is approximately 48*47*46mm. There is mild peritumoral edema. The midline structures are slightly deviated to the left.",
    "BraTS-MEN-01234-000": "A mass-like abnormal signal is observed beneath the left parietal bone, presenting with isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR, and moderate enhancement on T1 post-contrast. The size is approximately 49*54*47 mm with mild surrounding edema. There is a slight rightward deviation of midline structures.",
    "BraTS-MEN-01237-000": "A mass-like abnormal signal shadow is visible under the left parietal bone, displaying an isointense signal on T1-weighted (T1W) images, slightly hyperintense signal on T2-weighted (T2W) images, and slightly hyperintense signal on FLAIR. Moderate enhancement is seen on T1 post-contrast (T1C) images. The size is approximately 64*101*87mm. There is peritumoral edema, and the left lateral ventricle is compressed and narrowed. There is no shift of midline structures.",
    "BraTS-MEN-01246-002": "A small patchy area of abnormal signal is visible beneath the skull cap on the right side, showing isointense on T1W, isointense on T2W, hyperintense on FLAIR, with significant enhancement on T1C. The size of the lesion is approximately 10*12*12 mm. There is no shift in the midline structures.",
    "BraTS-MEN-01246-003": "An abnormal signal nodule is visible beneath the skull plate at the intersection of the right frontal and parietal lobes, with a clear boundary, measuring approximately 12*14*13 mm, showing low signal on T1-weighted images, slightly high signal on T2-weighted images, high signal on FLAIR, and significant enhancement on T1 post-contrast. There is no shift of the midline structures.",
    "BraTS-MEN-01250-000": "A mass-like abnormal signal is observed beneath the right frontal cranial plate, showing isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR sequence, and notable enhancement on T1-weighted images with contrast. The dimensions are approximately 93*128*81 mm, with extensive peritumoral edema. Midline structures are deviated to the left, and the right lateral ventricle is compressed and narrowed.",
    "BraTS-MEN-01252-000": "A mass-like abnormal signal shadow is visible beneath the left parietal bone, presenting with isointense signal on T1-weighted imaging (T1W), slightly hyperintense signal on T2-weighted imaging (T2W), and hyperintense signal on Fluid-Attenuated Inversion Recovery (FLAIR). Surrounding the lesion, edema signal is visible. The lesion shows obvious enhancement post-contrast administration (T1C) with uniform enhancement, measuring approximately 38*38*45 mm. No shift in midline structures.",
    "BraTS-MEN-01257-000": "A mass-like abnormal signal shadow can be seen beneath the right frontal cranial plate, showing isointense signal on T1WI, slightly hyperintense signal on T2WI, hyperintense signal on FLAIR, and marked enhancement on T1C, measuring approximately 72*92*78mm, with peritumoral edema, and compression and narrowing of the bilateral lateral ventricles. There is a leftward shift of midline structures.",
    "BraTS-MEN-01266-000": "A nodular abnormal signal shadow can be seen below the posterior parietal calvaria, presenting as iso-intense on T1W and T2W sequences, and hyperintense on FLAIR with marked enhancement on T1C, measuring approximately 19*18*18 mm. There is no midline shift.",
    "BraTS-MEN-01272-000": "A mass-like abnormal signal is observed under the left frontal bone plate, presenting with isointense signal on T1W, hypointense signal on T2W and FLAIR. There is a marked enhancement following T1 with contrast, although the enhancement is slightly uneven. Dot-like non-enhancing areas are visible within the lesion, measuring approximately 16x23x22 mm. No midline shift is noted.",
    "BraTS-MEN-01279-010": "On the right temporal lobe, there is a mass-like abnormal signal shadow, which shows isointense on T1-weighted imaging (T1W), slightly hyperintense on T2-weighted imaging (T2W), hyperintese on FLAIR imaging, and demonstrates marked enhancement after contrast (T1C). The size of the lesion is approximately 39*40*33 mm, with perilesional edema. There is no midline shift.",
    "BraTS-MEN-01280-000": "In the anterior interhemispheric fissure, a mass-like abnormal signal shadow is visible, presenting as isointense on T1-weighted images, slightly hypointense on T2-weighted images, and slightly hyperintense on FLAIR sequences. After contrast administration (T1C), there is mild enhancement. The dimensions of the lesion are approximately 27*26*17mm. There is no midline shift, and the frontal lobe parenchyma is compressed.",
    "BraTS-MEN-01281-000": "A mass-like abnormal signal is observed beneath the calvarial plate of the left frontal lobe, which appears isointense on T1-weighted imaging, slightly hyperintense on T2-weighted and FLAIR sequences. Peritumoral edema is visible. After enhancement, the lesion exhibits significant enhancement with dimensions approximately 28*41*31 mm. There is no shift in midline structures.",
    "BraTS-MEN-01285-000": "An abnormal signal nodule can be seen under the skull plate of the left temporal pole, presenting as low signal on T1-weighted images, slightly high signal on T2-weighted and FLAIR sequences, and the lesion shows significant and uniform enhancement post T1 contrast, with clear boundaries, measuring approximately 23*20*12 mm. No midline shift is observed.",
    "BraTS-MEN-01306-000": "On the left side of the falx cerebri, there is a small area of abnormal signal which measures approximately 13*23*14mm. This area shows isointense signal on T1-weighted imaging (T1W), slightly hypointense signal on T2-weighted imaging (T2W), slightly hyperintense signal on FLAIR sequence, and marked enhancement following contrast administration (T1C). There is no midline shift observed.",
    "BraTS-MEN-01308-000": "A small patchy abnormal signal is visible in the anterior longitudinal fissure of the brain, presenting as an isointense signal on T1-weighted images, slightly high signal on T2-weighted images, high signal on FLAIR, and shows obvious enhancement on T1-weighted contrast-enhanced images. The size is approximately 9*13*9 mm. There is no midline shift.",
    "BraTS-MEN-01309-000": "A nodular abnormal signal shadow is seen in the anterior interhemispheric fissure, which appears isointense on T1-weighted imaging (T1W), isointense on T2-weighted imaging (T2W), hyperintense on Fluid-attenuated inversion recovery (FLAIR), and shows significant enhancement post T1 contrast (T1C). The size is approximately 26x30x17 mm. No midline shift is observed.",
    "BraTS-MEN-01310-000": "A mass-like abnormal signal is seen underneath the skull plate of the right temporal region, presenting with an isointense signal on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR images, and significant enhancement on T1-weighted images post-contrast administration. The lesion measures approximately 38*40*36 mm and is surrounded by edema. There is no midline shift observed.",
    "BraTS-MEN-01321-000": "A small patchy area of abnormal signal intensity is visible under the cranial plate of the left frontal lobe, displaying an isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense on FLAIR, and significant enhancement on T1 post-contrast, measuring approximately 9*8*9 mm. No midline shift is observed.",
    "BraTS-MEN-01327-000": "A mass-like abnormal signal is observed beneath the cranial plate of the right frontal lobe. The lesion has a wide base, flat shape, shows slightly low signal on T1W, and slightly high signal on T2W and FLAIR. Surrounding the lesion, there is a large area of edema signal. The right lateral ventricle is slightly compressed. After administration of T1 contrast (T1C), the lesion shows significant and uniform enhancement. The nearby meninges are thickened and also enhance post-contrast. The approximate size of the lesion is 60*77*68mm. There is no midline shift.",
    "BraTS-MEN-01329-000": "A mass-like abnormal signal is seen under the temporal bone plate on the right side, presenting isointense on T1W sequences, slightly hyperintense on T2W and FLAIR sequences. There is marked enhancement post-Gadolinium on T1C sequences, with dimensions approximately 31*33*31 mm. There is slight perilesional edema. No midline shift is observed.",
    "BraTS-MEN-01331-000": "A mass-like abnormal signal shadow can be observed beneath the right temporal bone plate, presenting with isointense signal on T1-weighted images, isointense signal on T2-weighted images, hyperintense signal on FLAIR, and marked enhancement on post-contrast T1 images, with approximate dimensions of 19*20*26 mm. There is no midline shift.",
    "BraTS-MEN-01335-000": "Within the posterior horn of the left lateral ventricle, there is a mass-like lesion with abnormal signal intensity measuring approximately 34*31*38 mm. The lesion presents with isointense signal on T1-weighted images, isointense signal on T2-weighted images, and hyperintense signal on FLAIR images. There is evident enhancement after administration of contrast (T1C). There is mild surrounding cerebral edema. No midline shift is observed.",
    "BraTS-MEN-01350-000": "There is a mass-like abnormal signal adjacent to the falx cerebri on the left frontal parietal region. The shape is irregular, demonstrating isointense signal on T1-weighted images and slightly hyperintense signal on T2-weighted images. There is hyperintense signal on FLAIR imaging, with surrounding edema. Post-contrast T1-weighted images show significant and heterogeneous enhancement of the lesion, measuring approximately 46*67*55 mm. There is a slight rightward shift of midline structures.",
    "BraTS-MEN-01362-000": "There is a small cluster-like abnormal signal shadow at the right skull base, which shows iso-signal on T1-weighted images (T1W), iso-signal on T2-weighted images (T2W), hyperintense signal on FLAIR sequence and significant enhancement post T1 with contrast, measuring approximately 14*15*20mm, with mild compression on the right cerebellar hemisphere. No midline shift is observed.",
    "BraTS-MEN-01365-000": "A small group-like lesion with abnormal signal is visible beneath the right frontal cranial plate, exhibiting an isointense signal on T1W, isointense signal on T2W, slightly hyperintense signal on FLAIR, and significant enhancement on T1C, measuring approximately 15*14*16mm. There is no shift of midline structures.",
    "BraTS-MEN-01368-000": "Multiple clustered abnormal signal shadows are observed under the skull plates of the bilateral frontal, parietal, temporal, and occipital regions, adjacent to the falx cerebri, on the left side of the pontine-cerebellar region, and near the cerebellar tentorium. The larger lesion is located in the right temporal region with dimensions of approximately 56*63*37mm. The lesion displays isointensity on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, with some areas within the lesion showing hypointense signal on T2-weighted imaging. After contrast enhancement (T1C), the lesion shows obvious, uniform enhancement. A small patchy abnormal signal shadow, which is hyperintense on T1-weighted and mixed signal on T2-weighted imaging, is observed adjacent to the falx cerebri in the left parietal region. This area also shows enhancement post-contrast. The right lateral ventricle is compressed. There is no displacement of midline structures.",
    "BraTS-MEN-01384-000": "Under the left frontal bone, a mass-like abnormal signal is evident, presenting as isointense on T1-weighted imaging, hypointense on T2-weighted imaging, slightly hyperintense on FLAIR, and showing significant enhancement after administering contrast (T1C), measuring approximately 41*93*77 mm, with surrounding edema; At the base of the left skull, a mass-like abnormal signal is visible, presenting as slightly hypointense on T1-weighted imaging, hypointense on T2-weighted imaging, slightly hyperintense on FLAIR, and showing uneven mild enhancement after contrast (T1C), meauring approximately 41*93*77 mm. No midline shift is observed, and there is compression of the left cerebellar hemisphere.",
    "BraTS-MEN-01385-000": "In the anterior cranial fossa, at the location of the cerebral falx, a mass-like abnormal signal can be observed, which grows across the midline. It presents as iso- to low signal on T1-weighted sequences, mixed high signal on T2-weighted sequences, with central low and peripheral high signal on FLAIR, and significant but uneven enhancement after contrast administration, predominantly at the periphery. Surrounding the lesion, a large area of edema is visible, measuring approximately 113*126*83 mm. There is no shift in the midline structures.",
    "BraTS-MEN-01399-000": "A mass-like abnormal signal shadow is visible beneath the skull plate of the right frontal parietal region, presenting as isointense on T1-weighted images, isointense on T2-weighted images, hyperintense on FLAIR, with significant enhancement on T1 post-contrast, and measures approximately 40*54*57 mm with perilesional edema. No midline shift is observed.",
    "BraTS-MEN-01404-000": "A mass-like abnormal signal focus is observed adjacent to the falx cerebri on the left frontal-parietal region. It exhibits low signal intensity on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, and hyperintense signal on FLAIR sequence, with clear demarcation. Post-enhancement imaging shows mild and uneven enhancement, measuring approximately 46 x 61 x 42 mm. There is a slight shift of midline structures to the right.",
    "BraTS-MEN-01409-000": "Under the calvarium in the right frontoparietal region, adjacent to the anterior interhemispheric fissure, and at the junction of the left temporal and occipital lobes, a mass-like abnormal signal is observed. It shows an isointense signal on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, slightly hyperintense on FLAIR imaging, and mild enhancement on T1-weighted imaging with contrast. The approximate dimensions of the lesion are 47*59*57 mm with mild surrounding edema. The midline structures are slightly shifted to the left.",
    "BraTS-MEN-01411-000": "A mass-like abnormal signal is observed beneath the skull plate in the right temporal area, exhibiting an isointense signal on T1-weighted images, isointense on T2-weighted images, slightly hyperintense on FLAIR images, and shows significant enhancement post-contrast (T1C). It measures approximately 70*131*97 mm, with surrounding edema and compression of the right lateral ventricle leading to narrowing. Midline structures are shifted to the left.",
    "BraTS-MEN-01414-000": "On the left side of the skull base, two mass-like abnormal signal shadows can be observed. They appear isointense on T1-weighted images, slightly hyperintense on T2-weighted images, slightly hyperintense on FLAIR images, and exhibit significant enhancement with T1 contrast, measuring approximately 19*16*22mm. No midline shift is present.",
    "BraTS-MEN-01416-000": "A mass-like abnormal signal is visible in the cerebral longitudinal fissure, displaying isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, slightly hyperintense signal on FLAIR imaging, and obvious enhancement post-contrast (T1C), with dimensions approximately 17*23*19 mm. Tail sign of the meninges is visible. No midline shift is observed.",
    "BraTS-MEN-01421-000": "A nodular abnormal signal is observed in the posterior longitudinal fissure, which presents with iso-signal on T1W, iso-signal on T2W, high signal on FLAIR, and marked enhancement on T1C, measuring approximately 14*21*18 mm. There is no midline shift noted.",
    "BraTS-MEN-01422-000": "A mass-like abnormal signal shadow can be observed beneath the cranial plate in the right cerebellopontine area, showing iso-signal on T1WI and T2WI, hyperintense signal on FLAIR, with clear boundaries, and marked enhancement on T1C, the dimensions being approximately 17 x 13 x 15 mm. There is no shift in the midline structures.",
    "BraTS-MEN-01430-000": "A small cluster-like abnormal signal is seen in the anterior interhemispheric fissure, showing isointense on T1-weighted imaging (T1W), isointense on T2-weighted imaging (T2W), slightly hyperintense on Fluid-Attenuated Inversion Recovery (FLAIR), with marked enhancement on T1 post-contrast (T1C). The size is approximately 10*15*10 mm. No midline shift is observed.",
    "BraTS-MEN-01432-000": "A mass-like abnormal signal is observed at the left skull base exhibiting isointense on T1-weighted images (T1W), isointense on T2-weighted images (T2W), slightly hyperintense on FLAIR images, and significant enhancement post-contrast T1W images (T1C). The mass measures approximately 29x29x26mm, with adjacent brain parenchyma compression. There is no midline shift observed.",
    "BraTS-MEN-01433-000": "A mass-like abnormal signal is visible in the left temporal pole, exhibiting an isointense signal on T1-weighted sequences, and hyperintense signal on T2-weighted and FLAIR sequences. Post-enhancement, nodular and patchy enhancement is seen within the lesion, and there is obvious thickening of adjacent meninges, measuring approximately 40*40*30mm. There is no midline shift.",
    "BraTS-MEN-01435-001": "A small nodular lesion is visible at the left temporal pole, exhibiting isointense signals on T1W and T2W sequences, hyperintense on FLAIR, and showing significant enhancement on T1C, approximately 15*14*18 mm in size. Midline structures are not displaced."
}