{
    "BraTS-GLI-00006-000": "A lesion with approximately round abnormal signal is seen in the left frontal lobe, showing high signal on T1W, T2W, FLAIR sequences, with marked ring-like enhancement on T1C, having unclear borders, measuring about 76*72*69mm. Extensive edema is present in the surrounding brain parenchyma, with compression of the anterior horns of the bilateral lateral ventricles and deviation of midline structures to the right.",
    "BraTS-GLI-00012-000": "Irregular abnormal signal foci are seen in both frontal lobes, crossing the midline, presenting with iso to low signal on T1W with some high signal, mixed high and low signal on T2W and FLAIR, with uneven enhancement on T1C, and indistinct boundaries. The size of the lesion is approximately 84*113*82mm. Surrounding brain parenchymal edema is present, with compression of the left lateral ventricle and rightward deviation of midline structures.",
    "BraTS-GLI-00014-001": "In the left temporal lobe, insular region, and basal ganglia area, there is a mass-like abnormal signal shadow, presenting with slightly low signal on T1-weighted images, isointense signal on T2-weighted images, and slightly high signal on FLAIR. There is uneven mild enhancement following T1 contrast, with clear boundaries. The size of the lesion is approximately 51*70*41 mm, with peritumoral edema. There is no shift of midline structures.",
    "BraTS-GLI-00017-000": "An irregular abnormal signal focus is visible in the left temporal lobe, with isointense signal on T1W, hyperintense signal on T2W and FLAIR sequences, and significant ring-like enhancement on T1C. The lesion has indistinct borders and measures approximately 55*80*73mm. There is extensive edema in the surrounding brain parenchyma, and no midline shift is observed.",
    "BraTS-GLI-00021-000": "In the right frontal lobe and basal ganglia region, there are irregular abnormal signal foci, which manifest as low signal on T1-weighted images with partial high signal, mixed high and low signal on T2-weighted and FLAIR images, and significant ring-like enhancement on T1 post-contrast images. The borders are poorly defined, with dimensions approximately 94*75*65 mm. There is extensive edema in the surrounding brain parenchyma, compression on the anterior horn of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-00024-000": "An abnormal signal focus can be seen in the left temporal lobe, showing slightly low signal on T1-weighted images, high signal on T2-weighted images, and high signal on FLAIR images, with some mixed signals inside, ring-enhancement on post-contrast T1 images, and unclear boundaries. The size is approximately 53*81*65 mm. There is surrounding brain tissue edema; no midline shift is present.",
    "BraTS-GLI-00032-001": "At the junction of the left frontal and parietal lobes, an irregular abnormal signal focus is observed, presenting with low signal intensity on T1W with a small amount of high signal, mixed high and low signal intensity on T2W and FLAIR, and marked ring-like enhancement on T1C. The boundaries are indistinct, and the size is approximately 56*88*76 mm. There is extensive edema in the surrounding brain parenchyma, and the midline structures are slightly shifted to the right.",
    "BraTS-GLI-00045-001": "An irregular abnormal signal focus is seen in the left temporal lobe, exhibiting a slightly low signal on T1-weighted imaging, a high signal on T2-weighted imaging, and a mixed high and low signal on FLAIR. It shows mild and uneven enhancement on T1 post-contrast, with ill-defined boundaries, measuring approximately 36*47*51 mm. There is surrounding cerebral white matter edema, and no midline shift is observed.",
    "BraTS-GLI-00046-000": "At the junction of the right frontal and parietal lobes, a lesion with an approximate round shape is visible, exhibiting mixed signal intensity on T2-weighted and FLAIR sequences, a fluid level inside the lesion, and marked ring-like enhancement on post-contrast T1-weighted images. The lesion measures about 50*54*45 mm. There is surrounding brain parenchymal edema, and no midline shift is observed.",
    "BraTS-GLI-00053-000": "Irregular abnormal signal foci are seen in both frontal lobes and the genu of the corpus callosum, presenting with hypointense T1W imaging coupled with some hyperintense signals, mixed high and low signals on T2W and FLAIR imaging, and significant ring-like enhancement on T1C imaging. The borders are indistinct, and the lesion crosses the midline, measuring approximately 76*90*83mm. There is extensive cerebral edema in the surrounding brain parenchyma, mild compression of the left lateral ventricle, and a rightward deviation of midline structures.",
    "BraTS-GLI-00061-000": "Multiple quasi-circular abnormal signal foci are visible in the left temporal lobe and hippocampus, appearing as low signal on T1W imaging, high signal on T2W and FLAIR imaging with a mixed high and low signal, and showing obvious ring-like enhancement on T1C. The boundaries are not clear. The larger lesion is located in the left hippocampus, containing a fluid level, and measures approximately 40*74*43 mm. There is slight edema in the surrounding brain parenchyma, with no shift of midline structures.",
    "BraTS-GLI-00061-001": "Multiple abnormal signal foci are visible in the left temporal lobe and hippocampus, with the larger ones located in the left hippocampus area, measuring approximately 40*76*53mm, exhibiting mixed high and low signals on T1W, T2W, FLAIR sequences with fluid levels. The remaining lesions show low signal on T1W, mixed high and low signals on T2W, FLAIR sequences, with marked ring-like enhancement on contrast-enhanced T1W images, and indistinct boundaries. There is extensive vasogenic edema in the surrounding brain parenchyma, and no midline shift is observed.",
    "BraTS-GLI-00064-000": "There is an irregular abnormal signal focus in the left frontal operculum region, showing hypointense with some hyperintensity on T1-weighted imaging, mixed high and low signal on T2-weighted and FLAIR sequences, with pronounced ring-like enhancement after contrast (T1C), and undefined borders, measuring approximately 66*117*58 mm. Extensive edema is seen in the surrounding brain parenchyma, slight compression on the left lateral ventricle, and a rightward deviation of midline structures.",
    "BraTS-GLI-00072-001": "A mass-like abnormal signal is seen in the left parietal temporal lobe, presenting as slightly hypointense on T1-weighted images, slightly hyperintense on T2-weighted images, and slightly hyperintense on FLAIR images. There is uneven enhancement following contrast (T1C), with a clear boundary. The size of the lesion is approximately 44*53*37mm, with surrounding edema. There is no midline shift. The posterior horn of the left lateral ventricle is mildly compressed and narrowed.",
    "BraTS-GLI-00099-001": "Multiple round-like abnormal signal foci are present in the right parieto-occipital lobe and splenium of the corpus callosum, which exhibit low signal on T1-weighted images, high signal on T2-weighted images, and low signal on FLAIR images. Patchy and ring-like enhancement is seen on T1-weighted imaging with contrast (T1C), with indistinct boundaries. The largest of these is located in the right parietal lobe, measuring approximately 87*67*84mm. There is extensive edema in the surrounding brain parenchyma, compression on the trigone of the right lateral ventricle, and no shift in the midline structures.",
    "BraTS-GLI-00101-000": "An irregular abnormal signal focus is visible in the right parietal lobe, appearing as hypo-isointense on T1-weighted (T1W) sequence, hyperintense on T2-weighted (T2W) and Fluid-Attenuated Inversion Recovery (FLAIR) sequence, with marked ring-like enhancement on T1 post-contrast (T1C). The boundary is ill-defined, measuring approximately 53*49*59mm. There is surrounding brain parenchymal edema, with no shift of midline structures.",
    "BraTS-GLI-00104-000": "An abnormal signal is observed in the left frontal lobe, showing slightly low signal on T1-weighted (T1W) images, slightly high signal on T2-weighted (T2W) images, and slightly high signal on Fluid Attenuated Inversion Recovery (FLAIR) sequences. The lesion presents with uneven enhancement on T1 post-contrast (T1C) imaging, has a clear boundary, and measures approximately 55*76*54 mm. Peritumoral edema is present. There is a rightward shift of midline structures.",
    "BraTS-GLI-00106-000": "An irregular abnormal signal focus is visible in the right frontal lobe, presenting as a low signal on T1W sequence with a small amount of high signal, a high signal on T2W and FLAIR sequences, and a distinct garland-like enhancement on T1C sequence. The boundary is not clear, and the size is approximately 78*117*78 mm. There is extensive edema in the surrounding brain parenchyma, compression on the right lateral ventricle, and leftward deviation of midline structures.",
    "BraTS-GLI-00108-000": "An irregular abnormal signal focus is seen in the left temporal lobe, displaying a low signal on T1W with localized high signal, and a high signal on T2W and FLAIR. On T1C, there is evident uneven enhancement, with an unclear boundary. The dimensions are approximately 61*76*62mm. There is a significant amount of edema in the surrounding brain parenchyma, and the right lateral ventricle is slightly compressed; there is no shift in midline structures.",
    "BraTS-GLI-00110-000": "A mass-like abnormal signal is seen in the left frontal lobe, showing a slightly low signal on T1-weighted images, a slightly high signal on T2-weighted images, and a slightly high signal on FLAIR images. Post-contrast T1 imaging shows uneven marked enhancement. The lesion has clear boundaries and measures approximately 50*81*63 mm in size. There is peritumoral edema; however, there is no shift of midline structures.",
    "BraTS-GLI-00121-000": "An irregular abnormal signal focus is observed in the left occipital lobe, presenting as a mixed signals of iso- and hypointensity on T1-weighted imaging, hyperintensity on T2-weighted imaging, mixed signals of hyper- and hypointensity on FLAIR, and markedly inhomogeneous enhancement on contrast-enhanced T1 (T1C), with an ill-defined boundary, measuring approximately 51*73*86mm. There is a substantial amount of vasogenic edema in the surrounding brain parenchyma, but no midline shift is observed.",
    "BraTS-GLI-00122-000": "An irregular lesion showing abnormal signals is present in the left parieto-occipito-temporal lobe, showing hypointensity with some hyperintensity on T1-weighted images, mixed high and low signal intensity on T2-weighted and FLAIR sequences, and marked heterogeneous enhancement with a 'ring-enhancement' pattern after administration of contrast on T1-weighted images. The lesion has poorly defined boundaries and measures approximately 46*62*52 mm. There is surrounding white matter edema, with no shift of the midline structures.",
    "BraTS-GLI-00134-000": "An irregular abnormal signal focus can be seen on the left frontal operculum, presenting as T1W hypointense to isointense signal, mixed high and low signal on T2W and FLAIR sequences, and significant heterogeneous ring-like enhancement on T1C, with an indistinct boundary and approximate dimensions of 73*82*77 mm. Surrounding brain parenchyma shows edema, lateral ventricle compression, dilatation of the posterior horn of the right lateral ventricle, and a rightward shift of midline structures.",
    "BraTS-GLI-00140-000": "An irregular abnormal signal focus is observed in the left parietal-occipital lobe, presenting as low signal with slight high signal on T1W, high signal on T2W and FLAIR, and significant 'ring-like' enhancement on T1C. The border is indistinct and the size is approximately 34*39*51 mm. Surrounding brain parenchyma exhibits edema, but there is no shift of midline structures.",
    "BraTS-GLI-00150-000": "On the right side, in the basal ganglia region and the insular-temporal lobe, there is an irregular abnormal signal focus seen. It presents as isointense to low signal on T1-weighted imaging (T1W), mixed high and low signal on T2-weighted imaging (T2W) and FLAIR, with significant circumferential enhancement on T1-weighted imaging post-contrast (T1C), and indistinct borders. The size of the lesion is approximately 80*91*77 mm. There is substantial cerebral edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-00155-000": "In the right basal ganglia region, pons, and brainstem, an irregular abnormal signal focus can be observed, presenting low signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR images, speckled and ring-like enhancement on post-contrast T1 images, with ill-defined boundaries, and measuring approximately 49*52*48 mm. Surrounding brain parenchyma shows edema, with no shift of midline structures.",
    "BraTS-GLI-00156-000": "An irregular abnormal signal is observed in the left frontal lobe, presenting as low signal with sporadic high signal on T1W, hyperintense on T2W, mixed high and low signal on FLAIR, and marked garland-like enhancement on T1C. The boundaries are not well-defined, with an approximate size of 68*74*76mm. There is extensive edema in the surrounding brain parenchyma, compression of the lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-00158-000": "On the right frontal-parietal-temporal lobe, an irregular abnormal signal focus is visible, presenting with low signal on T1W with sparse high signal, mixed high and low signal on T2W and FLAIR sequences, with significant ring-like enhancement on T1C. The border is not clear, with dimensions approximately 77*104*71mm. Extensive cerebral edema is observed in the surrounding brain parenchyma, with compression of the right lateral ventricle and deviation of midline structures to the left.",
    "BraTS-GLI-00159-000": "In the left frontal lobe and the knee of the corpus callosum, there is an irregular abnormal signal focus visible. It shows low signal with a slight high signal on T1W sequence, mixed high and low signal on T2W and FLAIR sequences, and significant ring-like enhancement on T1C (post-contrast T1-weighted) sequence. The boundary is not clear, with an approximate size of 58*70*75 mm. There is extensive edema in the surrounding brain parenchyma, compression of the lateral ventricle, and a rightward shift of midline structures.",
    "BraTS-GLI-00170-000": "An abnormal signal focus can be seen in the right frontal lobe, showing a slightly hypointense signal on T1W, hyperintense signal on T2W, hyperintense signal on FLAIR, and multiple patchy enhancements on T1C with ill-defined borders, measuring approximately 36*47*41mm. The surrounding brain parenchyma shows edema, and there is no midline shift.",
    "BraTS-GLI-00184-000": "In the left basal ganglia region, an irregular abnormal signal focus can be observed, exhibiting iso- to low signal on T1-weighted imaging, mixed high and low signal on T2-weighted and FLAIR sequences, and significant ring-like enhancement on T1 post-contrast imaging. The lesion is poorly demarcated and measures approximately 82*68*60 mm. There is extensive surrounding brain edema, compression of the left lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-00186-000": "On the right side, adjacent to the cerebral falx and within the body of the corpus callosum, there is an irregular abnormal signal lesion visible, exhibiting a low signal on T1-weighted images with some high signal, mixed high and low signal on T2-weighted and FLAIR images, and markedly uneven enhancement on T1-weighted images post-contrast. The lesion's boundaries are not well defined, measuring approximately 57*120*69mm. There is extensive edema in the surrounding brain parenchyma, with a slight leftward shift of the midline structures.",
    "BraTS-GLI-00187-000": "There is an irregular signal abnormality seen in the left frontal lobe, basal ganglia region, and the genu of the corpus callosum, showing hypointense signal on T1-weighted images, hyperintense signal on T2-weighted images, mixed high and low signal on FLAIR, and marked ring-like enhancement on T1-weighted images post-contrast (T1C). The borders are ill-defined. The size of the lesion approximately measures 76*88*86 mm. There is a significant amount of surrounding cerebral edema, compression on the anterior horn of the left lateral ventricle, and a rightward shift of midline structures.",
    "BraTS-GLI-00188-000": "At the junction of the left frontal and parietal lobes, an irregular abnormal signal focus can be observed, which shows a mixed signal of isointense and hypointense on T1-weighted imaging, a mixed signal of hyperintense and hypointense on T2-weighted and FLAIR imaging, and significant garland-like enhancement on contrast-enhanced T1 imaging with an unclear boundary, measuring approximately 44*60*67 mm. There is mild edema in the surrounding brain parenchyma, and no midline shift is observed.",
    "BraTS-GLI-00191-000": "An irregular abnormal signal focus is visible in the left temporal lobe, which appears as low signal on T1W with a small amount of high signal, mixed high and low signal on T2W and FLAIR sequences, and shows obvious flower-ring-like enhancement on T1C with an unclear boundary. The size is approximately 65*115*80mm. There is a significant amount of cerebral edema in the surrounding brain parenchyma, compression on the left lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-00193-000": "Irregular abnormal signal foci can be observed in the thalamus, pons, and brainstem, exhibiting isointense to low signal on T1-weighted images, mixed high and low signals on T2-weighted and FLAIR images, with marked 'garland-like' enhancement on post-contrast T1 images. The lesions are approximately 44*72*75mm in size. There is slight edema in the surrounding brain parenchyma, and no midline shift is observed.",
    "BraTS-GLI-00196-000": "Irregular abnormal signal foci are observed in the right frontal lobe and bilateral body of the corpus callosum, presenting with mostly low signal intensity on T1W images with a few high signals, mixed high and low signal intensity on T2W and FLAIR images, and marked ring-like enhancement on T1C images. The lesions have unclear boundaries and measure approximately 72*79*69mm. Extensive edema is noted in the surrounding brain parenchyma, with dilatation of the right lateral ventricle, and shift of midline structures to the left.",
    "BraTS-GLI-00199-000": "In the left frontal parietal lobe and adjacent to the lateral ventricle, there is an irregular abnormal signal lesion, which is isointense to hypointense on T1W, hyperintense on T2W and FLAIR with mixed signals, and shows a significant garland-like enhancement on T1C. The lesion has an unclear boundary and measures approximately 53*85*59 mm. There is extensive edema in the surrounding brain parenchyma, enlargement of the left lateral ventricle, compression of the right lateral ventricle, and a rightward deviation of midline structures.",
    "BraTS-GLI-00206-000": "At the junction of the right frontal and parietal lobes, there is an irregular abnormal signal focus. It presents with mixed iso- and hypointense signals on T1-weighted imaging, and mixed hyper- and hypointense signals on T2-weighted and FLAIR imaging. After contrast (T1C), there is significant ring-like enhancement. The borders are indistinct, and the size is approximately 38*48*43 mm. There is associated cerebral edema in the surrounding brain parenchyma, but no midline shift is observed.",
    "BraTS-GLI-00218-000": "An abnormal signal focus can be seen in the left frontal lobe, presenting as low signal on T1W, high signal on T2W, high signal on FLAIR, and enhancement on T1C. The boundary is not clear, size approximately 32*43*35mm. There is slight swelling of the surrounding soft tissue, with no midline shift.",
    "BraTS-GLI-00228-000": "At the junction of the left frontal and parietal lobes, there is an irregular abnormal signal focus. It presents as low signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR images, with marked 'ring-like' enhancement on T1-weighted images post-contrast (T1C). The lesion's boundaries are indistinct, measuring approximately 51*57*50 mm. There is extensive edema in the surrounding brain parenchyma, with no midline shift.",
    "BraTS-GLI-00237-000": "An irregular abnormal signal focus can be seen in the left temporal-occipital lobe, presenting as iso to low signal on T1W, mixed high and low signal on T2W and FLAIR, with marked 'ring-like' enhancement on T1C, and indistinct boundaries. The size is approximately 45*64*54mm. There is surrounding brain parenchymal edema, compression of the posterior horn of the left lateral ventricle, with no shift in midline structures.",
    "BraTS-GLI-00242-000": "On the left parietal lobe and adjacent to the posterior horn of the lateral ventricle, there is a mass-like abnormal signal shadow, presenting as a low signal on T1-weighted imaging, a high signal on T2-weighted imaging, and a mixed low and high signal on FLAIR. There is marginal enhancement after contrast (T1C), with a clear border, measuring approximately 100*125*83 mm, and peritumoral edema is present. No midline shift is observed, and the left lateral ventricle is slightly compressed and narrowed.",
    "BraTS-GLI-00247-000": "In the left frontal-temporal-insular region and basal ganglia, an irregular abnormal signal focus is observed, presenting as low signal on T1-weighted images with slight high signal, mixed high and low signals on T2-weighted and FLAIR sequences, and a distinct ring-like enhancement on T1 post-contrast images. The boundary of the lesion is indistinct, with dimensions approximately 53*104*86 mm. There is extensive perilesional brain edema, compression of the left lateral ventricle, and a rightward shift of midline structures.",
    "BraTS-GLI-00283-000": "On the right parietal lobe, bilateral frontal lobes, the body of the corpus callosum, and the septum pellucidum, there are multiple irregular abnormal signal foci. These areas show low signal on T1-weighted imaging, mixed high and low signal on T2-weighted and FLAIR imaging, and patchy, ring-like enhancement on post-contrast T1-weighted imaging with unclear boundaries. The size of the largest lesions is approximately 104*56*68 mm. There is extensive edema in the surrounding brain parenchyma, but no midline shift is observed.",
    "BraTS-GLI-00285-000": "There are abnormal signal foci in the right occipital lobe, which appear as low signal on T1W, high signal on T2W, and high signal on FLAIR. There is uneven enhancement after contrast administration on T1C. The lesion has poorly defined borders, with dimensions approximately 25*29*31mm. There is no midline shift.",
    "BraTS-GLI-00291-000": "Two abnormal signal foci are observed on the right parietal lobe, exhibiting iso to low signal on T1W sequence, high signal on T2W sequence, and mixed high and low signal on FLAIR. The lesions show uneven enhancement on T1C, with indistinct boundaries, and are approximately in 63*54*59 millimeters size. Surrounding brain parenchyma shows edema without midline shift.",
    "BraTS-GLI-00293-000": "An irregular abnormal signal focus is seen in the left frontal lobe, exhibiting low signal on T1-weighted images with a small amount of high signal, mixed high and low signal on T2-weighted and FLAIR images, patchy and ring enhancements on T1 post-contrast, with ill-defined boundaries, measuring approximately 40*63*50mm. There is edema in the surrounding brain parenchyma, with no shift of midline structures.",
    "BraTS-GLI-00298-000": "An irregular abnormal signal focus is seen in the right temporal-occipital lobe, showing hypointense signal with occasional hyperintensity on T1WI, mixed high and low signal on T2WI and FLAIR, and marked 'flower ring' enhancement on T1C. The boundary is not clear, measuring approximately 43*54*52mm. There is surrounding brain parenchymal edema, compression of the posterior horn of the right lateral ventricle, with no shift of midline structures.",
    "BraTS-GLI-00310-000": "Irregular abnormal signal foci can be seen in the right parietal, occipital, temporal lobes, and the splenium of the corpus callosum, presenting with isointense or hypointense signal on T1-weighted images, hyperintense and mixed intensity signals on T2-weighted and FLAIR sequences, with pronounced ring-like enhancement after contrast (T1C). The lesion crosses the midline along the splenium of the corpus callosum with unclear boundaries, measuring approximately 62*74*81 mm. There is extensive edema in the surrounding brain parenchyma, with compression of the posterior horn of the right lateral ventricle, and no midline shift.",
    "BraTS-GLI-00314-000": "In the right frontal-parietal lobe and adjacent to the lateral ventricle, there is an observed mass with abnormal signal intensity. Specifically, it displays slightly low signal on T1-weighted images, iso- to high signal on T2-weighted images, and high signal on FLAIR images. After contrast (T1C), the mass shows uneven edge enhancement with clear boundaries. The size of the mass is approximately 42*58*41 mm. There is minimal peritumoral edema, and there is no shift of midline structures.",
    "BraTS-GLI-00316-000": "In the right frontal lobe and the body of the corpus callosum, there is an irregular abnormal signal lesion with a T1W hypointense signal mixed with slight hyperintense signals, T2W/FLAIR mixed high and low signals, and a T1C marked heterogeneous enhancement resembling a garland. The boundaries are unclear, measuring approximately 51*51*45 mm. There is associated cerebral edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-00320-000": "In the posterior horn of the right lateral ventricle, a mass-like abnormal signal is seen, presenting with slightly low signal on T1-weighted images, slightly high signal on T2-weighted images, and slightly high signal on FLAIR. There is uneven enhancement post-contrast on T1-weighted images (T1C), with clear boundaries. The size is approximately 48*103*55 mm, with peritumoral edema. There is no midline shift.",
    "BraTS-GLI-00322-000": "Irregular abnormal signal foci can be seen in the right frontal lobe, showing low signal on T1W with sparse high signal, mixed high and low signals on T2W and FLAIR, and significant garland-like enhancement on T1C, with unclear boundaries, measuring approximately 58*74*65mm; A quasi-circular abnormal signal focus can be seen adjacent to the falx cerebri in the left frontal lobe, showing low signal on T1W, high signal on T2W and FLAIR, significant garland-like enhancement on T1C, with unclear boundaries, measuring approximately 58*74*65mm. Surrounding brain parenchymal edema is noted around the bilateral frontal lobe lesions, with mild compression on the right lateral ventricle, and no shift in midline structures.",
    "BraTS-GLI-00327-000": "An irregular abnormal signal focus is visible within the left hippocampal region, presenting as iso-low signal on T1W, mixed high signal on T2W and FLAIR, with marked uneven enhancement on T1C. The boundary is not clear, with an approximate size of 62*105*67 mm. There is extensive edema in the surrounding brain parenchyma, compression of the brainstem, and a mild rightward shift of the midline structures.",
    "BraTS-GLI-00336-000": "An irregular abnormal signal focus is observed in the left frontal lobe, presenting as iso to low signal on T1-weighted images, high signal on T2-weighted images, mixed high and low signal on FLAIR, and marked rim enhancement on T1-weighted images with contrast. The lesion has indistinct boundaries and measures approximately 71*94*75mm. There is extensive surrounding brain parenchymal edema, compression of the lateral ventricle, and a rightward shift of midline structures.",
    "BraTS-GLI-00341-000": "An irregular abnormal signal focus is seen in the left parietal lobe, with low signal on T1W, high signal on T2W/FLAIR sequences, and significant ring-like enhancement on T1C. The boundary is poorly defined, and the size measures approximately 37*46*46 mm. There is a large amount of edema in the surrounding brain parenchyma, with compression of the posterior horn of the left lateral ventricle. No midline shift is observed.",
    "BraTS-GLI-00347-000": "An irregular abnormal signal focus is observed in the right basal ganglia region and the insular lobe, presenting as iso- to low signal on T1W, high mixed signal on T2W and FLAIR sequences, and significant ring-like enhancement on T1C. The boundaries are poorly defined, with approximate dimensions of 58*89*72mm. There is extensive perilesional brain parenchymal edema, compression of the right lateral ventricle, and a slight leftward shift of midline structures.",
    "BraTS-GLI-00349-000": "In the right temporal lobe, there is an irregular abnormal signal focus, showing hypointense with some hyperintense areas on T1-weighted imaging (T1W), hyperintense on T2-weighted imaging (T2W), mixed high and low signals on FLAIR, and marked ring-like enhancement on contrast-enhanced T1-weighted imaging (T1C). The lesion measures approximately 56*86*60 mm, with ill-defined borders. There is extensive surrounding brain parenchymal edema, compression of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-00351-000": "In the right temporal lobe, there is a mass-like abnormal signal shadow, showing slightly low signal on T1-weighted images (T1W), high signal on T2-weighted images (T2W), and mixed signal on FLAIR sequences. After contrast administration (T1C), it displays heterogeneous enhancement. The boundary is well-defined, with dimensions approximately 63*97*73 mm. There is peritumoral edema. Midline structures are shifted to the left, and the right lateral ventricle is compressed and narrowed.",
    "BraTS-GLI-00360-000": "In the left parieto-occipital lobe and the splenium of the corpus callosum, irregular abnormal signal foci can be seen, presenting with low signal on T1-weighted images with some high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and significant uneven enhancement on T1 with contrast. The boundaries are indistinct. The lesion crosses the midline along the splenium of the corpus callosum, measuring approximately 56*77*71mm. There is substantial edema in the surrounding brain parenchyma, compression of the posterior horn of the left lateral ventricle, with no midline shift.",
    "BraTS-GLI-00376-000": "A mass-like abnormal signal is visible in the left parietal lobe, presenting as a slightly hypointense signal on T1-weighted images, slightly hyperintense on T2-weighted images, and hypointense on FLAIR sequences. Post-contrast T1-weighted images show peripheral enhancement of the mass, which has clear boundaries and measures approximately 53*55*51mm. There is surrounding edema, but no midline shift detected.",
    "BraTS-GLI-00390-000": "An abnormal signal focus is observed in the left temporal lobe, presenting with low signal on T1-weighted images with a little high signal, high signal on T2-weighted images, and high signal on FLAIR. There is ring enhancement on T1 post-contrast images with unclear boundaries, measuring approximately 34*48*39 mm. Surrounding brain parenchyma shows edema. There is no midline shift.",
    "BraTS-GLI-00395-000": "Irregular abnormal signal foci are visible in the left parieto-occipital lobe, splenium of corpus callosum, and hippocampus, presenting with low signal on T1-weighted imaging and a small amount of high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and marked ring-like enhancement on T1 post-contrast imaging, with indistinct borders, measuring approximately 95*95*70mm. Extensive cerebral edema is evident in the surrounding brain parenchyma, with compression of the posterior horn of the left lateral ventricle, and no shift of midline structures.",
    "BraTS-GLI-00397-000": "Irregular abnormal signal foci are seen in the right frontal-parietal-temporal-occipital lobes and bilateral periventricular areas, showing mixed high and low signals on T1W, T2W, FLAIR sequences, with obvious ring-like enhancement on T1C, unclear boundaries, and lesion crossing the midline, measuring approximately 81*96*82mm. There is a large amount of edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-00400-000": "An irregular abnormal signal focus is observed in the right basal ganglia and insular temporal lobe, displaying isointense to hypointense signal on T1-weighted sequences, hyperintense mixed signal on T2-weighted and FLAIR sequences, with marked 'ring-like' enhancement post-contrast on T1C images. The borders are ill-defined, with dimensions approximately 82*93*86mm. There is extensive cerebral edema in the adjacent brain parenchyma, compression of the right lateral ventricle and leftward shift of midline structures.",
    "BraTS-GLI-00401-000": "A mass-like abnormal signal shadow can be seen in the left frontal lobe, showing a slightly low signal on T1W, high signal on T2W, and slightly high signal on FLAIR. There is non-uniform enhancement of the edges on T1C, with clear boundaries, measuring approximately 80*97*61 mm. Significant peritumoral edema is present. Midline structures are shifted to the right, with compression and narrowing of the anterior horns of both lateral ventricles.",
    "BraTS-GLI-00416-000": "Irregular abnormal signal foci are seen in the right basal ganglia region and the frontotemporal insular lobe, showing low signal on T1W with a slight high signal, mixed high and low signal on T2W and FLAIR, and significant ring-like enhancement on T1C. The margins are not clear, and the approximate size is 71*130*91 mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and left deviation of the midline structures.",
    "BraTS-GLI-00430-000": "An irregular abnormal signal focus can be seen in the right temporal lobe, presenting as isointense to low signal on T1W, mixed high and low signal on T2W and FLAIR, with obvious ring-like enhancement on T1C, unclear boundaries, approximately 59*102*72mm in size. There is a significant amount of edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a mild shift to the left of midline structures.",
    "BraTS-GLI-00443-000": "An irregular abnormal signal focus can be seen in the right parietal lobe, showing iso- to hypointense signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR sequences, with a significant ring-like enhancement on T1 post-contrast, and unclear boundaries, measuring approximately 55*77*80 mm. There is extensive edema in the surrounding brain parenchyma, compression on the posterior horn of the right lateral ventricle, and mild leftward deviation of midline structures.",
    "BraTS-GLI-00444-000": "A mass-like abnormal signal is visible adjacent to the left lateral ventricle, demonstrating slightly low signal on T1W images, slightly high signal on T2W and FLAIR images, with uneven enhancement post-contrast on T1C. The lesion has clear boundaries and measures approximately 40*37*48 mm, with mild surrounding edema. The midline structures are displaced to the right, and the posterior horn of the left lateral ventricle is compressed and narrowed.",
    "BraTS-GLI-00445-000": "A mass-like abnormal signal shadow can be seen in the left parietal-temporal lobe, presenting with a slightly low signal on T1-weighted images, slightly high signal on T2-weighted images, and slightly high signal on FLAIR. After contrast (T1C), there is uneven enhancement. The mass has a clear boundary and measures approximately 90*118*86mm. There is peritumoral edema. The midline structures are shifted to the right, and the posterior horn of the left lateral ventricle is compressed and narrowed.",
    "BraTS-GLI-00453-000": "A mass-like abnormal signal is observed in the left parietal lobe, exhibiting slightly low signal on T1-weighted imaging, slightly high signal on T2-weighted imaging, and slightly high signal on FLAIR. There is uneven, mild enhancement post-contrast on T1C, with a clear boundary. The dimensions are approximately 51*64*69 mm. There is peritumoral edema. The midline structures are slightly deviated to the right, and the posterior horn of the left lateral ventricle is compressed and narrowed.",
    "BraTS-GLI-00456-000": "An irregular abnormal signal focus can be seen in the right frontal lobe, presenting with low signal on T1W images, high signal on T2W and FLAIR sequences, and significant ring-like enhancement on post-contrast T1 images. The boundaries are poorly defined, with dimensions of approximately 89*95*83mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a leftward deviation of midline structures.",
    "BraTS-GLI-00469-000": "An irregular abnormal signal focus is seen in the left frontal parietal lobes and basal ganglia region, characterized by a T1W hypointense signal with some hyperintensity, mixed signal intensity on T2W and FLAIR sequences, and a conspicuous ring-like enhancement with contrast(T1C). The boundaries are not well-defined. Its size measures approximately 65*77*53mm. Extensive edema is present in the surrounding brain parenchyma, compression on the left lateral ventricle is evident, and there is a rightward shift of the midline structures.",
    "BraTS-GLI-00477-001": "Multiple irregular abnormal signal foci can be seen in the left frontal-opercular region and the genu of the corpus callosum, presenting as isointense to low signal on T1-weighted images and high signal on T2-weighted images, with mixed high and low signal on FLAIR sequences. Post-contrast T1-weighted images show marked ring-like enhancement. The larger lesions are located adjacent to the falx cerebri in the left frontal lobe, with some lesions crossing the midline and indistinct boundaries. The size of the largest lesion is approximately 89*112*97mm. There is significant edema in the surrounding brain parenchyma, compression of the frontal horns of the lateral ventricles bilaterally, and a rightward shift of midline structures.",
    "BraTS-GLI-00478-000": "An irregular abnormal signal focus is visible in the right frontal-parietal lobe, presenting as mixed high and low signals on T1W, T2W, and FLAIR sequences. There is notable ring-like enhancement on T1C with ill-defined borders, measuring approximately 55*70*62 mm. There is extensive edema in the surrounding brain parenchyma, slight compression on the right lateral ventricle, and no shift of the midline structures.",
    "BraTS-GLI-00480-001": "An irregular abnormal signal focus is observed in the left parietal-occipital lobe, presenting with low signal on T1-weighted imaging and slight high signal, mixed high and low signal on T2-weighted and FLAIR imaging, and significant ring-like enhancement after contrast (T1C). The margin is ill-defined, with dimensions approximately 55*83*89 mm. There is extensive edema in the surrounding brain parenchyma, compression of the posterior horn of the left lateral ventricle and slight rightward shift of the midline structures.",
    "BraTS-GLI-00488-000": "An irregular abnormal signal focus is visible in the right parieto-occipital lobe, presenting as low signal on T1-weighted images with partial high signal, mixed high and low signal on T2-weighted and FLAIR images, and evident 'ring enhancement' on T1 post-contrast images. The boundary is not well-defined, and the size is approximately 45*66*61 mm. There is surrounding brain parenchymal edema, compression of the posterior horn of the right lateral ventricle, with no shift in midline structures.",
    "BraTS-GLI-00491-000": "An irregular abnormal signal focus is observed in the right parietal lobe, presenting with isointense signal with a slight hyperintensity on T1-weighted images, mixed hyperintense and hypointense signals on T2-weighted and FLAIR images, and marked ring-like enhancement on T1 contrast images. The borders are indistinct, measuring approximately 58*66*66 mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a mild leftward shift of midline structures.",
    "BraTS-GLI-00491-001": "On the right parieto-occipital lobe, an irregular abnormal signal focus can be seen, presenting as low signal with sporadic high signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR sequences, and prominent ring-like enhancement on contrast-enhanced T1 images. The margins are ill-defined, with dimensions of approximately 53*65*68mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-00496-000": "An abnormal signal focus is seen in the right temporal lobe, presenting as isointense on T1-weighted images, hyperintense on T2-weighted and FLAIR images, with obvious nodular enhancement after gadolinium contrast (T1C), and unclear boundaries. The dimensions are approximately 55*76*43 mm. Extensive brain edema is present in the surrounding brain parenchyma, with no significant shift of midline structures.",
    "BraTS-GLI-00498-000": "An irregular lesion displaying abnormal signal intensity is seen in the left temporal lobe, presenting as iso- to hypointense on T1-weighted images, and as hyperintense mixed signals on T2-weighted and FLAIR sequences, with patchy and ring-like enhancements observed on T1 post-contrast. The boundaries are not well defined, with an approximate size of 60*82*70 mm. Extensive perilesional edema is present in the adjacent brain parenchyma, with resultant compression of the left lateral ventricle and a mild shift to the right of the midline structures.",
    "BraTS-GLI-00511-001": "An irregular abnormal signal focus is visible in the left temporal lobe, presenting as low signal on T1W with a slight high signal component, mixed high and low signals on T2W and FLAIR, and marked ring-like enhancement on T1C. The boundary is poorly defined, with approximate dimensions of 61*92*67 mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and a mild shift to the right in midline structures.",
    "BraTS-GLI-00514-001": "At the junction of the left frontal and parietal lobes, there is an approximately round abnormal signal lesion with mixed hyperintense and hypointense signals on T2W and FLAIR sequences, showing uneven enhancement on T1C, with indistinct borders, measuring about 60*103*93 mm. The surrounding brain parenchyma shows significant edema, with no shift of midline structures.",
    "BraTS-GLI-00520-000": "An irregular abnormal signal focus can be observed in the left temporal parietal lobe, presenting as low signal on T1-weighted images with slight hyperintensity, mixed high and low signal on T2-weighted and FLAIR sequences, and notable ring-like enhancement after contrast (T1C), with indistinct boundaries, measuring approximately 46*58*47mm. Extensive edema is present in the surrounding brain parenchyma, with no midline shift.",
    "BraTS-GLI-00525-001": "Irregular abnormal signal foci are observed in the left frontal temporal insula and basal ganglia area, presenting as isointense to low signal on T1-weighted images, and high signal on T2-weighted and FLAIR images. The left temporal lobe exhibits localized ‘garland-like’ enhancement on T1 post-contrast (T1C) images with ill-defined borders, measuring approximately 53*72*67 mm. There is significant associated cerebral edema within the surrounding brain parenchyma, compression of the left lateral ventricle, and a slight rightward shift of the midline structures.",
    "BraTS-GLI-00540-000": "An abnormal signal focus is seen adjacent to the falx cerebri in the right parietal lobe, exhibiting slightly low signal on T1-weighted images, isointense signal on T2-weighted images, and hyperintense signal on FLAIR. After contrast administration (T1C), there is partial spotted enhancement. The boundary is not well-defined, with dimensions approximately 21*45*33 mm. There is a small amount of edema in the surrounding brain parenchyma, and no midline shift is observed.",
    "BraTS-GLI-00542-000": "A mass-like abnormal signal is seen in the left frontal-temporal lobe, presenting as a low signal on T1-weighted imaging and a slightly high mixed signal on T2-weighted and FLAIR imaging, with uneven enhancement on T1 with contrast. The lesion has well-defined boundaries and measures approximately 55*98*58 mm, with surrounding edema. No midline shift is evident.",
    "BraTS-GLI-00547-000": "An irregular abnormal signal focus is visible in the left frontal lobe, presenting as low signal on T1-weighted imaging (T1W), high signal on T2-weighted imaging (T2W) and FLAIR sequences, and a significant ring-like enhancement on contrast-enhanced T1-weighted imaging (T1C). The boundary is not clear, with an approximate size of 46*72*52mm. There is a large amount of edema in the surrounding brain parenchyma, with no shift of midline structures.",
    "BraTS-GLI-00559-000": "In the right frontal lobe, there is an irregular abnormal signal focus visible, showing low signal on T1-weighted images with a slight high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and significant ring-like enhancement on contrast-enhanced T1-weighted images (T1C) with indistinct boundaries, measuring approximately 57*117*60mm. Peripheral brain parenchyma edema is present, with a mild leftward shift of midline structures. On the left temporal operculum, there is a sheet-like abnormal signal shadow, showing isointense signal on T1-weighted images, and high signal on T2-weighted and FLAIR sequences, with no obvious enhancement after contrast.",
    "BraTS-GLI-00575-000": "Irregular abnormal signal foci are observed in the left basal ganglia region and the temporal insular lobe, presenting with low signal intensity on T1-weighted images and high signal intensity on T2-weighted and FLAIR images. Notable ring-like enhancement is seen on contrast-enhanced T1-weighted images (T1C), with indistinct borders, measuring approximately 64*94*68mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and a rightward shift of midline structures.",
    "BraTS-GLI-00590-000": "An irregular abnormal signal focus can be seen in the right temporal lobe, appearing as mixed low signal on T1-weighted images, and mixed high signal on T2-weighted and FLAIR images. There is notable ring-like enhancement following contrast on T1-weighted images. The borders of the lesion are ill-defined, measuring approximately 59*102*79 mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a shift of midline structures to the left.",
    "BraTS-GLI-00598-000": "An irregular abnormal signal focus can be seen in the right temporal lobe, presenting as a low signal on T1W images, a high signal on T2W and FLAIR images, and marked ring-like enhancement on T1C. The boundaries are not clear, with the size approximately 53*101*73mm. There is a significant amount of edema in the surrounding brain parenchyma, mild compression on the right lateral ventricle, and no shift of midline structures.",
    "BraTS-GLI-00599-000": "A mass-like abnormal signal is seen in the right frontal lobe, exhibiting a slightly low signal on T1-weighted imaging (T1W), a slightly high signal on T2-weighted imaging (T2W), and a slightly high signal on Fluid-Attenuated Inversion Recovery (FLAIR). After contrast (T1C), there is uneven mild enhancement. The mass has a clear boundary and measures approximately 59*88*66mm. There is peritumoral edema. The midline structures are shifted to the left, and the anterior horn of the right lateral ventricle is compressed and narrowed.",
    "BraTS-GLI-00604-000": "An irregular abnormal signal focus is observed in the right frontal lobe, showing low signal on T1-weighted imaging with local high signal areas, mixed high and low signal on T2-weighted and FLAIR sequences, inhomogeneously enhanced on contrast-enhanced T1, with indistinct boundaries and multiple vessel shadows within, measuring approximately 73*82*63mm. Perilesional brain parenchyma edema is present, with compression of the right lateral ventricle and leftward shift of the midline structures.",
    "BraTS-GLI-00607-001": "There are two abnormal signal foci in the left frontal-occipital lobe, which appear as low signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR images, and show significant garland-like enhancement on T1-weighted images post-contrast (T1C). The boundaries are ill-defined. The larger focus is located in the left occipital lobe, measuring approximately 74*126*101 mm. Surrounding brain parenchyma shows extensive edema. There is no compression on the lateral ventricles, and midline structures are not shifted.",
    "BraTS-GLI-00613-000": "Multiple irregular abnormal signal foci are visible in the left frontal, parietal, and temporal lobes, adjacent to the lateral ventricle and in the splenium of the corpus callosum, showing low signal on T1W images. Some high signal foci on T1W are seen within the lesions of the left frontal and parietal lobes. Mixed high and low signals are observed on T2W and FLAIR sequences, with marked ring-like and patchy enhancement on T1C. The boundaries are indistinct. The larger lesion located in the left frontal lobe measures approximately 65*97*67mm. There is surrounding cerebral edema, without midline shift.",
    "BraTS-GLI-00623-000": "Irregular abnormal signal foci are seen in the bilateral frontal lobes and the genu of the corpus callosum, displaying isointense to low signal on T1-weighted images and hyperintense mixed signal on T2-weighted and FLAIR sequences, with significant uneven ring-like enhancement on post-contrast T1 images. The borders are ill-defined, measuring approximately 96*98*64mm. Extensive edema is present in the surrounding brain parenchyma, with compression of the anterior horns of the bilateral lateral ventricles and a deviation of the midline structures to the right.",
    "BraTS-GLI-00630-000": "An irregular abnormal signal focus is visible in the left basal ganglia region, presenting as hypointense with slight hyperintensity on T1-weighted (T1W) images, mixed hyperintense and hypointense signals on T2-weighted (T2W) and Fluid-Attenuated Inversion Recovery (FLAIR) images, uneven enhancement on post-contrast T1-weighted (T1C) images, and indistinct borders, measuring approximately 61*52*63mm. Surrounding brain parenchyma shows edema, the left lateral ventricle is compressed, and there is a mild shift of midline structures to the right.",
    "BraTS-GLI-00645-000": "An irregular abnormal signal focus is seen in the left frontal lobe, presenting as a low signal with slight high signal on T1W images, mixed high and low signal on T2W and FLAIR sequences, and marked ring-like enhancement on T1C sequence. The margins are poorly defined, with an approximate size of 34*37*33 mm. The midline structures show no shift.",
    "BraTS-GLI-00652-000": "Multiple irregular abnormal signal foci are observed in the right frontal and temporal lobes, presenting as isointense or hypointense on T1-weighted imaging (T1W), a mix of high and low signals on T2-weighted imaging (T2W) and Fluid-Attenuated Inversion Recovery (FLAIR) sequences. There is marked ring-like enhancement on T1 post-contrast (T1C) with ill-defined borders. The larger lesion is located in the right temporal lobe, measuring approximately 71*91*71 mm, and contains an area of high signal intensity on T1W. Extensive edema is seen in the surrounding brain parenchyma, with compression on the right lateral ventricle and leftward deviation of midline structures.",
    "BraTS-GLI-00667-000": "In the right frontal lobe there is an irregular abnormal signal focus, which crosses the midline, presenting as low signal on T1W with a slight high signal, a mixed high signal on T2W and FLAIR, and significant ring-like enhancement on T1C. The border is not clearly defined, with an approximate size of 61*78*66 mm. Extensive edema is present in the surrounding brain parenchyma, with compression of the anterior horns of both lateral ventricles and left deviation of midline structures.",
    "BraTS-GLI-00676-001": "Irregular abnormal signal foci can be seen in the left frontal lobe, periventricular area, and the body of the corpus callosum, crossing the midline. They exhibit low signal on T1W with a hint of high signal, mixed high and low signal on T2W and FLAIR sequences. Prominent ring-like enhancement is noted on T1C with unclear boundaries. The dimensions of the lesion are approximately 63*60*62 mm. The surrounding brain parenchyma shows significant edema; the lateral ventricle is compressed with a slight rightward shift of the midline structures.",
    "BraTS-GLI-00680-000": "An irregular abnormal signal focus is observed in the left insular lobe, presenting with isointense to low signal on T1-weighted imaging (T1W), high signal on T2-weighted imaging (T2W) and Fluid-attenuated inversion recovery (FLAIR) sequences. There is notable heterogeneous enhancement post-contrast administration on T1-weighted sequences (T1C) with indistinct boundaries. The size of the lesion is approximately 49*87*63 mm. Extensive edema is noted in the surrounding brain parenchyma. The left lateral ventricle is slightly compressed, without displacement of midline structures.",
    "BraTS-GLI-00683-001": "An irregular abnormal signal focus is seen in the left parietal-occipital-temporal lobe, presenting with low signal on T1-weighted images with some high signal, mixed high signal on T2-weighted and FLAIR sequences, and significant garland-like enhancement on T1 post-contrast. The lesion has ill-defined borders and measures approximately 73x100x77mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and a shift of the midline structures to the right.",
    "BraTS-GLI-00686-000": "An irregular abnormal signal focus is observable in the right frontal, temporal, and insular lobes, showing low signal intensity on T1-weighted images with scattered high signal, mixed high and low signal on T2-weighted and FLAIR images, and significant ring-like enhancement on T1 post-contrast images. The borders are indistinct, and the size is approximately 79*111*83 mm. There is a large amount of edema in the surrounding brain parenchyma; the right lateral ventricle is compressed and midline structures are shifted to the left.",
    "BraTS-GLI-00694-001": "A nodular abnormal signal focus is seen in the right parietal lobe, exhibiting slightly low signal on T1WI, high signal on T2WI, and high signal on FLAIR. Post-contrast T1 imaging shows ring enhancement with poorly defined margins, measuring approximately 73*90*75 mm. Surrounding brain parenchyma shows extensive edema, with compression of the right lateral ventricle and a leftward shift of midline structures.",
    "BraTS-GLI-00698-000": "At the junction of the right temporal and parietal lobes, an irregular abnormal signal lesion is seen, presenting with isointense to low signal on T1-weighted images, high mixed signal on T2-weighted and FLAIR images, and marked ring-like enhancement on T1-weighted images with contrast (T1C). The lesion boundaries are poorly defined, measuring approximately 60*84*70mm in size. There is extensive edema in the surrounding brain parenchyma. The right lateral ventricle is slightly compressed, and there is a mild shift of the midline structures to the left.",
    "BraTS-GLI-00706-000": "In the right basal ganglia and insular/temporal lobes, irregular abnormal signal foci can be observed, demonstrating low signal on T1-weighted imaging with a trace of high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and marked 'ring enhancement' on T1-weighted post-contrast images. The lesion displays indistinct borders and measures approximately 63*99*87 mm. There is a significant amount of edema in the surrounding brain parenchyma, right lateral ventricle compression, and leftward deviation of midline structures.",
    "BraTS-GLI-00715-001": "At the junction of the left frontal and parietal lobes, an irregular abnormal signal focus is visible, which appears as a low signal on T1W, mixed high and low signals on T2W and FLAIR, and uneven enhancement on T1C with unclear boundaries. The dimensions are approximately 47*83*62 mm. There is perilesional brain parenchymal edema, but no midline shift.",
    "BraTS-GLI-00716-000": "On the right frontal operculum and basal ganglia region, there is an irregular abnormal signal focus, presenting as low signal with some high signal on T1W, mixed high and low signal on T2W and FLAIR, and conspicuous ring enhancement on T1C with unclear boundaries, measuring approximately 35*62*51 mm. There is extensive edema in the surrounding brain parenchyma, mild compression of the right lateral ventricle, and a slight leftward shift of midline structures.",
    "BraTS-GLI-00725-001": "Multiple irregular abnormal signal foci are observed in the bilateral frontal lobes and the knee of the corpus callosum, showing hypo-intense signal on T1W imaging, hyperintense signal on T2W imaging, mixed high and low signal on FLAIR imaging, and distinct patchy and ring-like enhancement on T1C, with unclear boundaries, measuring approximately 94*92*74mm. Extensive edema is present in the surrounding brain parenchyma, with compression of the frontal horns of the bilateral lateral ventricles. No midline shift is observed.",
    "BraTS-GLI-00728-000": "A nodular abnormal signal shadow can be seen in the left basal ganglia area, showing slightly low signal on T1-weighted images, slightly high signal on T2-weighted images, and slightly high signal on FLAIR, with marked enhancement on T1 contrast, clear boundaries, measuring approximately 32*60*48 mm, with flaky peritumoral edema. There is no shift of midline structures.",
    "BraTS-GLI-00729-001": "A lesion resembling a rounded abnormal signal is visible in the left temporal lobe. It measures approximately 26*38*27 mm and exhibits a low signal on T1-weighted imaging (T1W), and high signal on T2-weighted imaging (T2W) and FLAIR sequences. Post-contrast T1-weighted imaging (T1C) shows pronounced ring-like enhancement. The lesion's boundaries are not well defined. Surrounding brain parenchyma shows edema, with no shift of midline structures.",
    "BraTS-GLI-00734-001": "An irregular abnormal signal focus is visible in the left occipitotemporal lobe, showing a low signal on T1W accompanied by a slight high signal shadow, mixed high and low signals on T2W and FLAIR, and an obvious garland-like enhancement on T1C with ill-defined boundaries. The dimensions are approximately 73*102*94 mm. A large amount of edema is present in the surrounding brain parenchyma, with compression of the left lateral ventricle and deviation of midline structures to the right.",
    "BraTS-GLI-00737-000": "In the left frontal lobe, basal ganglia region, and adjacent to the lateral ventricle, there is a mass-like abnormal signal shadow. It presents as low signal on T1-weighted images, slightly high signal on T2-weighted images, and slightly high signal on FLAIR sequences. After contrast enhancement (T1C), there is uneven enhancement around the margins of the lesion, which are well-defined. The size of the lesion is approximately 44*56*42mm and there is edema around the tumor. There is no midline shift observed.",
    "BraTS-GLI-00742-000": "At the junction of the right frontal and parietal lobes, there is an irregular abnormal signal focus which appears hypointense on T1W, hyperintense on T2W and FLAIR sequences, and demonstrates significant ring-like enhancement on T1C. The lesion's dimensions are approximately 88*117*86mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a shift of the midline structures to the left.",
    "BraTS-GLI-00753-001": "An abnormal signal focus is visible in the right cerebellar hemisphere, presenting as an isointense to low signal on T1W, mixed high and low signals on T2W and FLAIR, with conspicuous ring-like enhancement on T1C. The boundary is ill-defined, with dimensions approximately 28*38*12 mm. Surrounding brain parenchyma edema is present, with no shift of midline structures.",
    "BraTS-GLI-00758-000": "A mass-like abnormal signal is observed within the posterior horn of the left lateral ventricle, presenting as iso- to hypointense on T1W images, mixed signal intensity on T2W images, and mixed signal intensity on FLAIR images. There is uneven enhancement post-contrast on T1C images, with clear boundaries and dimensions approximately 42*64*37mm, including peritumoral edema. There is no midline shift.",
    "BraTS-GLI-00764-000": "Multiple abnormal signal foci are seen in the right frontal, parietal, and occipital lobes, right hippocampus, bilateral periventricular areas, and the splenium of the corpus callosum. These lesions present mixed high and low signals on T1W, T2W, and FLAIR sequences, with significant, irregular ring-like enhancement and indistinct boundaries on T1C. The largest focus is located in the right occipital lobe, measuring approximately 75*106*84mm. Surrounding brain parenchyma shows edema, with a slight left deviation of midline structures.",
    "BraTS-GLI-00765-000": "An irregular lesion with abnormal signal is visible in the right temporal lobe, demonstrating low signal on T1W with a slight high signal, mixed high and low signal on T2W and FLAIR, and obvious 'garland-like' enhancement on T1C. The lesion has an unclear boundary, with an approximate size of 61*104*75 mm. There is substantial edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and left deviation of midline structures.",
    "BraTS-GLI-00772-000": "On the left temporal lobe, an irregular abnormal signal focus can be seen, which appears as low signal on T1W, mixed high and low signal on T2W and FLAIR, and marked ring-like enhancement on T1C. The borders are poorly defined, measuring approximately 35*37*25 mm. Surrounding brain parenchyma shows edema, with no shift in midline structures.",
    "BraTS-GLI-00775-001": "An irregular abnormal signal focus can be seen in the right temporal lobe, which appears as an isointense to hypointense signal on T1-weighted imaging, mixed hyperintense and hypointense signals on T2-weighted and FLAIR sequences, with obvious ring-like enhancement on post-contrast T1-weighted imaging. The boundaries are ill-defined. The size of the lesion is approximately 41*78*50 mm. There is extensive edema in the surrounding brain parenchyma, but no midline shift is observed.",
    "BraTS-GLI-00777-001": "An irregular abnormal signal focus can be seen in the right frontal-parietal-temporal lobe, exhibiting low signal on T1W accompanied by a slight high signal, high signal on T2W and FLAIR, significant ring-like enhancement on T1C, with indistinct boundaries, measuring approximately 61*88*69 mm. Extensive edema is present in the surrounding brain parenchyma, the right lateral ventricle is compressed, and there is a slight shift of midline structures to the left.",
    "BraTS-GLI-00778-000": "An irregular abnormal signal focus is visible in the left temporal lobe, presenting as hypointense on T1W, hyperintense on T2W and FLAIR sequences. It shows significant ring-like enhancement on T1C with unclear boundaries, approximately measuring 48*82*39mm. There is surrounding brain parenchyma edema, but no shift in midline structures.",
    "BraTS-GLI-00801-000": "An irregular abnormal signal focus can be seen in the right temporal-occipital lobe, which presents with low signal on T1-weighted imaging with some high signals, mixed high and low signals on T2-weighted imaging, and FLAIR imaging, and significant ring-like enhancement on T1-contrast imaging, with ill-defined boundaries, approximately 58*78*67 mm in size. There is substantial edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and shift of midline structures to the left.",
    "BraTS-GLI-00819-000": "Irregular abnormal signal foci are seen in the right parieto-occipital lobe and the splenium of the corpus callosum, presenting as iso- to low signal on T1W, mixed high and low signal on T2W/FLAIR, and marked ring-like enhancement on T1C. The boundaries are ill-defined, measuring approximately 67*93*91 mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-00820-000": "Multiple irregular abnormal signal foci are found in the right frontal lobe, basal ganglia region, pons, and brainstem, which appear as iso- to hypointense on T1-weighted images, and hyperintense on T2-weighted and FLAIR images. Post-contrast T1 images show marked patchy and ring-like enhancement, with unclear boundaries, measuring approximately 66*45*77 mm. Surrounding brain parenchymal edema is present, with compression of the right lateral ventricle, and mild leftward shift of the midline structures.",
    "BraTS-GLI-00824-000": "Irregular abnormal signal foci can be seen in both temporal lobes and the splenium of the corpus callosum, presenting with low T1W signals with some high signals, mixed high and low signals on T2W and FLAIR, and uneven ring-like enhancement on T1C. The boundary is not clear, and the size is approximately 66*80*72mm. There is surrounding brain parenchymal edema, with compression on the lateral ventricles, and no midline shift.",
    "BraTS-GLI-00838-000": "Multiple clustered abnormal signal shadows are seen in the right frontal lobe, basal ganglia area, and beside the lateral ventricle, exhibiting slightly low signal on T1-weighted images, slightly high signal on T2-weighted images, and slightly high signal on FLAIR. On T1C (post-contrast T1-weighted imaging), the lesion shows uneven marginal enhancement with clear boundaries, measuring approximately 66*92*66mm, with peritumoral edema. There is a leftward shift of midline structures, and the right lateral ventricle is compressed and narrowed.",
    "BraTS-GLI-00840-000": "A mass-like abnormal signal is seen in the left frontal lobe, presenting as a low signal on T1-weighted images, a high signal on T2-weighted images, and slightly low signal on FLAIR images. The lesion demonstrates uneven enhancement on T1 post-contrast images, with indistinct boundaries, measuring approximately 80*91*82mm, with surrounding edema. No midline shift is observed.",
    "BraTS-GLI-00999-000": "An irregular abnormal signal foci is visible in the right frontal lobe, exhibiting low signal on T1-weighted images, high signal on T2-weighted and FLAIR sequences, and pronounced ring-like enhancement on post-contrast T1 images. The lesion's boundaries are ill-defined, with a size of approximately 74*85*83 mm. There is extensive edema in the surrounding brain parenchyma, compression of the lateral ventricle, and left deviation of midline structures.",
    "BraTS-GLI-01010-000": "An irregular abnormal signal focus is seen in the left temporal-occipital lobe, presenting with iso- to hypointense signal on T1W images, a mixed high and low signal on T2W and FLAIR images, and marked ring-like enhancement on T1W contrast-enhanced images. The border is not well-defined, with approximate dimensions of 54*90*56 mm. Extensive edema is noted in the surrounding brain parenchyma with no midline shift.",
    "BraTS-GLI-01013-000": "An abnormal signal focus is observed in the left parieto-occipital lobe, exhibiting slightly low signal on T1W, high signal on T2W, and high signal on FLAIR sequences. There is notable ring-enhancement on T1W post-contrast (T1C) with ill-defined borders, measuring approximately 50*60*68 mm. Surrounding brain parenchyma shows edema, with no midline shift.",
    "BraTS-GLI-01016-000": "A cluster of abnormal signals is visible in the left temporal lobe, which presents as slightly hypointense on T1-weighted images (T1W), hyperintense on T2-weighted images (T2W), and hyperintense on FLAIR images. Enhancement is uneven after T1 contrast (T1C), and the boundaries are not well defined. The lesion measures approximately 58*95*61 mm, with peritumoral edema. There is no midline shift.",
    "BraTS-GLI-01017-000": "A mass-like abnormal signal is visible in the right frontal lobe, presenting as a slightly low signal on T1W imaging, slightly high signal on T2W imaging, and slightly high signal on FLAIR imaging. There is uneven enhancement post-contrast (T1C). The lesion has clear boundaries and measures approximately 55*93*69 mm. There is peritumoral edema. The midline structures are shifted to the left.",
    "BraTS-GLI-01019-000": "On the left parieto-occipital lobe and the splenium of the corpus callosum, irregular abnormal signal foci are observed, presenting as T1W hypointense to isointense signal, mixed high and low signal on T2W and FLAIR sequences, with significant ring-like enhancement on T1C, and ill-defined borders. The size is approximately 74*87*86 mm. There is extensive edema in the surrounding brain parenchyma, and the posterior horn of the left lateral ventricle is compressed, without displacement of midline structures.",
    "BraTS-GLI-01023-000": "An irregular abnormal signal focus is seen at the junction of the right frontal and parietal lobes, presenting as isointense to low signal on T1W, mixed high and low signal on T2W and FLAIR, and marked ring-like enhancement on T1C with unclear boundaries, measuring approximately 62*63*69 mm. There is extensive edema in the surrounding brain parenchyma, mild compression of the posterior horn of the right lateral ventricle, and no shift of midline structures.",
    "BraTS-GLI-01037-000": "Two irregular abnormal signal foci are visible in the right temporal-occipital lobe, with low signal on T1-weighted imaging with slight high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and obvious 'ring-like' enhancement on T1 post-contrast imaging. The borders are unclear, with the larger lesion located in the right temporal lobe, measuring approximately 68*107*70 mm. There is significant edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-01042-000": "An irregular abnormal signal focus can be seen in the right temporal lobe, which shows as low signal on T1W with slight high signal, mixed high and low signal on T2W and FLAIR sequences, and the T1C sequence shows obvious ring-like enhancement. The boundaries are unclear, with dimensions of approximately 67*110*71 mm. There is a large amount of edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-01044-000": "An irregular abnormal signal focus can be seen in the right temporal and insular lobes, presenting as low signal on T1W images, and high mixed signals on T2W and FLAIR sequences. After administering contrast (T1C), a significant 'ring-like' enhancement is observed. The boundary is not clearly defined, with approximate dimensions of 64*109*100 mm. There is substantial edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a shift of midline structures to the left.",
    "BraTS-GLI-01050-000": "Irregular abnormal signal foci can be observed in the left occipital lobe and thalamus, exhibiting low signal on T1W with a slight high signal, mixed high and low signals on T2W and FLAIR, and uneven enhancement on T1C. The border is indistinct, and the size is approximately 39*89*55mm. There is significant edema of the surrounding brain parenchyma, compression of the left lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-01052-000": "Two irregular abnormal signal foci are observed in both frontal lobes and the genu of corpus callosum, with the larger lesion crossing the midline along the genu of the corpus callosum, exhibiting T1W hypointensity with slight hyperintensity, mixed high and low signals on T2W and FLAIR sequences, significant ring-like enhancement on T1C with unclear boundaries, measuring approximately 72*95*55 mm; the smaller lesion located in the right frontal lobe shows T1W hypointensity, high signal on T2W and FLAIR, significant enhancement on T1C with unclear boundaries, measuring approximately 72*95*55 mm. Surrounding brain parenchyma edema is present, with compression of the anterior horns of the lateral ventricles bilaterally, and no midline shift is observed.",
    "BraTS-GLI-01057-000": "Irregular abnormal signal foci can be seen in the left basal ganglia region, presenting with T1W isointense signal with localized hypointensity, mixed high and low signal on T2W and FLAIR sequences, and significant 'garland-like' enhancement on T1C, with indistinct boundaries, measuring approximately 36*60*49mm. In the left frontal lobe, there is a patchy abnormal signal focus presenting with T1W hypointensity, T2W and FLAIR hyperintensity, with slight enhancement on T1C, and indistinct boundaries, measuring approximately 36*60*49mm. There is surrounding brain parenchymal edema, compression on the left lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-01063-000": "In the right occipital lobe, there is an irregular abnormal signal focus, which shows low signal on T1W with a slight high signal, mixed high and low signals on T2W and FLAIR sequences, and marked ring-like enhancement on T1C. The boundaries are ill-defined, with dimensions approximately 70*106*84mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-01069-000": "An irregular abnormal signal focus is observed in the left parietal-occipital-temporal lobe, showing a low signal on T1W with some high signal, mixed high signal on T2W and FLAIR, and obvious ring-like enhancement on T1C. The boundaries are not clear, measuring approximately 61*94*69mm. There is extensive edema in the surrounding brain parenchyma, compression of the posterior horn of the left lateral ventricle, and deviation of the midline structures to the right.",
    "BraTS-GLI-01074-000": "An irregular abnormal signal focus is observed in the left frontal lobe, presenting as isointense to hypointense on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR sequences, with significant ring-like enhancement seen post gadolinium administration on T1-weighted images. The borders are not well defined, measuring approximately 64*76*64mm. There is extensive edema within the surrounding brain parenchyma, compression of the left lateral ventricle, and a shift of midline structures to the right.",
    "BraTS-GLI-01077-000": "In the right parietal lobe, there is an approximately round-shaped abnormal signal focus, which shows isointense on T1-weighted imaging, hyperintense on T2-weighted and FLAIR sequences, and significant nodular enhancement on T1-weighted imaging post-contrast. The lesion has ill-defined boundaries and measures approximately 23*24*35 mm. Surrounding brain parenchyma shows edema, but there is no midline shift.",
    "BraTS-GLI-01079-000": "An irregular abnormal signal focus can be seen in the left temporal insular lobe, presenting with low signal on T1-weighted imaging with a slight high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and significant ring-like enhancement on T1-weighted imaging with contrast, with indistinct borders, measuring approximately 67*127*95 mm. Extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-01080-000": "An irregular abnormal signal focus is observable in the left parietal temporal lobe, exhibiting a low signal on T1-weighted (T1W) images with localized high signals, mixed high and low signals on T2-weighted (T2W) and FLAIR sequences, and marked 'ring-like' enhancement on T1-weighted contrast-enhanced (T1C) images. The boundary is poorly defined, with dimensions approximately 51*97*70 mm. Extensive edema is present in the surrounding brain parenchyma; the left lateral ventricle is compressed, and there is a slight rightward shift of the midline structures.",
    "BraTS-GLI-01083-000": "An irregular abnormal signal focus is visible in the right frontal temporal lobe, exhibiting low signal on T1W with a slight high signal, mixed high signal on T2W and FLAIR sequences, and significant ring-like enhancement on T1C. The boundary is not clear, with approximate dimensions of 56*86*73 mm. A large amount of edema is present in the surrounding brain parenchyma, the right lateral ventricle is compressed, and there is no shift in midline structures.",
    "BraTS-GLI-01090-000": "The left frontal lobe shows an irregular abnormal signal focus, which presents with mixed high and low signals on T1W, mixed high and low signals on T2W and FLAIR, with uneven enhancement on T1C. The boundaries are not well defined, measuring about 48*72*72mm. Perilesional brain parenchymal edema is noted, with the frontal horn of the left lateral ventricle being compressed, and a shift to the right of midline structures.",
    "BraTS-GLI-01092-000": "An irregular abnormal signal focus can be seen in the left frontal lobe, which is hypointense on T1W images with a few hyperintense spots, hyperintense on T2W images, mixed hypo- and hyperintense on FLAIR, and demonstrates significant ring-like enhancement on T1C (post-contrast). The boundary is poorly defined, with dimensions approximately 62*92*76 mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-01094-000": "An irregular abnormal signal focus is visible in the left parietal lobe, presenting with iso- to hypointense signal on T1-weighted images with a local hyperintense signal, hyperintense signal on T2-weighted images, and mixed high and low signal on FLAIR. After contrast (T1C), the lesion shows a significant ring-like enhancement. The boundaries are ill-defined, measuring approximately 58*77*78 mm. There is considerable edema in the surrounding brain parenchyma, compression of the posterior horn of the left lateral ventricle, and no midline shift is detected.",
    "BraTS-GLI-01105-000": "An irregular abnormal signal focus can be seen in the left temporal lobe, presenting with low signal on T1W with a few high signals, mixed high and low signal on T2W and FLAIR, and significant ring-like enhancement on T1C. The boundary is poorly defined, measuring approximately 69*97*75 mm. There is substantial edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and mild rightward shift of the midline structures.",
    "BraTS-GLI-01106-000": "Multiple irregular abnormal signal foci are observed at the junction of the left frontal and parietal lobes, basal ganglia, pons, and brainstem. The foci exhibit low signal on T1W sequence, high signal on T2W and FLAIR sequences, and significant 'ring enhancement' on T1C. The boundaries of the lesions are not well-defined, measuring approximately 49*78*49mm. There is surrounding brain parenchymal edema, with no shift in midline structures.",
    "BraTS-GLI-01109-000": "Irregular abnormal signal foci are visible in the bilateral parietal lobes and the splenium of the corpus callosum, displaying hypo-intense signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR sequences, and marked ring-like enhancement on post-contrast T1 images. The lesion borders are indistinct, with dimensions of approximately 73*60*51 mm. There is significant edema in the surrounding brain parenchyma, compression of the posterior horns of the lateral ventricles on both sides, with no midline shift.",
    "BraTS-GLI-01110-000": "A lesion resembling a round abnormal signal is seen in the left frontal lobe and the genu of the corpus callosum, presenting as a low signal on T1-weighted images, and high signal on T2-weighted and FLAIR sequences, with marked ring-like enhancement on T1 post-contrast images. The lesion has ill-defined boundaries and measures approximately 66*83*45 mm. There is significant edema in the surrounding brain parenchyma, compression of the anterior horns of the bilateral lateral ventricles, and a rightward shift of midline structures.",
    "BraTS-GLI-01111-000": "There is a mass-like abnormal signal shadow seen in the left frontal-parietal-temporal lobe, the basal ganglia region, and next to the lateral ventricle, which displays mixed high-low signal on T1-weighted images, mixed high-low signal on T2-weighted images, and mixed high-low signal on FLAIR images. There is inhomogeneous enhancement post T1 contrast, with a clear boundary, measuring approximately 62*99*99 mm. Peritumoral edema is present. There is no shift in midline structures, and the left lateral ventricle is slightly compressed and narrowed.",
    "BraTS-GLI-01120-000": "An irregular abnormal signal focus is visible in the left frontal-opercular and basal ganglia region, exhibiting low signal on T1W with a small amount of high signal, high signal on T2W and FLAIR, and marked ring-like enhancement on T1C. The boundary is poorly defined with approximate dimensions of 63*93*64 mm. Surrounding brain parenchyma shows edema, the left lateral ventricle is compressed, and there is a shift of midline structures to the right.",
    "BraTS-GLI-01134-000": "Irregular abnormal signal foci are visible in the right basal ganglia and the frontal operculum, presenting as low signal on T1-weighted imaging with local high signal, mixed high and low signals on T2-weighted and FLAIR sequences, and marked ring-like enhancement on T1 post-contrast imaging with indistinct boundaries, measuring approximately 51*83*66 mm. Extensive edema is noted in the surrounding brain parenchyma with compression of the right lateral ventricle and deviation of midline structures to the left.",
    "BraTS-GLI-01144-000": "A mass-like abnormal signal is observed in the right parietal lobe, presenting with a slightly hypointense signal on T1-weighted images, isointense to hyperintense signal on T2-weighted images, and slightly hyperintense signal on FLAIR. There is inhomogeneous enhancement on post-contrast T1 images. The lesion is clearly demarcated with dimensions of approximately 55*67*70 mm, and is associated with peritumoral edema. There is no shift in the midline structures, and the posterior horn of the right lateral ventricle is slightly compressed and narrowed.",
    "BraTS-GLI-01146-000": "Multiple irregular abnormal signal foci are visible in the right frontal lobe and the knee of the corpus callosum, presenting with mixed high and low signals on T1W, high mixed signals on T2W and FLAIR, and marked patchy and ring-like enhancement on T1C. The boundaries are not clear. The size is approximately 65*77*69mm. Extensive edema is present in the surrounding brain parenchyma, the right lateral ventricle is compressed, and there is a left deviation of the midline structures.",
    "BraTS-GLI-01150-000": "An irregular abnormal signal foci can be seen in the left temporal lobe, presenting as isointense to low signal intensity on T1-weighted images, high mixed signal intensity on T2-weighted and FLAIR sequences, and significant ring-like enhancement on T1 post-contrast images. The lesion has ill-defined boundaries and measures approximately 102*110*72mm. Surrounding brain parenchyma shows edema, with compression on the posterior horn of the left lateral ventricle, and no midline shift observed.",
    "BraTS-GLI-01157-000": "Irregular abnormal signal foci are seen in the right parieto-occipital lobe and bilateral pericallosal regions, presenting as iso- to hypointense on T1W, hyperintense on T2W and FLAIR sequences. Notable ring-like enhancement is observed post-gadolinium (T1C), with indistinct boundaries, measuring approximately 76*99*86 mm. Extensive edema is noted in the surrounding brain parenchyma, with compression of the right lateral ventricle and a mild leftward shift of midline structures.",
    "BraTS-GLI-01161-000": "An irregular abnormal signal focus can be seen in the right temporal-occipital insular lobe, showing low signal on T1-weighted imaging with some areas of high signal, mixed high and low signal on T2-weighted and FLAIR imaging, and marked 'ring-like' enhancement on T1-weighted contrast-enhanced imaging with unclear boundaries, measuring approximately 64*98*65mm. There is significant surrounding cerebral edema, compression on the right lateral ventricle, and a left shift of midline structures.",
    "BraTS-GLI-01167-000": "An irregular abnormal signal focus is found at the junction of the left frontal and parietal lobes, presenting as T1-weighted hypointense to isointense signal, T2-weighted and FLAIR hyperintense mixed signal. After contrast (T1C), there is patchy enhancement. The lesion has ill-defined margins, measuring approximately 61*98*83 mm. There is extensive edema in the surrounding brain parenchyma, compression of the posterior horn of the right lateral ventricle is observed, with no deviation of the midline structures.",
    "BraTS-GLI-01168-000": "A lesion approximating a round shape is visible in the left temporal-insular lobe, exhibiting low signal on T1W images, high signal on T2W and FLAIR images, and marked 'ring-like' enhancement on T1W post-contrast images, with indistinct borders, measuring approximately 48*69*57 mm. There is significant surrounding cerebral edema with compression of the left lateral ventricle and a mild shift to the right of midline structures.",
    "BraTS-GLI-01175-000": "Multiple irregular abnormal signal foci can be seen in the left parieto-occipito-temporal lobe, splenium of the corpus callosum and the right parietal lobe, presenting as T1-weighted hypointensity or isointensity, T2-weighted and FLAIR hyperintense mixed signal, with marked and uneven contrast enhancement on T1C images. Boundaries are ill-defined, and the size is approximately 68*84*77 mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle is noted, and there is a shift of midline structures to the right.",
    "BraTS-GLI-01182-000": "On the right frontal lobe, an irregular abnormal signal focus is observed, showing low signal on T1W, high signal on T2W and FLAIR, with obvious speckled enhancement on T1C. The borders are not well defined, and the size is approximately 89*124*96 mm. Surrounding brain parenchyma shows edema, the anterior horn of the right lateral ventricle is compressed, and there is a leftward shift of midline structures.",
    "BraTS-GLI-01186-000": "An irregular abnormal signal focus is seen in the right frontal parietal lobe, appearing as low signal on T1W imaging with a slight high signal, high signal on T2W and FLAIR imaging with local low signal, and significantly uneven enhancement on T1C. The boundary is not well-defined, with an approximate size of 46*43*50 mm. There is slight edema in the surrounding brain parenchyma, with no shift in midline structures.",
    "BraTS-GLI-01193-000": "An irregular abnormal signal focus is visible in the left temporal lobe, showing low signal on T1W with local high signal, mixed high and low signal on T2W and FLAIR. There is obvious ring-like enhancement on T1C, with the boundary being ill-defined, measuring approximately 51*96*52mm. There is a significant amount of edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and a mild shift to the right of the midline structures.",
    "BraTS-GLI-01197-000": "A mass-like abnormal signal shadow can be seen in the left parietal lobe, presenting with mixed signals on T1-weighted, T2-weighted, and FLAIR sequences. It shows uneven mild enhancement on T1-contrast, with a clear boundary and dimensions of approximately 62*82*76mm. There is surrounding edema. No midline shift is present.",
    "BraTS-GLI-01202-000": "An irregular abnormal signal focus can be seen in the right temporal lobe, which shows iso- to hypo-intense signal on T1-weighted images, hyperintense signal on T2-weighted images, mixed high and low signal on FLAIR, and prominent ring-like enhancement on T1-weighted images post-contrast (T1C). The boundaries are not clear, with the size approximately 94*111*84 mm. There is a significant amount of edema within the surrounding brain parenchyma, compression of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-01209-000": "An irregular abnormal signal focus is observed in the right occipito-temporal lobe, showing low signal with slight high signal on T1W, mixed high and low signals on T2W and FLAIR sequences, and significant ring enhancement on T1C with ill-defined boundaries. Dimensions are approximately 77*125*82mm. Extensive brain parenchymal edema is present surrounding the area, resulting in compression of the right lateral ventricle and deviation of midline structures to the left.",
    "BraTS-GLI-01221-000": "On the right frontal, insular, temporal lobes, and the basal ganglia region irregular abnormal signal foci are seen. These exhibit low signal on T1-weighted (T1W) images, and high signal on T2-weighted (T2W) and FLAIR sequences. With T1 post-contrast (T1C), there's marked annular enhancement. The borders are ill-defined, with the size approximately 68*139*81mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and deviation of midline structures to the left.",
    "BraTS-GLI-01223-000": "An abnormal signal focus is observed adjacent to the lateral ventricle of the left frontal lobe, exhibiting mixed high and low signals on T1W, T2W, and FLAIR sequences, with a marked ring enhancement on T1C. The lesion has ill-defined boundaries and measures approximately 67*66*78mm. Perilesional brain parenchyma shows edema, the left lateral ventricle is compressed, and there is a rightward shift of the midline structures.",
    "BraTS-GLI-01238-000": "A mass-like abnormal signal is observed in the right parieto-occipital lobe, showing slightly low signal on T1-weighted images, slightly high signal on T2-weighted images, and slightly high signal on FLAIR. Post-contrast T1 imaging shows uneven enhancement. The lesion has a clear boundary and measures approximately 55*94*88mm, with perilesional edema. There is no midline shift. The posterior horn of the right lateral ventricle is mildly compressed and narrowed.",
    "BraTS-GLI-01252-000": "An abnormal signal focus is seen adjacent to the falx in the left parietal lobe, presenting as hypointense/isointense on T1W, hyperintense on T2W, hyperintense on FLAIR, and showing uneven enhancement on T1C. The border is ill-defined, with dimensions approximately 24*41*47 mm. There is perilesional cerebral edema, with no midline shift.",
    "BraTS-GLI-01259-000": "Multiple irregular abnormal signal foci are visible in the left basal ganglia and temporal lobe region, presenting with low signal on T1-weighted images, mixed high and low signals on T2-weighted and FLAIR images, and conspicuous ring-like enhancement on T1-weighted images post-contrast. The boundaries are ill-defined, with dimensions of approximately 61*80*58 mm. There is extensive edema in the surrounding brain parenchyma, the left lateral ventricle is compressed, and there is a mild rightward shift of the midline structures.",
    "BraTS-GLI-01262-000": "In the left frontal-parietal lobe and the pressure part of the corpus callosum, there is an irregular abnormal signal focus, which shows low signal on T1W with a few high signals, mixed high and low signal on T2W and FLAIR, and marked ring-like enhancement on T1C. The boundary is not clear, with a size of approximately 108*148*96mm. There is a significant amount of edema in the surrounding brain parenchyma, with no shift of midline structures.",
    "BraTS-GLI-01266-000": "An irregular abnormal signal focus can be seen in the left frontal lobe, presenting as a low signal on T1-weighted images, and a high signal on T2-weighted and FLAIR sequences, with nodular and ring-like enhancement on T1 contrast, and indistinct boundaries, measuring approximately 75*112*83mm. There is significant edema in the surrounding brain parenchyma, with compression of the lateral ventricle, and deviation of midline structures to the right.",
    "BraTS-GLI-01268-000": "Two quasi-circular abnormal signal lesions can be visualized in the left parietal lobe, exhibiting mixed high and low signals on T1W, T2W, FLAIR sequences, and showing marked ring-like enhancement on T1C. The borders are not well-defined, with the larger one measuring approximately 53*60*52mm. Surrounding brain parenchyma edema is present. There is no obvious compression of the lateral ventricles, and no shift in midline structures.",
    "BraTS-GLI-01269-000": "An irregular abnormal signal focus can be seen in the left parieto-occipital lobe, showing low signal on T1-weighted imaging with a small amount of high signal, mixed high and low signal on T2-weighted and FLAIR sequences, and marked ring-like enhancement on contrast-enhanced T1-weighted imaging. The boundaries are not clear, with dimensions of approximately 55*111*83mm. There is a large amount of edema in the surrounding brain parenchyma, compression of the posterior horn of the left lateral ventricle, and no shift of midline structures.",
    "BraTS-GLI-01284-000": "An irregular abnormal signal focus is observed in the right frontal-parietal-occipital-temporal lobe, showing a low signal on T1W with a small amount of high signal, mixed high and low signal on T2W and FLAIR. Notable garland-like enhancement is seen on T1C, with unclear boundaries, measuring approximately 64*104*79 mm. Extensive surrounding cerebral parenchyma edema, compression of the right lateral ventricle, and slight left deviation of midline structures.",
    "BraTS-GLI-01285-000": "Two irregular abnormal signal foci are visible in the left frontal temporal lobe, showing hypo-intense signal with a slight hyper-intense signal on T1W images, mixed high and low signal on T2W and FLAIR sequences, and marked 'garland-like' enhancement on T1C images. The borders are not well-defined, with approximate dimensions of 61*112*74mm. Extensive edema is noted in the surrounding brain parenchyma, with compression of the left lateral ventricle and a rightward shift of midline structures.",
    "BraTS-GLI-01286-000": "An irregular signal abnormality is observed in the left frontal operculum and basal ganglia region, which appears as mixed signal intensity on T2-weighted and FLAIR sequences and showing a hypointense signal with small areas of hyperintensity on T1-weighted images. Post-contrast T1-weighted images demonstrate significant ring-like enhancement of the lesion. The lesion has unclear boundaries and measures approximately 59*113*82 mm. There is substantial perilesional brain edema, compression on the left lateral ventricle, and slight rightward shift of midline structures.",
    "BraTS-GLI-01288-000": "An irregular abnormal signal focus is observed on the left frontal lobe and basal ganglia area. It is hypointense on T1-weighted imaging with slight hyperintense signals, and presents with mixed high and low signals on T2-weighted and FLAIR images. Post-contrast T1 imaging shows significant ring-like enhancement. The lesion crosses the midline, with unclear boundaries, approximately 66*91*71 mm in size. There is extensive edema in the surrounding brain parenchyma, compression of the lateral ventricles, and shift of midline structures to the right.",
    "BraTS-GLI-01294-000": "Multiple irregular abnormal signal foci can be seen in the left frontal-temporal-insular lobes, presenting as iso- to hypointense on T1-weighted images and hyperintense with mixed signals on T2-weighted and FLAIR images. Patchy and ring-like enhancements are noted post-contrast (T1C), with ill-defined boundaries, the largest of which is located in the left frontal lobe, measuring approximately 51*98*66mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and slight rightward deviation of the midline structures.",
    "BraTS-GLI-01307-000": "An irregular abnormal signal focus is visible in the left frontal lobe, presenting as isointense to hypointense on T1W images, hyperintense on T2W images, and mixed high and low signals on FLAIR images. Notable ring-like enhancement is seen following T1C, with unclear boundaries, measuring approximately 76*88*85mm. There is extensive edema in the surrounding brain parenchyma, compression of the frontal horns of both lateral ventricles, and a rightward shift of the midline structures.",
    "BraTS-GLI-01313-000": "A lesion with a quasi-circular abnormal signal is observed in the left frontal parietal occipital lobe, showing a T1W hypointense signal with a trace of hyperintense, mixed high and low signal on T2W/FLAIR, and obvious ring-like enhancement on T1C with unclear boundaries, measuring approximately 62*94*80mm. There is extensive cerebral edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and shift of midline structures to the right.",
    "BraTS-GLI-01324-000": "An irregular abnormal signal focus is observed in the right frontal lobe, displaying low signal on T1-weighted images, high signal on T2-weighted images, and mixed high and low signal on FLAIR. There is marked 'ring-like' enhancement post-contrast on T1-weighted images. The borders are poorly defined. The size is approximately 89*110*96 mm. Extensive edema is present in the surrounding brain parenchyma, bilateral lateral ventricles are compressed, and there is a shift of midline structures to the left.",
    "BraTS-GLI-01330-000": "Irregular abnormal signal foci can be seen in the left hippocampus and temporal lobe, exhibiting isointense to low signal on T1W, and hyperintense signal on T2W and FLAIR sequences. There is evident ring-like enhancement on T1C with unclear boundaries, measuring approximately 46*72*65mm. There is surrounding brain parenchymal edema, compression of the lower angle of the left lateral ventricle, and no midline shift.",
    "BraTS-GLI-01337-000": "An irregular abnormal signal focus is visible in the left occipital lobe, displaying low signal on T1-weighted (T1W) imaging with a small amount of high signal, mixed high signal on T2-weighted (T2W) and FLAIR sequences, and significant ring-like enhancement on contrast-enhanced T1 (T1C) imaging. The focus has indistinct boundaries and measures approximately 54*62*81 mm. There is surrounding brain parenchymal edema, and the posterior horn of the left lateral ventricle is compressed. No midline shift is observed.",
    "BraTS-GLI-01340-000": "An irregular abnormal signal focus is seen in the right frontal-parietal lobe, presenting as isointense to hypointense on T1-weighted imaging, hyperintense with mixed signals on T2-weighted and FLAIR sequences, and significant ring-like enhancement on contrast-enhanced T1-weighted imaging (T1C). The focus has ill-defined borders and measures approximately 46*65*43 mm. There is surrounding brain parenchyma edema, but no midline shift is observed.",
    "BraTS-GLI-01345-000": "An irregular abnormal signal focus can be seen in the left temporal lobe, which appears as low signal on T1W with partial high signal, mixed high and low signal on T2W and FLAIR, and significant ring-like enhancement on T1C with ill-defined boundaries, measuring approximately 47*66*53mm. There is a large amount of edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and a slight right shift of the midline structures. In the right parietal lobe, there is a patchy abnormal signal shadow, showing iso signal on T1W, and high signal on T2W and FLAIR, with no obvious enhancement after contrast.",
    "BraTS-GLI-01348-000": "An irregular abnormal signal focus is observed in the left parietal lobe, displaying low signal on T1W with a small amount of high signal, mixed high and low signal on T2W and FLAIR sequences, and marked ring-like enhancement on T1C. The boundary is poorly defined, with dimensions approximately 41*80*56mm. Perilesional brain parenchyma edema is present, and there is no midline shift.",
    "BraTS-GLI-01351-000": "An irregular abnormal signal focus can be seen in the left temporal lobe, presenting as low signal on T1-weighted images with local high signal areas. On T2-weighted and FLAIR images, there are mixed high and low signals. After contrast (T1C), there is obvious ring-like enhancement, and the boundary is not clear, measuring approximately 62*82*69mm. There is a significant amount of edema in the surrounding brain parenchyma. The left lateral ventricle is compressed, and there is a slight deviation of midline structures to the right.",
    "BraTS-GLI-01355-000": "A mass-like abnormal signal is observable in the left temporal lobe. It appears as a slightly hypointense signal on T1W, hyperintense signal on T2W, iso- to hyperintense signal on FLAIR, with uneven enhancement post-contrast (T1C). The mass has well-defined boundaries, measuring approximately 59*81*67mm, with peritumoral edema. There is rightward deviation of midline structures and compression with narrowing of the left lateral ventricle.",
    "BraTS-GLI-01357-000": "An irregular abnormal signal foci can be seen in the right parietal lobe, displaying low signal intensity on T1-weighted images, high signal intensity on T2-weighted images, mixed signal intensity on FLAIR, and significant heterogenous enhancement post contrast with a 'ring-like' appearance on T1C. The boundaries of the lesion are indistinct, measuring approximately 62*72*75 mm. There is substantial surrounding brain parenchymal edema, compression of the posterior horn of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-01358-000": "An irregular abnormal signal focus is observed in the right parieto-occipital lobe, which presents as a mixed signal of hypo- to isointensity with occasional hyperintensity on T1W imaging, mixed high and low signal on T2W and FLAIR sequences, and marked 'ring-like' enhancement on T1C imaging. The lesion has indistinct boundaries and approximately measures 68*99*74 mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a leftward shift of midline structures.",
    "BraTS-GLI-01365-000": "At the junction of the right frontal and parietal lobes, an irregular abnormal signal focus is observed. It presents as iso-signal on T1W, hyperintense on T2W and FLAIR, and demonstrates significant uneven enhancement on T1C. The boundary is ill-defined, with a size of approximately 42*78*41 mm. There is surrounding brain parenchymal edema, but no midline shift.",
    "BraTS-GLI-01377-000": "Irregular abnormal signal foci are seen in bilateral frontal lobes, the genu and body of the corpus callosum, showing isointense to low signal on T1W, and high signal on T2W and FLAIR sequences. There is marked enhancement on T1C. The boundaries are not clear, and the size is approximately 86*82*70 mm. Midline structures show no shift.",
    "BraTS-GLI-01394-000": "Two lesions resembling a round shape can be seen in the left parieto-occipito-temporal lobe, displaying low signal intensity on T1-weighted images and mixed high and low signal on T2-weighted and FLAIR images. After contrast (T1C), there is significant ring-like enhancement, with indistinct boundaries. The approximate size of the lesions is 48*72*64mm. Surrounding brain parenchyma shows edema, but there is no shift of midline structures.",
    "BraTS-GLI-01413-000": "There is an irregular abnormal signal focus in the right parietal lobe and the splenium of the corpus callosum, presenting as a hypointense signal on T1-weighted images and hyperintense on T2-weighted and FLAIR images. There is marked heterogeneous enhancement on T1 post-contrast series. The boundary is not clear, and the lesion crosses the midline along the splenium of the corpus callosum, measuring approximately 100*87*83 mm. There is extensive edema in the surrounding brain parenchyma. The posterior horn of the right lateral ventricle is compressed, and there is a slight leftward deviation of midline structures.",
    "BraTS-GLI-01431-000": "A mass-like abnormal signal is visible in the right thalamus, exhibiting slightly low signal on T1-weighted images, slightly high signal on T2-weighted images and FLAIR images, and uneven enhancement on T1 contrast. The lesion has a clear boundary and measures approximately 55*53*49 mm with peritumoral edema. There is a leftward shift of the midline structures.",
    "BraTS-GLI-01436-000": "An approximately round-shaped abnormal signal focus is visible on the left frontoinsula and basal ganglia region, demonstrating low signal on T1-weighted images with some high signal, mixed high and low signal on T2-weighted and FLAIR images, and partial, patchy enhancement on T1 contrast-enhanced images. The lesion size is approximately 46*61*57mm. There is extensive edema in the surrounding brain parenchyma with compression of the right lateral ventricle and a slight shift of the midline structures to the left.",
    "BraTS-GLI-01437-000": "An abnormal round-like signal lesion is observed in the left frontal lobe, characterized as isointense to hypointense on T1-weighted imaging, hyperintense on T2-weighted and FLAIR sequences, with slight heterogeneous enhancement post-contrast on T1, and poorly defined borders. The lesion measures approximately 49*64*50mm. There is surrounding brain parenchymal edema, and no midline shift is observed.",
    "BraTS-GLI-01439-000": "An irregular abnormal signal focus is seen in the right temporal lobe, displaying hypo-signal on T1WI, hyper-signal on T2WI, and hyper-signal on FLAIR sequence. Post-contrast T1-weighted images show uneven slight enhancement. The lesion has ill-defined borders and measures approximately 35*54*28mm. There is surrounding brain parenchymal edema, but the midline structures are not shifted.",
    "BraTS-GLI-01440-000": "An irregular abnormal signal focus is observed in the left frontal lobe, with mixed T1W hypointense and a few hyperintense signals. T2W and FLAIR sequences exhibit mixed high and low signals. There is ring-like enhancement on T1C, with ill-defined borders. The focus measures approximately 40*50*45 mm. There is surrounding cerebral edema, mild compression of the anterior horn of the left lateral ventricle, and a slight rightward shift of midline structures.",
    "BraTS-GLI-01447-000": "On the right parietal lobe, there is an irregular abnormal signal focus, demonstrating iso- to low signal on T1-weighted images, heterogeneous high signal on T2-weighted and FLAIR sequences, and marked ring-like enhancement on T1 post-contrast (T1C), with indistinct boundaries, measuring approximately 50*72*62mm. Extensive edema is noted in the surrounding brain parenchyma, with compression on the posterior horn of the right lateral ventricle. No midline shift is observed.",
    "BraTS-GLI-01452-000": "A lesion resembling a round shape can be seen in the left parietal lobe, which appears isointense to hypointense on T1-weighted images and shows mixed hyperintense and hypointense signals on T2-weighted and FLAIR sequences, with a prominent ring-like enhancement on T1 post-contrast imaging. The lesion has indistinct borders, measuring approximately 53*50*53mm. There is cerebral edema in the surrounding brain parenchyma, with no midline shift observed.",
    "BraTS-GLI-01456-000": "An irregular abnormal signal focus is observed in the right temporal lobe, presenting as low signal intensity on T1W and high signal intensity on T2W and FLAIR sequences. Post-contrast T1W (T1C) shows marked ring-like enhancement. The boundary is unclear, measuring approximately 60 x 82 x 61 mm. There is extensive edema in the surrounding brain parenchyma, compression of the right lateral ventricle, and a leftward shift of the midline structures.",
    "BraTS-GLI-01457-000": "An irregular abnormal signal focus is observed in the left temporal lobe, displaying low signal intensity on T1-weighted images and mixed high signal intensity on T2-weighted and FLAIR sequences. Post-contrast administration shows patchy and ring-like enhancement with unclear boundaries, measuring approximately 53*76*59 mm. Extensive edema is present in the surrounding brain parenchyma, with slight compression of the left lateral ventricle and mild deviation of midline structures to the right.",
    "BraTS-GLI-01459-000": "An irregular abnormal signal focus is seen in the left temporal lobe, exhibiting low signal on T1-weighted imaging, high signal on T2-weighted and FLAIR sequences, and significant ring-like enhancement on post-contrast T1-weighted imaging, with ill-defined boundaries, measuring approximately 40*42*40 mm. There is extensive pericerebral edema, without shift of midline structures.",
    "BraTS-GLI-01476-000": "In the right basal ganglia and insular region, an approximately round-shaped abnormal signal focus is observed. It is hypo-intense on T1-weighted images with a slight hyperintense signal, hyperintense on T2-weighted and FLAIR images. After contrast (T1C), there is partial patchy enhancement with unclear boundaries. The dimensions of the lesion are approximately 42*61*62 mm. There is surrounding brain parenchyma edema, compression of the right lateral ventricle, and a mild shift of the midline structures to the left.",
    "BraTS-GLI-01479-000": "A mass-like abnormal signal is visible in the right frontal lobe, presenting as isointense to hypointense on T1W, mixed signal intensity on T2W, mixed signal intensity on FLAIR, with non-uniform enhancement post-contrast (T1C). The margin is indistinct. The size is approximately 92*86*82 mm. There is slight surrounding edema. The midline structures are deviated to the left, and the bilateral lateral ventricles are compressed and narrowed.",
    "BraTS-GLI-01480-000": "An irregular abnormal signal focus is observed in the left temporal lobe and hippocampal region, presenting as isointense signal on T1-weighted imaging, mixed high and low signal on T2-weighted and FLAIR sequences, with localized patchy enhancement on T1 post-contrast imaging. The boundaries are ill-defined, and the size is approximately 54*74*45 mm. There is extensive edema in the surrounding brain parenchyma, mild compression of the left lateral ventricle, and no shift in midline structures.",
    "BraTS-GLI-01482-000": "A patchy abnormal signal focus is observed in the left parietal lobe, exhibiting as low signal on T1W, high signal on T2W, and high signal on FLAIR sequences, with patchy and ring-like enhancement on T1C. The lesion has indistinct boundaries and measures approximately 53*68*71 mm. There is surrounding brain parenchymal edema, with no midline shift.",
    "BraTS-GLI-01486-000": "An irregular abnormal signal focus is seen in the right basal ganglia region and the insula, presenting as low signal on T1-weighted imaging and high signal on T2-weighted and FLAIR sequences, with no significant enhancement on T1 post-contrast. The margins are not clearly defined, with approximate dimensions of 69*93*83 mm. There is surrounding brain parenchymal edema, compression of the right lateral ventricle, and mild leftward shift of the midline structures.",
    "BraTS-GLI-01494-000": "A lesion with a quasi-circular abnormal signal is visible in the right frontal operculum, presenting as low signal on T1-weighted imaging with some high signal, mixed high and low signal on T2-weighted and FLAIR imaging, and uneven enhancement on T1-weighted imaging with contrast (T1C). The lesion has ill-defined borders and measures approximately 76*104*82 mm. There is significant surrounding edema in the brain parenchyma, with compression of the right lateral ventricle and a leftward shift of midline structures.",
    "BraTS-GLI-01497-000": "An irregular abnormal signal focus is visible in the right temporal-occipital lobe, exhibiting low signal on T1W with localized high signals, mixed high and low signal on T2W and FLAIR, nodular and ring-like enhancement on T1C, with indistinct boundaries, measuring approximately 55*79*56mm. There is extensive edema of the surrounding brain parenchyma, compression of the posterior horn of the right lateral ventricle, and a slight left deviation of midline structures.",
    "BraTS-GLI-01502-000": "An abnormal signal focus is observed in the left parietal lobe, presenting as hypointense on T1-weighted images, hyperintense on T2-weighted images, and hyperintense on FLAIR images. There is no significant enhancement after contrast (T1C) administration. The boundaries are indistinct, with dimensions of approximately 63*69*78mm. There is no midline shift.",
    "BraTS-GLI-01503-000": "An irregular abnormal signal lesion is visible in the right frontal lobe, presenting with isointense signal on T1-weighted imaging, hyperintense signal on T2-weighted and FLAIR imaging, and patchy enhancement on T1 post-contrast. The boundaries are ill-defined, with the lesion measuring approximately 48*76*57mm. There is extensive edema in the surrounding brain parenchyma. The anterior horn of the right lateral ventricle is compressed, with a slight leftward deviation of midline structures.",
    "BraTS-GLI-01518-000": "An irregular abnormal signal focus is observed in the right frontal parietal lobe, which presents as iso- to hypointense on T1W images, hyperintense on T2W images, and mixed high and low signals on FLAIR images. After contrast administration, there is partial patchy enhancement. The boundary is indistinct, and measures approximately 73*99*76mm. Extensive cerebral edema is present in the surrounding brain parenchyma. The right lateral ventricle is compressed, with a shift of midline structures to the left.",
    "BraTS-GLI-01519-000": "A mass-like abnormal signal is observed in the left parietal lobe, presenting as slightly hypointense on T1-weighted images, slightly hyperintense on T2-weighted images, and slightly hyperintense on FLAIR. Post-contrast T1 images show uneven enhancement. The lesion has clear boundaries and measures approximately 51*51*51 mm, with surrounding edema. No midline shift is observed.",
    "BraTS-GLI-01524-000": "An irregular abnormal signal focus is seen on the right temporal lobe, displaying mixed iso- to hypointense signal on T1-weighted imaging, hyperintense signal on T2-weighted imaging, mixed hyperintense and hypointense signal on FLAIR imaging, with indistinct enhancement on T1-weighted imaging with contrast. The lesion has poorly defined borders and measures approximately 60*86*59 mm. Surrounding brain parenchyma shows edema, with compression of the right lateral ventricle and a leftward shift of midline structures.",
    "BraTS-GLI-01535-000": "Irregular abnormal signal foci can be seen in the left frontal-opercular-temporal lobe, presenting as low signal on T1-weighted imaging (T1W), high signal on T2-weighted imaging (T2W) and Fluid Attenuated Inversion Recovery (FLAIR), with marked ring-like enhancement on contrast (T1C). The boundaries are not clearly defined, with an approximate size of 55*62*54 mm. Perilesional brain parenchyma shows edema, without any shift of midline structures.",
    "BraTS-GLI-01661-000": "In the left temporal lobe and hippocampus, there is an irregular lesion with abnormal signal intensity, presenting as low signal with some high signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR sequences, and markedly heterogeneous enhancement on T1 contrast-enhanced images. The lesion has poorly defined borders and measures approximately 74*87*78 mm. There is extensive edema in the surrounding brain parenchyma, compression of the left lateral ventricle, and a shift of midline structures to the right.",
    "BraTS-MEN-00017-000": "A mass-like abnormal signal is observed in the left cerebellopontine angle region, displaying isointense signal on T1-weighted images (T1W), slightly hyperintense signal on T2-weighted images (T2W), hyperintense signal on Fluid Attenuated Inversion Recovery (FLAIR) sequence, and showing significant enhancement post-contrast (T1C). The size of the lesion is approximately 33*44*39 mm. No midline shift is seen.",
    "BraTS-MEN-00018-000": "A mass-like abnormal signal focus can be seen in the right frontal lobe, showing a slightly low signal on T1W, slightly high signal on T2W, high signal on FLAIR, with evident enhancement on T1C, however, the enhancement is not uniform. The size is approximately 80*124*88mm. Surrounding the lesion, a cerebrospinal fluid cleft and a large area of non-enhancing edema can be seen. The right lateral ventricle is compressed. There is a slight leftward shift of midline structures.",
    "BraTS-MEN-00020-000": "A small patchy abnormal signal shadow is visible on the right side of the longitudinal fissure of the brain, displaying isointense on T1-weighted imaging (T1W), slightly hyperintense on T2-weighted imaging (T2W), hyperintense on Fluid-attenuated inversion recovery (FLAIR), and shows obvious enhancement on T1 post-contrast (T1C). The dimensions are approximately 8*12*11 mm. There is no shift of midline structures.",
    "BraTS-MEN-00021-000": "A mass-like abnormal signal shadow is observed beneath the right frontal cranial plate, showing an isointense signal on T1-weighted images, slightly hyperintense on T2-weighted images, and slightly hyperintense on FLAIR images. After contrast enhancement with T1, there is moderate enhancement. The size of the lesion is approximately 69*82*66 mm. The adjacent brain parenchyma and the right lateral ventricle are compressed, with mild edema in the brain parenchyma. The midline structures are shifted to the left.",
    "BraTS-MEN-00023-000": "A mass-like cystic-solid occupying lesion is observed in the right frontal-parietal lobe, with an irregular shape. It appears as an iso- to hypointense signal on T1-weighted images, and presents with a mixed high and low signal on T2-weighted and FLAIR images. There is surrounding edema, and the solid part of the lesion shows significant enhancement on T1-weighted post-contrast images. The size of the lesion is approximately 93*100*70 mm. There is no midline shift.",
    "BraTS-MEN-00028-000": "Multiple clustered abnormal signal shadows are visible beneath the left frontal parietal region, under the right temporal cranial plate, around the left lateral ventricle, and in the posterior longitudinal fissure of the cerebrum, presenting as isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, and slightly hyperintense on FLAIR imaging. Following administration of contrast (T1C), there is marked enhancement. The size of the lesions is approximately 29*40*30 mm, with some peritumoral edema. No midline shift is observed.",
    "BraTS-MEN-00034-000": "A mass-like abnormal signal is observed at the cerebral falx of the anterior cranial fossa. The lesion has a clear boundary and measures approximately 59*57*59 mm. It shows iso- to low signal on T1-weighted imaging, high signal on T2-weighted imaging, and high signal on FLAIR sequences. Perilesional edema is visible. The lesion shows significant enhancement post-contrast (T1C). There is no midline shift.",
    "BraTS-MEN-00037-000": "A small cluster-like abnormal signal shadow can be seen below the cranial plate of the left frontal temporal region. It presents as isointense on T1-weighted imaging, isointense on T2-weighted imaging, slightly hyperintense on FLAIR imaging, and shows obvious enhancement on T1-weighted imaging post-contrast. The size is approximately 17*18*10 mm. There is no midline shift.",
    "BraTS-MEN-00041-000": "A mass-like abnormal signal focus can be seen under the left frontal bone plate, presenting with slight hypo-intensity on T1W images, slight hyper-intensity on T2W images, and slight hyper-intensity on FLAIR images, with surrounding edema observed. There is obvious enhancement on T1 post-contrast (T1C) images with uneven enhancement, measuring approximately 47*47*58mm. There is no midline shift.",
    "BraTS-MEN-00052-000": "A mass-like abnormal signal shadow can be seen beneath the right frontal-temporal skull plate, presenting with an isointense signal on T1W, an isointense signal on T2W, a hyperintense signal on FLAIR, and marked enhancement on T1 post-contrast. The dimensions are approximately 67*101*73 mm. There is peritumoral edema, with compression and narrowing of the adjacent brain parenchyma and the right lateral ventricle. The midline structures are shifted to the left.",
    "BraTS-MEN-00071-000": "A mass-like abnormal signal is observed in the anterior interhemispheric fissure, presenting with an isointense signal on T1-weighted imaging (T1WI), an isointense signal on T2-weighted imaging (T2WI), a slightly hyperintense signal on Fluid Attenuated Inversion Recovery (FLAIR), and heterogeneous enhancement on T1 post-contrast (T1C) imaging. The dimensions of the abnormality are approximately 106*88*75 mm. There is peritumoral edema, and the frontal horns of both lateral ventricles are compressed and narrowed. The midline structures are slightly shifted to the right.",
    "BraTS-MEN-00074-005": "An abnormal signal nodule is visible on the left side behind the falx cerebri, presenting with isointense signal on T1-weighted images, slightly hyperintense signal at the center and hypointense signal at the edges on T2-weighted images, mixed-signal on FLAIR sequence, and significant enhancement after contrast administration with clear boundaries, measuring approximately 15*13*16 mm. No midline shift is observed.",
    "BraTS-MEN-00074-007": "A mass-like abnormal signal shadow is visible adjacent to the posterior longitudinal fissure pool of the brain, presenting with isointense signal on T1WI, isointense signal on T2WI, slightly hyperintense signal on FLAIR, and significant enhancement on T1C post-contrast, measuring approximately 12*12*15 mm. There is no shift of midline structures.",
    "BraTS-MEN-00075-000": "In the anterior interhemispheric fissure, a mass-like abnormal signal is noted, displaying an isointense signal on T1-weighted imaging (T1W), isointense signal on T2-weighted imaging (T2W), hyperintense signal on Fluid Attenuated Inversion Recovery (FLAIR) sequences, with significant enhancement on T1 post-contrast (T1C) imaging. The size of the mass is approximately 48*56*45 mm with perilesional edema. There is a slight leftward shift of the midline structures.",
    "BraTS-MEN-00093-000": "A mass-like abnormal signal is observed beneath the right cranial vault, demonstrating an isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR images, and significant enhancement on T1-weighted images with contrast. The mass measures approximately 17 x 16 x 20 mm. There is no shift of midline structures.",
    "BraTS-MEN-00102-000": "A mass-like abnormal signal shadow can be seen at the left skull base, presenting with isointense signal on T1-weighted (T1W) imaging, isointense signal on T2-weighted (T2W) imaging, hyperintense signal on FLAIR sequence, and moderate enhancement on T1 post-contrast (T1C) imaging. The size of the lesion is approximately 34*42*38 mm, with adjacent brain parenchyma being compressed. There is no midline shift.",
    "BraTS-MEN-00103-000": "A small clustered abnormal signal shadow is visible in the cerebral fissure, with iso-intense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, slightly hyperintense signal on FLAIR sequence, and significant enhancement on T1-weighted images with contrast, measuring approximately 8*18*18mm. There is no shift of midline structures.",
    "BraTS-MEN-00108-004": "A nodular abnormal signal is observed in the left temporal region with an isointense signal on T1W, an isointense signal on T2W, hyperintense on FLAIR, and shows obvious enhancement post-T1 contrast, measuring approximately 15*23*15mm. No midline shift is noted.",
    "BraTS-MEN-00112-000": "A mass-like abnormal signal is seen in the interhemispheric fissure of the brain, which appears isointense on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR images, and shows obvious enhancement post-contrast administration with dimensions approximately 14*24*22 mm. There is no midline shift.",
    "BraTS-MEN-00131-000": "A mass-like abnormal signal shadow is seen in the anterior interhemispheric fissure, showing iso-signal on T1W, iso-signal on T2W, slightly hyperintense signal on FLAIR, and significant uneven enhancement on T1C. The size is approximately 111*117*95mm, with peritumoral edema. The midline structures are slightly deviated to the left, and the anterior horns of the bilateral lateral ventricles are compressed and narrowed.",
    "BraTS-MEN-00132-000": "A mass-like abnormal signal is visible below the cranial plate in the left frontal area, presenting with an isointense signal on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, and slightly hyperintense on FLAIR imaging. After contrast (T1C), there is marked enhancement, with an approximate size of 19*31*26mm. There is no shift of midline structures.",
    "BraTS-MEN-00136-000": "Small patchy abnormal signal shadows can be observed beneath the skull plate on both sides of the frontal regions, exhibiting isointense signal on T1-weighted imaging, isointense to hypointense signal on T2-weighted imaging and Fluid-Attenuated Inversion Recovery (FLAIR) sequences, with marked enhancement on T1-weighted imaging with contrast (T1C). The size is approximately 14*13*13 mm. There is no shifting of the midline structures.",
    "BraTS-MEN-00138-000": "A patchy abnormal signal is seen at the base of the right middle cranial fossa, displaying isointense signal on T1-weighted and T2-weighted images, slightly hyperintense signal on FLAIR sequence, with significant enhancement of the lesion on T1 post-contrast, measuring approximately 30*42*13 mm. No midline shift is observed.",
    "BraTS-MEN-00150-000": "A mass-like abnormal signal is observed beneath the right parietal bone, showing isointense signal on T1W, slightly hyperintense signal on T2W, slightly hyperintense signal on FLAIR, with marked enhancement on T1C. The dimensions of the lesion are approximately 44*70*62mm. There is peritumoral edema, and adjacent brain parenchyma is compressed. No midline shift is observed.",
    "BraTS-MEN-00154-000": "A mass-like abnormal signal is observed on the left periventricular area and the cerebellopontine angle region, presenting with isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, and hyperintense signal on FLAIR sequence. Post-contrast T1-weighted images show marked enhancement of the lesion, measuring approximately 24*25*28mm. There is no shift of the midline structures.",
    "BraTS-MEN-00156-000": "Under the right frontal calvarium, a mass-like abnormal signal shadow can be observed, presenting as isointense to low signal on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR, and conspicuously enhancing with T1 contrast. The size of the lesion is approximately 59*114*73mm, with significant edema around the tumor. The right lateral ventricle is compressed and narrowed, and the 'tail sign' of the meninges is visible. There is a slight leftward deviation of midline structures.",
    "BraTS-MEN-00161-000": "A mass-like abnormal signal shadow is seen in the right frontal lobe, appearing as isointense on T1-weighted imaging (T1W), slightly hyperintense on T2-weighted imaging (T2W), hyperintense on FLAIR imaging, with marked enhancement on T1 with contrast (T1C). The dimensions are approximately 76*107*94 mm, with peritumoral edema. There is a leftward shift of midline structures and compression and narrowing of the right lateral ventricle's anterior horn.",
    "BraTS-MEN-00165-000": "A mass-like abnormal signal shadow can be seen beneath the right frontal cranial plate, with T1W isointense signal, T2W isointense signal, FLAIR mixed signal, and significant enhancement on T1C. The dimensions are approximately 66*78*61mm, with peritumoral cystic foci and edema noted. Midline structures are shifted to the left, and the anterior horn of the right lateral ventricle is compressed and narrowed.",
    "BraTS-MEN-00169-000": "A mass-like abnormal signal is observed beneath the cranial plate of the right frontal-temporal region, displaying an isointense signal on T1W sequence, slightly hyperintense on T2W sequence, slightly hyperintense on FLAIR sequence, with marked enhancement on T1C. The mass measures approximately 50*95*57 mm, with adjacent brain parenchyma showing compression and edema. There is a slight leftward shift of midline structures.",
    "BraTS-MEN-00176-000": "A mass-like abnormal signal is observed below the cranial plate in the frontal lobe. It appears isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, and slightly hyperintense on FLAIR imaging. After administration of T1 contrast (T1C), there is significant enhancement. The size of the lesion is approximately 94*122*79 mm. There is peritumoral edema, and the bilateral lateral ventricles are compressed and narrowed. The midline structures are displaced to the right.",
    "BraTS-MEN-00181-000": "A mass-like abnormal signal is observed below the calvarium in the right parietotemporal region, exhibiting iso-signal on T1WI, slightly hyperintense signal on T2WI, mixed signals on FLAIR, and non-uniform enhancement on T1 with contrast. The approximate dimensions are 61*100*88 mm, with perilesional edema, and a mild compression and narrowing of the right lateral ventricle. No shift in midline structures.",
    "BraTS-MEN-00183-000": "An abnormal signal nodule can be seen at the base of the left middle cranial fossa, exhibiting iso-intense signals on T1W and T2W, slightly hyperintense on FLAIR, and the lesion shows obvious enhancement after T1C contrast administration. The boundary is clear, and the size is approximately 8*13*8 mm. There is no midline shift.",
    "BraTS-MEN-00194-000": "A small, nodular abnormal signal shadow can be seen beneath the left frontal bone plate, showing isointense signal on T1W, isointense signal on T2W, hyperintense signal on FLAIR, and significant enhancement on T1C. The dimensions are approximately 16*18*16mm. There is no midline shift.",
    "BraTS-MEN-00196-000": "There is a mass-like abnormal signal shadow beneath the left cranial vault, showing isointensity on T1-weighted imaging, slightly hyperintensity on T2-weighted imaging, and slightly hyperintensity on FLAIR imaging. After contrast (T1C), marked enhancement is noted. The size of the lesion is approximately 67*78*71 mm. There is perilesional edema, compression and narrowing of the posterior horn of the left lateral ventricle, and compression of the adjacent brain parenchyma, with evidence of the dural tail sign. No midline shift is observed.",
    "BraTS-MEN-00199-000": "A small nodule can be observed beneath the left frontal bone plate, exhibiting signal characteristics of isointense on T1-weighted imaging, isointense on T2-weighted imaging, slightly hyperintense on FLAIR sequence, and shows obvious enhancement post T1 contrast. The size is approximately 7x11x9 mm. No midline shift is observed.",
    "BraTS-MEN-00210-000": "A mass-like abnormal signal is observed beneath the skull plate in the right frontal temporal region, exhibiting isointense signal on T1-weighted sequence, isointense signal on T2-weighted sequence, slightly hyperintense signal on FLAIR, and uneven enhancement post-contrast (T1C), measuring approximately 66*84*68 mm, with peritumoral edema. Midline structures are shifted to the left, with compression and narrowing of the right lateral ventricle's anterior horn.",
    "BraTS-MEN-00217-000": "A small patchy area of abnormal signal is visible beneath the calvarium in the left frontal region, showing isointense signal on T1-weighted, T2-weighted, and FLAIR sequences, with significant enhancement on T1 post-contrast, measuring approximately 10x10x10 mm. There is no midline shift.",
    "BraTS-MEN-00225-000": "A small nodular lesion is visible inferior to the skull plate at the left temporal pole, exhibiting isointense signal on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR, and shows significant uniform enhancement with contrast on T1. The lesion has a clear boundary and presents with a meningeal tail sign, measuring approximately 16*26*25mm. No midline shift is observed.",
    "BraTS-MEN-00231-000": "A mass-like abnormal signal shadow can be seen beneath the left parietal bone, presenting with an isointense signal on T1-weighted images, isointense on T2-weighted images, and isointense on FLAIR sequences. It displays non-uniform enhancement upon T1 post-contrast, measuring approximately 101*110*75 mm in size. There is peritumoral edema. The left lateral ventricle is compressed and narrowed. The midline structures are slightly shifted to the right.",
    "BraTS-MEN-00244-000": "A mass-like abnormal signal is visible in the left periventricular and temporal regions, presenting as isointense on T1-weighted imaging, isointense on T2-weighted imaging, hyperintense on FLAIR sequence, and showing marked enhancement on T1 post-contrast imaging, measuring approximately 25*33*22mm. There is no shift of midline structures.",
    "BraTS-MEN-00269-000": "At the junction of the left frontal and parietal bones, beneath the calvarium, there is a mass-like abnormal signal shadow visible, displaying isointense signal on T1-weighted (T1W) and T2-weighted (T2W) images, slightly hyperintense signal on Fluid-attenuated inversion recovery (FLAIR), and marked enhancement on T1 post-contrast (T1C), measuring approximately 32*31*36mm. There is no shift of midline structures.",
    "BraTS-MEN-00270-000": "On the right side of the cerebral falx, there is a mass-like abnormal signal shadow, which presents as isointense on T1W images, isointense on T2W images, slightly hyperintense on FLAIR images, and shows significant enhancement on T1W post-contrast images. Its approximate size is 41*78*58 mm, with peritumoral edema. The midline structures are slightly shifted to the left.",
    "BraTS-MEN-00286-000": "A mass-like abnormal signal shadow is visible adjacent to the falx cerebri in the right frontal lobe, showing low signal on T1W, isointense signal on T2W, slightly hyperintense signal on FLAIR, and mild enhancement on T1C. The lesion has well-defined boundaries, with dimensions of approximately 26*32*17mm. There is no midline shift.",
    "BraTS-MEN-00298-000": "Right parafalcine mass with abnormal signal shadow at the vertex, showing iso- to low signal on T1-weighted images, slightly hyperintense on T2-weighted images, and hyperintense on FLAIR images. The lesion has a clear boundary, with a slight edema band around the edges. It shows obvious enhancement on T1 post-contrast images with uniform enhancement, measuring approximately 31*41*48mm. Additionally, a small nodular lesion is observed beneath the right frontal cranial plate, presenting with iso signal on T1-weighted and T2-weighted images, and hyperintense on FLAIR images. It shows a clear boundary and marked enhancement after contrast administration, measuring approximately 31*41*48mm. No midline shift is seen.",
    "BraTS-MEN-00299-000": "A mass-like abnormal signal is observed beneath the left occipital calvarium, presenting as isointense on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR sequences, and showing marked enhancement on T1 post-contrast images, measuring approximately 26*27*30mm. No midline shift is present, with mild compression of the left occipital lobe brain parenchyma.",
    "BraTS-MEN-00303-000": "A mass-like abnormal signal shadow is seen beneath the skull plate in the left frontal-parietal-temporal region, exhibiting an isointense signal on T1-weighted images, a slightly hyperintense signal on T2-weighted images, a hyperintense signal on FLAIR sequences, and significant enhancement post-contrast administration on T1-weighted images, with dimensions approximately 61*82*84mm. Peritumoral edema is present, and the left lateral ventricle is compressed and narrowed. There is a slight rightward shift of the midline structures.",
    "BraTS-MEN-00308-000": "A small cluster-like abnormal signal shadow can be observed under the right parietal bone, presenting as isointense on T1W images, slightly hyperintense on T2W images, and slightly hyperintense on FLAIR images. There is marked enhancement with contrast on T1C images, measuring approximately 12*11*11mm. There is no shift of midline structures.",
    "BraTS-MEN-00318-000": "A small cluster of abnormal signal shadow is visible beneath the left occipital bone plate, exhibiting isointense signal on T1W, isointense signal on T2W, isointense signal on FLAIR, and mildly enhanced on T1C. The size is approximately 12*10*14mm. No shift of the midline structures.",
    "BraTS-MEN-00327-000": "A mass-like abnormal signal is observed in the right temporal lobe, presenting as isointense on T1-weighted images and slightly hyperintense on T2-weighted and FLAIR sequences. After contrast administration (T1C), there is mild enhancement. The lesion measures approximately 65*111*67mm and is associated with perilesional edema. There is a leftward shift of midline structures, and the right lateral ventricle is compressed and narrowed.",
    "BraTS-MEN-00330-000": "A mass-like abnormal signal is visible at the falx cerebri in the anterior cranial fossa, crossing the midline, exhibiting low signal intensity on T1-weighted images, slightly high signal intensity on T2-weighted images, and high signal intensity on FLAIR sequence. The lesion has a clear boundary, and shows marked enhancement on T1 post-contrast sequence, measuring approximately 36*43*26 mm. There is no shift of midline structures.",
    "BraTS-MEN-00335-000": "A mass-like abnormal signal shadow can be seen beneath the skull plate in the right occipital region, exhibiting iso-intense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR images, and uneven enhancement on T1-weighted images with contrast, measuring approximately 30*38*39mm, with light edema around the tumor. There is no shift in the midline structures.",
    "BraTS-MEN-00342-000": "A mass-like abnormal signal shadow is visible adjacent to the falx cerebri on the right frontal parietal region, exhibiting isointense signal on T1-weighted images (T1W), mixed signal on T2-weighted images (T2W) and Fluid-Attenuated Inversion Recovery (FLAIR) sequences. Post-contrast enhancement shows uneven enhancement of the lesion with a non-enhanced small area in the center, approximately 40*42*41 mm in size; An abnormal signal nodule is also visible adjacent to the falx cerebri in the right frontal region, presenting isointense signals on T1W, T2W and slightly hyperintense signal on FLAIR. Post-contrast enhancement shows significant uniform enhancement. No midline shift is observed.",
    "BraTS-MEN-00346-000": "A mass-like abnormal signal shadow is observed in the anterior longitudinal fissure of the brain, displaying isointense signal on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR, with marked enhancement on T1-weighted images with contrast (T1C), with approximate dimensions of 77*69*66mm. Surrounding edema is present as well as compression of the anterior horns of the lateral ventricles on both sides. There is a shift of midline structures to the right.",
    "BraTS-MEN-00349-000": "A mass-like abnormal signal is observed in the left cranial base, presenting an isointense signal on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, and slightly hyperintense on FLAIR. There is moderate enhancement post-contrast on T1-weighted imaging. The mass measures approximately 46*39*35 mm, causing compression and mild edema on the left cerebellar hemisphere. No midline shift is observed.",
    "BraTS-MEN-00353-000": "A mass-like abnormal signal is observed in the right frontal lobe, exhibiting isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, and isointense signal on FLAIR. After contrast administration, the lesion shows uneven enhancement, measuring approximately 78*97*84 mm in size, with marked surrounding edema. The midline structures are shifted to the left, and the frontal horns of both lateral ventricles are compressed.",
    "BraTS-MEN-00357-000": "A small patchy area of abnormal signal is visible below the skull plate on the left frontal part, displaying isointense on T1-weighted imaging, isointense on T2-weighted imaging, hyperintense on FLAIR, and demonstrates significant enhancement on contrast-enhanced T1-weighted imaging, measuring approximately 12*15*11 mm. There is no displacement of midline structures.",
    "BraTS-MEN-00367-000": "A mass-like abnormal signal is visible adjacent to the superior sagittal sinus above the posterior cerebral longitudinal fissure, showing an isointense signal on T1W, slightly hyperintense on T2W, slightly hyperintense on FLAIR, and a marked enhancement on T1C with a size of approximately 23*31*27 mm. The midline structures are not displaced, and there is mild compression of brain parenchyma in the left parieto-occipital lobe.",
    "BraTS-MEN-00369-000": "A mass-like abnormal signal shadow can be seen beneath the skull plate in the right frontal-temporal region, showing isointense on T1W images, slightly hyperintense on T2W images, hyperintense on FLAIR images, and significant enhancement on T1C images. The size is approximately 49*55*48 mm with peritumoral cystic foci and edema. There is mild leftward deviation of the midline structures.",
    "BraTS-MEN-00380-000": "A mass-like abnormal signal intensity is observed adjacent to the falx cerebri in the left parietal region, presenting as isointense to low signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, hyperintense signal on FLAIR sequence, and exhibits significant enhancement on T1 post-contrast imaging. The size of the lesion is approximately 26*29*32 mm. No midline shift is noted.",
    "BraTS-MEN-00381-000": "Mass-like abnormal signals are visible in the bilateral cerebellopontine angle region, presenting with isointense signal on T1W images, isointense signal on T2W images, slightly hyperintense signal on FLAIR images, and markedly inhomogeneous enhancement on T1C images. The lesion on the left side is larger, approximately 46*51*39mm in size, with peritumoral edema. There is no shift of midline structures.",
    "BraTS-MEN-00382-000": "A mass-like abnormal signal is observed beneath the left frontal bone, showing isointensity on T1-weighted imaging, isointensity on T2-weighted imaging, slightly hyperintense on FLAIR, and significant enhancement on T1 post-contrast. The size of the lesion is approximately 53*62*68 mm, with surrounding edema. The midline structures are slightly deviated to the right.",
    "BraTS-MEN-00405-000": "A mass with abnormal signal is present in the left cerebellopontine angle region, displaying isointense on T1W images, mixed signal intensity on T2W and FLAIR images, and showing uneven enhancement post-contrast with gadolinium on T1C images. The mass measures approximately 74 * 61 * 62 mm and is exerting pressure on the adjacent brain tissue and the fourth ventricle, accompanied by peritumoral edema. There is no midline shift.",
    "BraTS-MEN-00415-000": "A mass of abnormal signal shadow can be seen under the left frontal cranial plate, with an irregular shape, partially crossing the midline, displaying isointense signal on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, slightly hyperintense on FLAIR sequence imaging. Around the lesion, a large area of edema is visible, and the lesion shows evident, uneven enhancement on T1C imaging. The adjacent meninges and falx cerebri appear thickened, with approximate dimensions of 77*90*74mm. The left lateral ventricle is compressed with a rightward shift of midline structures.",
    "BraTS-MEN-00416-000": "A mass-like abnormal signal shadow is visible beneath the skull plate of the right temporal region, showing T1W isointense signal, slightly hyperintense on T2W, slightly hyperintense on FLAIR, with marked enhancement on T1C. The size of the lesion is approximately 41*59*43 mm, with perilesional edema, and compression and narrowing of the right lateral ventricle. The midline structures are mildly deviated to the left.",
    "BraTS-MEN-00423-000": "A small nodule is visible adjacent to the falx cerebri at the junction of the left frontal and parietal lobes, showing isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR, and significant enhancement on T1 post-contrast images. The nodule has a clear boundary, measuring approximately 10*14*20 mm. There is no midline shift.",
    "BraTS-MEN-00425-000": "A mass-like abnormal signal shadow is visible beneath the cranial plate of the right frontal part, with dimensions approximately 90*110*85 mm. It exhibits an isointense signal on T1-weighted imaging and T2-weighted imaging, a high signal on FLAIR, and marked enhancement on T1 post-contrast. There is significant peritumoral edema, and the bilateral lateral ventricles are compressed and narrowed. Midline structures are displaced to the left.",
    "BraTS-MEN-00437-000": "A mass-like abnormal signal is observed beneath the skull plate of the right temporal region, presenting as isointense on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR sequences, and demonstrating significant enhancement post-T1 contrast, measuring approximately 11*14*15 mm. There is no midline shift.",
    "BraTS-MEN-00438-000": "A mass-like abnormal signal is observed on the right side of the falx cerebri, showing isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, slightly hyperintense on FLAIR, and moderate enhancement on T1 post-contrast. The size is approximately 52*69*57mm, with peritumoral edema. There is a slight leftward shift of the midline structures.",
    "BraTS-MEN-00451-000": "A small lesion with an abnormal signal is visible near the large foramen of the occipital bone on the right side of the posterior cranial fossa, presenting as isointense on T1W, and slightly hyperintense on T2W and FLAIR sequences. After enhancement, there is obvious strengthening with dimensions of approximately 25*34*26mm; the medulla oblongata shows an abnormal signal, presenting as hypointense on T1W and hyperintense on T2W and FLAIR sequences, with no obvious enhancement after contrast. The midline structures are not displaced.",
    "BraTS-MEN-00465-000": "A mass-like abnormal signal shadow is visible in the right frontal temporal lobe, showing isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, and hyperintense signal on FLAIR. After administration of contrast (T1C), there is marked enhancement of the lesion, which measures approximately 62*89*81mm. Peritumoral edema is present, and the right lateral ventricle is compressed and narrowed. There is a slight leftward shift of the midline structures.",
    "BraTS-MEN-00467-000": "A small patchy area of abnormal signal is noted in the right frontal lobe, exhibiting iso-signal on T1W sequence, slightly hyperintense on T2W sequence, slightly hyperintense on FLAIR sequence, with significant enhancement on T1C, measuring approximately 33*17*21mm. There is no midline shift.",
    "BraTS-MEN-00468-000": "A mass-like abnormal signal is observed beneath the calvaria of the left temporal-occipital region, displaying isointense signals on T1W and T2W sequences, and hyperintense signal on FLAIR sequence. Within the center of the lesion, there is a small area that exhibits low signal on T1W and high signal on T2W. A large area of edema signal is present around the lesion. Post-contrast enhancement is uneven, with the solid portion of the lesion showing marked enhancement, measuring approximately 43*55*51 mm. There is no shift of midline structures.",
    "BraTS-MEN-00478-000": "An abnormal signal nodule is observed beneath the skull plate in the left frontal region, presenting with isointense signals on T1W and T2W sequences, slightly hyperintense on FLAIR, and showing marked enhancement on T1C, with dimensions approximately 11*14*11mm. No midline shift is detected.",
    "BraTS-MEN-00491-000": "In the anterior interhemispheric fissure, a mass-like abnormal signal shadow is seen, which presents as isointense on T1-weighted imaging, isointense on T2-weighted imaging, slightly hyperintense on FLAIR, and shows significant enhancement post-contrast administration with dimensions of about 63*48*37 mm. There is perilesional edema, and the adjacent brain parenchyma is mildly compressed. There is no midline shift.",
    "BraTS-MEN-00497-000": "A patchy abnormal signal is visible on the right side of the cerebellar tentorium, presenting as an isointense or hypointense signal on T1W, a mixed high and low signal on T2W, a mixed high and low signal on FLAIR, and non-uniform enhancement on T1C. The size of the lesion is approximately 52*81*34mm. There is no shift in midline structures.",
    "BraTS-MEN-00511-000": "A mass-like abnormal signal is seen adjacent to the falx cerebri on the right frontal region, displaying isointense signal on T1-weighted (T1W) images and slightly hyperintense signal on T2-weighted (T2W) and FLAIR sequences. Surrounding edema is observed, with compression of the adjacent brain tissue. After contrast administration (T1C), the lesion exhibits marked but inhomogeneous enhancement, measuring approximately 43*55*52 mm. There is no midline shift detected.",
    "BraTS-MEN-00512-000": "A mass-like abnormal signal shadow can be seen below the skull plate of the left frontal temporal region, presenting as isointense on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR images, and exhibiting uneven enhancement on T1-weighted images with contrast. The approximate size of the lesion is 58*102*84 mm, with surrounding edema. The right lateral ventricle is compressed and narrowed. There is a slight deviation of the midline structures to the right.",
    "BraTS-MEN-00523-000": "On the left side, around the circumpool and in the pontine-cerebellar angle region, a mass-like abnormal signal is visible. It presents with an isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, hyperintense signal on FLAIR, and mild enhancement on T1-weighted imaging with contrast. The dimensions are approximately 43*52*44 mm, with surrounding edema. There is no midline shift. The brainstem and the left cerebellar hemisphere are compressed.",
    "BraTS-MEN-00530-000": "An abnormal signal nodule shadow is visible adjacent to the falx cerebri in the right frontal lobe, with a clear boundary, showing iso-signal on T1W, iso-signal on T2W, and high signal on FLAIR. T1C exhibits obvious enhancement. The size of the lesion is approximately 13*16*16 mm. There is no midline shift.",
    "BraTS-MEN-00534-000": "A small cluster-like abnormal signal shadow is observed in the suprasellar region, presenting with iso-signal on T1W, iso-signal on T2W, iso-signal on FLAIR, and significant enhancement on T1C. The size is approximately 20*15*12mm. There is no shift of midline structures.",
    "BraTS-MEN-00540-000": "Mass-like abnormal signals are observed under the left frontal-temporal lobes and the right temporal part of the cranial plate. The signals are iso-intense on T1-weighted images and T2-weighted images, slightly hyperintense on FLAIR sequences, and show significant enhancement on T1-weighted images with contrast (T1C). The approximate size of the lesion is 81*103*78 mm. Surrounding the left lesion, there is peritumoral edema and cystic degeneration. The midline structures are shifted to the right, and the left lateral ventricle is compressed and narrowed.",
    "BraTS-MEN-00547-000": "A mass-like abnormal signal shadow can be seen beneath the calvaria in the left frontotemporal region, showing isointense signal on T1W, isointense signal on T2W, and high signal on FLAIR. There is obvious enhancement with T1C. The size of the lesion is approximately 21*24*22 mm. There is a mild rightward deviation of midline structures.",
    "BraTS-MEN-00553-000": "A mass-like abnormal signal is observed in the right temporal lobe, presenting as an isointense signal on T1-weighted imaging, hypointense on T2-weighted imaging, hypointense on FLAIR, and demonstrates significant enhancement post-contrast administration with approximate dimensions of 30*41*34mm, accompanied by perilesional edema. There is no midline shift.",
    "BraTS-MEN-00555-000": "A small nodule can be seen beneath the right frontal bone plate, displaying iso-intense signal on T1W and T2W sequences, slightly hyperintense on FLAIR, and significantly enhanced on T1 post-contrast (T1C), with clear boundaries, measuring approximately 11*12*7 mm. There is no shift in midline structures.",
    "BraTS-MEN-00566-000": "A mass-like abnormal signal shadow is visible beneath the right parietal calvarium, presenting an isointense signal on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, hyperintense on FLAIR imaging, and showing marked enhancement after T1 contrast. The approximate size of the lesion is 48x54x63mm, with peritumoral edema. There is no midline shift.",
    "BraTS-MEN-00583-000": "An abnormal signal nodule shadow can be seen at the base of the left anterior cranial fossa, displaying iso-signal on T1W, T2W sequences, slightly hyperintense on FLAIR, and significantly enhanced on T1C, with a clear boundary, measuring approximately 14*16*15mm. There is no shift in midline structures.",
    "BraTS-MEN-00594-000": "A mass-like abnormal signal is observed beneath the left frontal cranial plate, presenting with iso-signal intensity on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR images, and significant enhancement on T1-weighted images with contrast. The size is approximately 14*12*13mm. There is no displacement of midline structures.",
    "BraTS-MEN-00601-000": "Beneath the left parietal bone and on the right temporal side, a mass-like abnormal signal shadow is visible, which shows isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, hyperintense signal on FLAIR, and marked enhancement on T1 post-contrast imaging, approximately 61*77*67mm in size. There is cerebral edema around the tumor at the left parietal top. The midline structures are slightly shifted to the right.",
    "BraTS-MEN-00606-000": "Underneath the left parietal bone, a mass-like abnormal signal shadow can be seen. It presents with an isointense signal on T1W, slightly hyperintense on T2W, slightly hyperintense on FLAIR, and shows significant enhancement post-contrast (T1C), along with a dural tail sign. The size is approximately 19*22*24 mm. There is no midline shift.",
    "BraTS-MEN-00608-000": "Bilateral mass-like abnormal signals are observed adjacent to the falx cerebri in the frontal lobes. These lesions appear dumbbell-shaped, crossing the midline, showing iso- or low signal intensity on T1W, slightly high signal intensity on T2W and FLAIR. The lesions demonstrate obvious enhancement post-contrast (T1C), with the enhancement being uniform. The approximate size of the lesion is 69*53*59mm. There is no midline shift.",
    "BraTS-MEN-00619-000": "A mass-like abnormal signal is observed beneath the right frontal cranial plate, which shows isointense signal on T1W, isointense signal on T2W, hyperintense signal on FLAIR, and significant enhancement on T1C, measuring approximately in 31*39*32 millimeters. The midline structures demonstrate a leftward deviation without displacement, and the right frontal lobe parenchyma is compressed.",
    "BraTS-MEN-00621-000": "A mass-like abnormal signal is visible in the anterior interhemispheric fissure of the brain, demonstrating iso signal on T1-weighted imaging (T1W), iso signal on T2-weighted imaging (T2W), slightly hyperintense signal on Fluid-Attenuated Inversion Recovery (FLAIR) sequences, and inhomogeneous enhancement on post-contrast T1 imaging (T1C). The approximate size of the lesion is 114*96*75 mm, with perilesional edema observed. There is a rightward shift of the midline structures.",
    "BraTS-MEN-00622-000": "Under the left parietal bone and in the left frontal-temporal region, a mass-like abnormal signal shadow is observed, presenting with iso-signal on T1W imaging, slightly hyperintense signal on T2W imaging, and hyperintense signal on FLAIR imaging. The lesion shows significant enhancement on T1W imaging post-contrast (T1C) with approximate dimensions of 21*24*21 mm. There is no shift of midline structures.",
    "BraTS-MEN-00625-000": "A mass-like abnormal signal is visible in the left frontal region, showing iso to low signal on T1-weighted images, mixed high and low signal on T2-weighted and FLAIR sequences, with marked and uneven enhancement on contrast-enhanced T1-weighted images. There is a cerebrospinal fluid cleft and edema band visible around the edge of the lesion, with approximate dimensions of 54*62*63mm. There is no shift in midline structures.",
    "BraTS-MEN-00630-000": "At the midline of the anterior cranial fossa, there is a mass-like abnormal signal focus that is low signal on T1W, slightly high signal on T2W, high signal on FLAIR, and shows obvious enhancement on contrast-enhanced T1-weighted images (T1C). Surrounding the lesion, there is a non-enhanced edematous band. The dimensions of the lesion are approximately 88*70*67 mm. There is no shift of the midline structures.",
    "BraTS-MEN-00636-000": "A mass-like abnormal signal is seen below the skull plate of the right frontal region, which presents with isointense signal on T1-weighted imaging (T1W), isointense signal on T2-weighted imaging (T2W), and hyperintense signal on Fluid-attenuated inversion recovery (FLAIR). There is uneven mild enhancement post-contrast (T1C) with approximate dimensions of 60*61*60 mm. There is mild edema around the tumor, and adjacent brain parenchyma is compressed. The midline structures are shifted to the left.",
    "BraTS-MEN-00637-000": "A mass-like abnormal signal is seen in the left cerebellopontine angle region, which appears isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, hyperintense on FLAIR, and demonstrates mild enhancement on T1 post-contrast. The size is approximately 20*21*20 mm. There is no shift of midline structures.",
    "BraTS-MEN-00648-000": "A small nodular shadow can be seen beneath the cranial plate of the left frontal lobe, presenting with isointense signal on T1-weighted and T2-weighted imaging, slightly hyperintense on FLAIR imaging, and significant enhancement on T1 post-contrast imaging. The nodule has a clear boundary and measures approximately 11*13*6 mm. There is no midline shift.",
    "BraTS-MEN-00650-000": "A small mass-like abnormal signal is visible beneath the skull plate in the right frontal region, presenting as isointense on T1W, isointense on T2W, slightly hyperintense on FLAIR, with marked enhancement on T1C, measuring approximately 13*12*13mm. There is no shift of midline structures.",
    "BraTS-MEN-00658-000": "A mass-like abnormal signal is seen in the right cerebellopontine angle region, which appears isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, hyperintense on FLAIR sequence, and shows significant enhancement on T1-weighted imaging post-contrast administration. The size of the lesion is approximately 19*20*22 mm. There is no shift of midline structures.",
    "BraTS-MEN-00659-000": "A mass-like abnormal signal shadow can be seen beneath the cranial plate of the right frontal region. It presents with an isointense signal on T1W, slightly hyperintense on T2W, hyperintense on FLAIR, and shows obvious enhancement on T1C. The size of the lesion is approximately 36*22*17mm. There is no shift in the midline structures.",
    "BraTS-MEN-00686-000": "A mass-like abnormal signal shadow is seen beneath the skull plate in the right frontal area, which shows iso-intense signal on T1-weighted imaging, and T2-weighted imaging, and iso-intense signal on FLAIR. Moderate enhancement is seen on T1C with the size of approximately 94*122*90 mm. Surrounding edema is noted, and the frontal horn of the lateral ventricles on both sides are compressed and narrowed. There is a left deviation of midline structures.",
    "BraTS-MEN-00688-000": "A mass with abnormal signal intensity is observed in the left middle cranial fossa, presenting with a broad base and irregular shape. It shows isointense on both T1-weighted and T2-weighted images, slightly hyperintense on FLAIR sequence. Extensive edema signal is noted around the lesion. After contrast administration (T1C), there is significant enhancement of the lesion with the presence of the 'tail sign.' The lesion measures approximately 53 x 82 x 55 mm. Compression of the right lateral ventricle is seen, with a mild rightward shift of midline structures.",
    "BraTS-MEN-00696-000": "On the right side of the cerebral longitudinal fissure, there is a mass-like abnormal signal shadow, exhibiting isointense on T1-weighted images, slightly hyperintense on T2-weighted images, and hyperintense on FLAIR. It shows obvious enhancement on T1 with contrast and measures approximately 47*96*58mm, with surrounding edema. No midline shift is observed. Adjacent to the posterior longitudinal fissure of the brain, below the right temporal bone plate, and on the right side of the cerebellar tentorium, there is a mass-like abnormal signal shadow which has a similar signal pattern to the lesion in the cerebral longitudinal fissure and measures approximately the same. No midline shift is observed.",
    "BraTS-MEN-00703-000": "A small cluster-like abnormal signal is observed in the left cerebellopontine angle region, showing isointense on T1-weighted images, isointense on T2-weighted images, slightly hyperintense on FLAIR, and significantly enhanced on T1 post-contrast. The size is approximately 12 x 9 x 11 mm. There is no shift in midline structures.",
    "BraTS-MEN-00706-000": "Bilateral frontoparietal skull plate lesions are visible with mass-like abnormal signals, showing isointense signals on T1WI, isointense signals on T2WI, slightly hyperintense signals on FLAIR, and significantly enhanced after T1 contrast, measuring approximately 69*70*47mm, with mild edema around the tumor. No midline shift.",
    "BraTS-MEN-00712-000": "Multiple grouped abnormal signal shadows are seen under the cerebral longitudinal fissure, sub-parieto-occipital bone plate and at the cranial base, presenting with isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, hyperintense signal on FLAIR, and marked enhancement on T1 with contrast, measuring approximately 46*29*82mm. Midline structures are not displaced.",
    "BraTS-MEN-00717-003": "A nodular abnormal signal is visible on the right side of the cerebral longitudinal fissure, presenting as isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, hyperintense on FLAIR, and shows significant enhancement post-contrast with size approximately 12*22*20mm. There is no midline shift.",
    "BraTS-MEN-00725-000": "A mass-like abnormal signal shadow is seen under the meninges on the right side of the top of the head in the cerebral longitudinal fissure, showing isointense signal on T1-weighted imaging, isointense signal on T2-weighted imaging, and isointense signal on FLAIR sequence. After administration of T1 contrast, there is obvious enhancement, with dimensions of approximately 74*114*68 mm, with peritumoral edema. There is no midline shift.",
    "BraTS-MEN-00726-000": "There is a small patchy abnormal signal shadow in the right temporal region, which shows isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, and slightly hyperintense on FLAIR imaging, and exhibits significant enhancement after contrast (T1C). The size is approximately 16*26*17 mm. There is no shift in the midline structures.",
    "BraTS-MEN-00743-001": "There is a mass-like abnormal signal in the left cerebellopontine angle region. It appears isointense on T1-weighted imaging (T1W), isointense on T2-weighted imaging (T2W), and hyperintense on FLAIR sequence. After administration of contrast (T1C), there is mild and uneven enhancement. The size of the lesion is approximately 48*51*44mm. There is mild edema around the tumor, with the adjacent brain parenchyma being compressed. The midline structures are shifted to the right.",
    "BraTS-MEN-00758-000": "A mass-like abnormal signal is seen below the cranial plate on the right temporal side, displaying iso-signal on T1 weighted imaging, slightly hyperintense signal on T2 weighted imaging, high signal on FLAIR, and moderate enhancement on T1 weighted post-contrast imaging. The size is approximately 51*53*58 mm with mild edema around the tumor. Midline structures are slightly deviated to the left.",
    "BraTS-MEN-00759-000": "A mass-like abnormal signal shadow is observed below the calvarium of the right frontal part, presenting with iso-intense signal on T1-weighted images, iso-intense signal on T2-weighted images, and hyperintense signal on FLAIR. After T1 contrast administration, there is evident enhancement. Its size is approximately 13x14x11 mm. There is no displacement of midline structures.",
    "BraTS-MEN-00768-000": "A small abnormal signal focus can be seen beneath the skull plate in the left frontal region. It presents with isointense signals on T1W, T2W, slightly hyperintense on FLAIR, and shows significant enhancement on T1C. The size is approximately 22*31*16mm. There is no shift of midline structures.",
    "BraTS-MEN-00774-000": "A mass-like abnormal signal shadow can be observed under the skull plate of the right frontal lobe, presenting as isointense on T1-weighted imaging, slightly hyperintense on T2-weighted and FLAIR sequences, with obvious enhancement of the lesion after contrast (T1C) and visible signs of meningeal tailing. The dimensions are approximately 43 * 51 * 49 mm, causing compression of the right lateral ventricle. There is no shift of midline structures.",
    "BraTS-MEN-00777-000": "A mass-like abnormal signal is seen adjacent to the cerebellar tentorium in the right occipital region, exhibiting iso- to low signal on T1-weighted images, high signal on T2-weighted images, and high signal on FLAIR sequences, with significant enhancement on T1-weighted images with contrast. The boundary is clear, with approximate dimensions of 27*32*37 mm. There is no midline shift.",
    "BraTS-MEN-00779-000": "Under the skull plate in the left parieto-occipital region, a mass-like abnormal signal is observed, showing isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR, and marked enhancement on T1 post-contrast images, with a size of approximately 48*61*61mm, accompanied by peritumoral edema. There is no midline shift.",
    "BraTS-MEN-00781-008": "A mass-like abnormal signal is seen under the cranial plate in the right skull base and the left frontal region, showing iso-intensity on T1-weighted imaging (T1WI), iso-intensity on T2-weighted imaging (T2WI), slightly hyperintense on FLAIR, and marked enhancement on T1WI post-contrast (T1C). The size is approximately 24*26*23 mm. There is no midline shift.",
    "BraTS-MEN-00781-010": "A mass-like abnormal signal is observed at the right skull base, showing isointense signal on T1W images, isointense signal on T2W images, and isointense signal on FLAIR. After contrast (T1C), there is significant enhancement. The size is approximately 23*25*24 mm. There is no midline shift.",
    "BraTS-MEN-00790-000": "A fusiform abnormal signal shadow can be seen beneath the skull plate of the right temporal region, showing isointense signal on T1W, slightly hyperintense signal on T2W, hyperintense signal on FLAIR, with marked enhancement on T1C, measuring approximately 19*17*21mm. No shift of midline structures.",
    "BraTS-MEN-00805-000": "A small nodular lesion is observed beneath the right frontal calvarium, which exhibits iso-intense signal on T1-weighted and T2-weighted images, slightly hyperintense signal on FLAIR sequence, and marked enhancement on T1-weighted contrast (T1C) images. The lesion has clear boundaries and measures approximately 13*11*18 mm. There is no midline shift.",
    "BraTS-MEN-00809-000": "A mass-like abnormal signal is seen on the left side of the posterior longitudinal fissure of the brain, presenting with isotense on T1-weighted images, isotense on T2-weighted images, and slightly hyperintense on FLAIR images. The lesion is markedly enhanced after contrast (T1C) and measures approximately 56*67*84 mm, with significant surrounding edema. There is no shift of midline structures.",
    "BraTS-MEN-00817-000": "A mass-like abnormal signal focus is seen below the left temporal pole skull plate, showing hypointense on T1W images, isointense on T2W images, hyperintense on FLAIR images, and demonstrating significant enhancement on T1C, measuring approximately 43*42*34mm. In the right frontal operculum, a patchy abnormal signal shadow is observed, displaying hypointense on T1W images, hyperintense on T2W images, with a center presenting low signal and the periphery showing high signal on FLAIR images, without obvious enhancement post-contrast. No midline shift is noted.",
    "BraTS-MEN-00820-000": "A mass-like abnormal signal is observed in the anterior interhemispheric fissure, showing isointense signal on T1-weighted imaging (T1W), isointense signal on T2-weighted imaging (T2W), hyperintense on FLAIR, with marked enhancement on T1 post-contrast (T1C). The size is approximately 11*18*19 mm. No midline shift is detected.",
    "BraTS-MEN-00825-000": "A mass-like abnormal signal focus can be seen beneath the skull plate on the right frontal part, presenting with isointense on T1-weighted (T1W) and T2-weighted (T2W) images, slightly hyperintense on FLAIR sequence, and showing apparent uniform enhancement after administering gadolinium-based contrast material (T1C) with evidence of the dural tail sign, measuring approximately 34*35*51 mm. No shift in midline structures.",
    "BraTS-MEN-00833-000": "Two mass-like abnormal signal shadows are visible on the right frontal parietal region, presenting as isointense on T1W, slightly hyperintense on T2W, hyperintense on FLAIR, with significant enhancement on T1C. The dimensions are approximately 82*92*65mm. There is mild edema around the tumor, and the right lateral ventricle is compressed and narrowed. Midline structures are shifted to the left.",
    "BraTS-MEN-00837-000": "A small patchy abnormal signal shadow is visible below the cranial plate in the left frontal region, showing isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, slightly hyperintense signal on FLAIR, and significant enhancement on T1 contrast-enhanced imaging, measuring approximately 12*10*12 mm. No midline shift.",
    "BraTS-MEN-00840-000": "A mass-like abnormal signal shadow is seen adjacent to the superior sagittal sinus in the posterior interhemispheric fissure, with signals iso-intense on T1W, slightly hypo-intense on T2W, slightly hyper-intense on FLAIR, and shows obvious enhancement on T1C, measuring approximately 12*12*13 mm. There is no midline shift.",
    "BraTS-MEN-00848-000": "A mass-like abnormal signal shadow can be seen beneath the right parietal bone, showing isointense signal on T1W, isointense signal on T2W, hyperintense signal on FLAIR, with marked enhancement post T1 contrast, measuring approximately 18*21*26mm. There is no midline shift.",
    "BraTS-MEN-00854-000": "A mass-like abnormal signal is observed in the right parieto-occipital lobe and the posterior horn of the lateral ventricle. The shape is irregular with parts extending across the midline. It appears as a low signal on T1-weighted imaging, slightly hyperintense on T2-weighted and FLAIR sequences. Surrounding the lesion, there is an extensive edema signal, and after contrast administration, there is marked enhancement of the lesion which measures approximately 90*113*86 mm. The right lateral ventricle is compressed. There is a slight shift of midline structures to the left.",
    "BraTS-MEN-00861-000": "A mass-like abnormal signal is observed beneath the left parietal calvarium, exhibiting isointense signal on T1W, slightly hyperintense signal on T2W and FLAIR, with marked enhancement on T1C. The lesion measures approximately 34*32*25 mm and the adjacent brain parenchyma is compressed. There is no midline shift.",
    "BraTS-MEN-00876-000": "A mass-like abnormal signal shadow is visible in the cerebral anterior interhemispheric fissure, presenting as isointense on T1-weighted imaging (T1WI), isointense on T2-weighted imaging (T2WI), hyperintense on Fluid-Attenuated Inversion Recovery (FLAIR) imaging, and demonstrates significant enhancement on contrast-enhanced T1WI (T1C). The size of the lesion is approximately 24*25*13 mm. There is no shift of midline structures.",
    "BraTS-MEN-00878-000": "A small patchy abnormal signal shadow can be seen in the left frontal lobe, showing isointense signals on T1W, T2W, FLAIR, with marked enhancement on T1W post-contrast (T1C), measuring approximately 8*9*7 mm in size. There is no shift in midline structures.",
    "BraTS-MEN-00895-000": "A small plaque-like abnormal signal shadow can be seen beneath the cranial plate of the left frontal region, presenting with an isointense signal on T1-weighted images, isointense on T2-weighted images, isointense on FLAIR, and significant enhancement on T1-weighted imaging with contrast. The size is approximately 11 x 9 x 10 mm. There is no shift of midline structures.",
    "BraTS-MEN-00897-000": "A mass-like abnormal signal shadow is visible in the right cerebellopontine angle region, presenting with iso-signal intensity on T1W, slightly hyperintense on T2W, hyperintense on FLAIR, and marked enhancement on T1 post-contrast. The size is approximately 31*33*37 mm, with mild peritumoral edema. There is no midline shift.",
    "BraTS-MEN-00898-000": "A mass-like abnormal signal is visible in the left frontal lobe, presenting with iso-intense signal on T1-weighted sequence, iso-intense signal on T2-weighted sequence, slightly hyperintense signal on FLAIR sequence, and obvious enhancement on T1-weighted contrast sequence; with an approximate size of 55*70*70mm, and peritumoral edema. There is a slight deviation of midline structures to the right, and mild compression and narrowing of the anterior horn of the left lateral ventricle.",
    "BraTS-MEN-00906-000": "A mass-like abnormal signal focus is visible in the right cerebellopontine angle region, with a broad base, compressing the brainstem and showing isointense signal on T1W and T2W sequences, slightly hyperintense on FLAIR sequence, and significant enhancement on T1C with evidence of a dural tail sign. The dimensions of the lesion are approximately 43*53*42 mm. No midline shift is observed.",
    "BraTS-MEN-00911-000": "A mass-like abnormal signal is visible beneath the right frontal calvarium, displaying isointense signal on T1W, isointense signal on T2W, slightly hyperintense signal on FLAIR, and significant enhancement after contrast (T1C); measuring approximately 38*49*36mm, the adjacent brain parenchyma is compressed. There is no shift of midline structures.",
    "BraTS-MEN-00920-000": "A nodular abnormal signal shadow is observed adjacent to the anterior interhemispheric fissure of the brain, presenting as isointense on T1W, slightly hypointense on T2W, slightly hyperintense on FLAIR, with significant enhancement on T1C; the size is approximately 13*16*8 mm. There is no midline shift.",
    "BraTS-MEN-00930-000": "A mass-like abnormal signal shadow can be seen beneath the right parietal bone, presenting as isointense on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR, and showing uneven enhancement on T1 post-contrast images, measuring approximately 64*45*33 mm. There is no midline shift, and the right parietal lobe brain parenchyma is mildly compressed.",
    "BraTS-MEN-00932-006": "An abnormal signal nodule is seen in front of the left pons, showing slightly low signal on T1-weighted imaging, isointense signal on T2-weighted imaging, hyperintense signal on FLAIR sequences, and marked enhancement on T1-weighted imaging post-contrast. The lesion has a clear boundary and measures approximately 16*11*14 mm. There is no midline shift.",
    "BraTS-MEN-00932-009": "A nodular abnormal signal is observed in the left cerebellopontine angle, showing isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, hyperintense on FLAIR, and with significant enhancement on T1-contrast imaging, measuring approximately 12*11*13 mm. There is no midline shift.",
    "BraTS-MEN-00940-000": "A mass-like abnormal signal is observable under the right frontal bone plate, showing isointense signal on T1-weighted images (T1W), isointense signal on T2-weighted images (T2W), slightly hyperintense signal on Fluid-attenuated inversion recovery (FLAIR), and marked enhancement on T1-weighted contrast-enhanced images (T1C); the mass measures approximately 18*20*15 mm. There is no midline shift.",
    "BraTS-MEN-00941-000": "In the left cerebellopontine angle region, there is a lesion with an isointense signal on T1-weighted images, isointense signal on T2-weighted images, hyperintense signal on FLAIR sequence, and prominent enhancement on T1-weighted images with contrast. The lesion measures approximately 21*21*20 mm. No shift of midline structures.",
    "BraTS-MEN-00942-000": "A mass-like abnormal signal is seen in the cerebral longitudinal fissure pool, displaying equal signal intensity on T1-weighted sequences, equal signal intensity on T2-weighted sequences, high signal on FLAIR, and marked enhancement on T1 post-contrast, measuring approximately 17*17*24 mm. There is no midline shift.",
    "BraTS-MEN-00950-000": "A small patchy abnormal signal shadow can be seen in the right temporal region, presenting with iso-intense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, iso-intense signal on FLAIR, and pronounced enhancement on T1 post-contrast series, measuring approximately 10*9*9 mm. There is no shift of midline structures.",
    "BraTS-MEN-00951-000": "Group-like abnormal signal shadows are visible beneath the precentral cerebellar cistern, in the right cerebellopontine angle area, and beneath the calvarium of the left temporal region, presenting with an isointense signal on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR, and showing marked enhancement with contrast medium (T1C). The size of the lesion is approximately 35*51*19 mm. There is no displacement of midline structures.",
    "BraTS-MEN-00971-000": "A mass-like abnormal signal is observed beneath the skull plate of the left frontal area, showing a signal intensity on T1-weighted images (T1W) equivalent to the surrounding tissue, slightly hyperintense on T2-weighted images (T2W), slightly hyperintense on Fluid-attenuated inversion recovery sequence (FLAIR) images, and significantly enhanced following contrast (T1C). The dimensions of the abnormality are approximately 43*48*39 mm, with surrounding edema. There is no shift of the midline structures.",
    "BraTS-MEN-00983-008": "A mass-like abnormal signal is visible in the right temporal region, showing an isointense signal on T1-weighted imaging, isointense signal on T2-weighted imaging, slightly hyperintense signal on FLAIR imaging, and marked enhancement post-contrast administration with size approximately 21*31*24mm. There is no shift of midline structures.",
    "BraTS-MEN-00989-000": "A mass-like abnormal signal is observed in the right frontal lobe, presenting with an isointense signal on T1W, isointense signal on T2W, slightly hyperintense signal on FLAIR, and moderate enhancement on T1C. The dimensions of the lesion are approximately 52*64*41 mm, with perilesional edema. There is slight leftward deviation of midline structures.",
    "BraTS-MEN-00991-000": "A mass-like abnormal signal is observed on the right side of the longitudinal fissure of the brain, presenting with an isointense signal on T1-weighted images, isointense on T2-weighted images, slightly hyperintense on FLAIR with uneven signal, and showing uneven enhancement on T1 with contrast. The dimensions of the lesion are approximately 40 x 60 x 47 mm, with mild perilesional edema. There is a slight deviation to the left of the midline structures.",
    "BraTS-MEN-00999-000": "A nodular abnormal signal is visible in the anterior interhemispheric fissure, showing isointense signal on T1W, isointense signal on T2W, slightly hyperintense signal on FLAIR, and moderate enhancement on T1C, measuring approximately 13*15*14mm. There is no midline shift.",
    "BraTS-MEN-01003-008": "An abnormal signal nodule is visible below the skull plate in the left frontal region, showing isointense signal on T1W and T2W sequences, slightly hyperintense signal on FLAIR, with conspicuous enhancement after contrast (T1C), measuring approximately 14*20*16 mm. No midline shift is observed.",
    "BraTS-MEN-01006-000": "A small mass-like abnormal signal is observed on the right side of the skull base, presenting with an isointense signal on T1W, an isointense signal on T2W, a hyperintense signal on FLAIR, and marked enhancement on T1C. The size of the lesion is approximately 17*17*23mm. There is no midline shift.",
    "BraTS-MEN-01008-011": "A mass-like abnormal signal is observed in the right cerebellar tentorium, presenting with isointense signal on T1W, T2W, and FLAIR sequences. Post-contrast T1-weighted imaging shows marked enhancement. The lesion measures approximately 16*17*17 mm, with mild surrounding edema. There is no midline shift.",
    "BraTS-MEN-01014-000": "A mass-like abnormal signal shadow is seen on both sides of the cerebral falx in the frontal lobes. The mass crosses the midline and shows isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted and FLAIR imaging, and marked inhomogeneous enhancement on T1 post-contrast imaging. The size of the mass is approximately 56*51*54 mm. There is no midline shift.",
    "BraTS-MEN-01031-000": "A mass-like abnormal signal is observed in the anterior interhemispheric fissure, showing isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR, with marked enhancement post-gadolinium administration. The size is approximately 68*72*58 mm, with surrounding edema. There is a slight deviation of midline structures to the left.",
    "BraTS-MEN-01035-000": "A mass-like abnormal signal is seen underneath the skull plate in the left frontal lobe, presenting with isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, slightly hyperintense signal on FLAIR, and significant enhancement on T1 post-contrast. The dimensions are approximately 43*83*60mm, with surrounding edema. There is a slight shift of midline structures to the right, and compression and narrowing of the anterior horn of the left lateral ventricle.",
    "BraTS-MEN-01036-000": "A mass-like abnormal signal is observed beneath the left-sided calvarial vault, displaying isointense signal on T1-weighted (T1W) images, slightly hyperintense signal on T2-weighted (T2W) images, slightly hyperintense signal on Fluid Attenuated Inversion Recovery (FLAIR) images, and pronounced enhancement on T1 post-contrast (T1C) images. The size of the mass is approximately 54*67*66 mm with mild peritumoral edema. There is no midline shift.",
    "BraTS-MEN-01050-000": "A mass-like abnormal signal is observed underneath the right parietal calvarium, displaying isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, and slightly hyperintense signal on FLAIR imaging. The lesion exhibits non-homogeneous enhancement post-contrast (T1C) and measures approximately 30*26*34mm. There is mild edema around the tumor. No shift of midline structures is seen.",
    "BraTS-MEN-01052-000": "There is a small nodular abnormal signal shadow under the calvarial plate on the right frontal region, showing isointense on T1-weighted imaging, isointense on T2-weighted imaging, hyperintense on FLAIR sequence, with significant enhancement on T1 post-contrast. The lesion's size is approximately 9*14*16mm. No midline shift is observed.",
    "BraTS-MEN-01058-000": "A mass-like abnormal signal is observed adjacent to the cerebral longitudinal fissure, showing isointense signal on T1-weighted images, isointense signal on T2-weighted images, and isointense signal on FLAIR. Moderate enhancement is seen on T1-weighted post-contrast images, measuring approximately 12*12*12 mm. There is no midline shift.",
    "BraTS-MEN-01062-000": "An abnormal signal nodule is visible beneath the skull plate in the right frontal region, showing isointense on T1-weighted and T2-weighted imaging, slightly hyperintense on the FLAIR sequence, and marked enhancement upon administration of T1 contrast, measuring approximately 14*6*13 mm. There is no shift of the midline structures.",
    "BraTS-MEN-01065-000": "In the left cerebellopontine angle region, a mass-like abnormal signal is observed, which appears isointense on T1-weighted, T2-weighted, and FLAIR sequences. After T1 contrast (T1C) administration, there is significant enhancement. Its approximate size is 42*57*41 mm, with surrounding edema and compression of the adjacent brain parenchyma. No shift in midline structures.",
    "BraTS-MEN-01073-000": "A small patchy abnormal signal is visible in the left temporal region, showing isointense signal on T1 weighted images, isointense signal on T2 weighted images, slightly hyperintense signal on FLAIR sequences, and moderate enhancement on T1 with contrast. The dimensions of the lesion are approximately 11*14*11mm. There is no midline shift.",
    "BraTS-MEN-01090-000": "A mass-like abnormal signal is observed beneath the left parieto-occipital calvarium, presenting with isointense signal on T1-weighted images, isointense signal on T2-weighted images, slightly hyperintense signal on FLAIR, and marked enhancement on T1-weighted images with contrast. The lesion measures approximately 37x37x45 mm and is compressing the adjacent brain parenchyma. No midline shift is noted.",
    "BraTS-MEN-01102-000": "A mass-like abnormal signal shadow can be seen beneath the left frontal bone plate, presenting as isointense on T1-weighted images, slightly hypointense on T2-weighted images, hyperintense on FLAIR, and showing marked enhancement on contrast-enhanced T1-weighted images, measuring approximately 23*34*24mm. There is no shift of midline structures.",
    "BraTS-MEN-01108-000": "A mass-like abnormal signal is visible in the left temporal region, presenting as isointense on T1-weighted imaging, isointense on T2-weighted imaging, slightly hyperintense on FLAIR imaging, with significant enhancement on T1-weighted imaging following contrast (T1C). The lesion measures approximately 53 x 71 x 70 mm, accompanied by perilesional edema and compression of the adjacent brain parenchyma. There is a slight rightward shift of the midline structures.",
    "BraTS-MEN-01116-000": "A mass-like abnormal signal is observed in the right frontal-temporal region, presenting with iso-intense signal on T1-weighted imaging, T2-weighted imaging, and Fluid-attenuated inversion recovery (FLAIR) sequence. After contrast administration, the lesion exhibits moderate enhancement measuring approximately 50*72*52 mm. Surrounding edema is noted, and there is mild compression and narrowing of the anterior horn of the right lateral ventricle. There is a slight deviation of midline structures to the left.",
    "BraTS-MEN-01121-000": "A mass-like abnormal signal is visible adjacent to the falx cerebri in the right parietal lobe, which is irregular in shape, shows iso-signal on T1W and T2W, slightly hyperintense signal on FLAIR, and is significantly enhanced on T1C, measuring approximately 68*113*81mm. A large non-enhancing edematous zone can be seen around the lesion, and there is slight compression on the posterior horn of the right lateral ventricle. There is no shift of midline structures.",
    "BraTS-MEN-01126-000": "A mass-like abnormal signal shadow can be seen below the skull plate of the left frontal part, presenting as isointense on T1W, isointense on T2W, and isointense on FLAIR sequences. After T1C (contrast enhancement), it shows obvious enhancement. The size of the lesion is approximately 55*58*56 mm. The adjacent brain parenchyma is compressed with mild edema. There is a slight rightward shift of midline structures.",
    "BraTS-MEN-01128-000": "A strip-like abnormal signal shadow can be seen beneath the cranial plate in the left frontal-temporal region, presenting with iso-signal on T1W, iso-signal on T2W, high signal on FLAIR, and marked enhancement on T1C, measuring approximately 35*37*36mm. There is no displacement of midline structures.",
    "BraTS-MEN-01130-000": "A mass-like abnormal signal shadow is visible below the skull plate in the right frontal region, presenting with isointense signal on T1W, isointense signal on T2W, high signal on FLAIR, and marked enhancement on T1C, with approximate dimensions of 38*46*40mm. The adjacent brain parenchyma is compressed, and meningeal tail sign is observed. There is no midline shift.",
    "BraTS-MEN-01138-000": "In the anterior interhemispheric fissure of the brain, there are two mass-like abnormal signal shadows. They appear isointense on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR, and show marked enhancement with contrast (T1C). The masses are approximately 28*31*25 mm in size, with mild perilesional edema. There is no midline shift.",
    "BraTS-MEN-01148-000": "Two mass-like abnormal signal shadows are visible beneath the skull plate on the left parietal lobe top, showing isointense signal on T1-weighted imaging (T1W), isointense signal on T2-weighted imaging (T2W), slightly hyperintense signal on Fluid-attenuated inversion recovery (FLAIR) sequence, and significant enhancement on contrast-enhanced T1-weighted imaging (T1C), with a size of approximately 35*38*33mm. There is slight deviation of midline structures to the right.",
    "BraTS-MEN-01152-000": "A mass-like abnormal signal can be observed beneath the skullcap in the right parietal region, presenting with iso-intense signal on T1-weighted imaging, and slightly hyperintense signal on T2-weighted and FLAIR sequences. Within the center of the lesion, there are small areas of hypo-intense signal on T1WI and hyperintense signal on T2WI. After contrast enhancement, the solid portion of the tumor enhances significantly, with presence of the dural tail sign. The dimensions are approximately 56*55*59mm. The posterior horn of the right lateral ventricle is slightly compressed, and there is no midline shift.",
    "BraTS-MEN-01156-000": "A mass-like abnormal signal is observed in the left frontal parietal lobe, showing iso to low signal on T1W, slightly high signal on T2W and FLAIR, with uneven enhancement on T1 post-contrast. The size is approximately 98*105*69 mm, with perilesional edema. Both lateral ventricles are compressed and narrowed. There is a rightward shift of midline structures.",
    "BraTS-MEN-01170-000": "Under the left parietal bone, there is a mass-like abnormal signal, which appears as low signal on T1W, slightly high signal on T2W, and high signal on FLAIR. After contrast administration (T1C), it shows marked enhancement. The size is approximately 21*22*18mm, and the adjacent brain parenchyma is mildly compressed. There is no midline shift.",
    "BraTS-MEN-01179-000": "A mass-like abnormal signal is visible adjacent to the posterior interhemispheric fissure of the brain, presenting as isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, hyperintense on FLAIR imaging, with marked enhancement on T1 post-contrast, measuring approximately 34*34*42mm. No midline shift is observed.",
    "BraTS-MEN-01183-000": "On the right side of the cerebral longitudinal fissure, there is a mass-like abnormal signal shadow, showing mixed signal on T1-weighted images, mixed signal on T2-weighted images, mixed signal on FLAIR, and uneven enhancement on T1-weighted images with contrast (T1C). The dimensions of the mass are approximately 68*119*74 mm, with peritumoral edema. Both lateral ventricles are compressed and narrowed. The midline structures are displaced to the left.",
    "BraTS-MEN-01189-000": "A mass-like abnormal signal shadow is seen in the right frontal temporal lobe, presenting as isointense on T1-weighted imaging, isointense on T2-weighted imaging, hyperintense on FLAIR sequence, and shows mild enhancement on contrast-enhanced T1-weighted imaging, measuring approximately 40*42*41mm, causing compression and narrowing of the third ventricle. The midline structures are shifted to the left.",
    "BraTS-MEN-01191-000": "A mass-like abnormal signal shadow can be seen under the left vertex calvarium, presenting as isointense on T1W, slightly hyperintense on T2W, slightly hyperintense on FLAIR, with significant enhancement on T1C, measuring approximately 49*72*62mm. There is peritumoral edema, a dural tail sign is visible, and the posterior horn of the left lateral ventricle is mildly compressed and narrowed. No midline shift is observed.",
    "BraTS-MEN-01198-004": "A small cluster-like abnormal signal shadow is observed beneath the skull plate on the left frontal part, presenting as isointense on T1-weighted (T1W) imaging, isointense on T2-weighted (T2W) imaging, and hyperintense on Fluid Attenuated Inversion Recovery (FLAIR) imaging. The lesion demonstrates significant enhancement after T1 contrast (T1C), measuring approximately 13x13x12 mm. There is no shift in mid-line structures.",
    "BraTS-MEN-01202-000": "A mass-like abnormal signal is visible on the left side of the anterior interhemispheric fissure, showing isointense signal on T1W, slightly hyperintense on T2W, isointense on FLAIR, and uneven enhancement on T1C, measuring approximately 44*62*54mm, with peritumoral edema. The midline structures are slightly deviated to the right, and the left lateral ventricle is compressed and narrowed.",
    "BraTS-MEN-01214-000": "A mass-like abnormal signal shadow can be seen in the right frontal parietal lobe, presenting as isointense on T1W, slightly hyperintense on T2W, hyperintense on FLAIR, and showing prominent enhancement on T1C. The size is approximately 76*111*75 mm, with peritumoral edema noted. The midline structure is deviated to the left, and the right lateral ventricle is compressed and narrowed.",
    "BraTS-MEN-01216-000": "A mass-like abnormal signal shadow is visible beneath the skull plate of the left temporal region, showing isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR sequence, and marked enhancement on T1-weighted contrast (T1C) images, measuring approximately 48*86*70 mm, with peritumoral edema. No midline shift is observed.",
    "BraTS-MEN-01224-000": "A nodular abnormal signal shadow can be seen at the right cranial base, presenting as isointense on T1-weighted sequence, and hypointense on T2-weighted and FLAIR sequences. Post-contrast T1 (T1C) imaging shows marked enhancement. The size is approximately 12*7*12 mm. There is no shift of midline structures.",
    "BraTS-MEN-01225-000": "A mass with abnormal signal intensity is seen beneath the right frontal cranial plate, with a broad base, showing isointensity to low signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, and slightly hyperintense on FLAIR images. The lesion shows clear boundaries and significant enhancement after contrast administration (T1C). The dimensions of the lesion are approximately 17*29*27 mm. There is no midline shift detected.",
    "BraTS-MEN-01231-000": "A small nodule is visible adjacent to the cerebellar tentorium on the right side, showing isointense signal on T1-weighted and T2-weighted sequences, slightly hyperintense signal on FLAIR sequences, and significant enhancement on T1-weighted contrast-enhanced sequence, with dimensions of approximately 10*11*10mm. There is no midline shift.",
    "BraTS-MEN-01233-000": "On the right side of the posterior longitudinal fissure and the left side of the anterior longitudinal fissure, there is a mass-like abnormal signal shadow, presenting as isointense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, slightly hyperintense on FLAIR imaging, with moderate enhancement on T1-weighted imaging with contrast. The size of the lesion is approximately 48*47*46mm. There is mild peritumoral edema. The midline structures are slightly deviated to the left.",
    "BraTS-MEN-01234-000": "A mass-like abnormal signal is observed beneath the left parietal bone, presenting with isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR, and moderate enhancement on T1 post-contrast. The size is approximately 49*54*47 mm with mild surrounding edema. There is a slight rightward deviation of midline structures.",
    "BraTS-MEN-01237-000": "A mass-like abnormal signal shadow is visible under the left parietal bone, displaying an isointense signal on T1-weighted (T1W) images, slightly hyperintense signal on T2-weighted (T2W) images, and slightly hyperintense signal on FLAIR. Moderate enhancement is seen on T1 post-contrast (T1C) images. The size is approximately 64*101*87mm. There is peritumoral edema, and the left lateral ventricle is compressed and narrowed. There is no shift of midline structures.",
    "BraTS-MEN-01246-002": "A small patchy area of abnormal signal is visible beneath the skull cap on the right side, showing isointense on T1W, isointense on T2W, hyperintense on FLAIR, with significant enhancement on T1C. The size of the lesion is approximately 10*12*12 mm. There is no shift in the midline structures.",
    "BraTS-MEN-01246-003": "An abnormal signal nodule is visible beneath the skull plate at the intersection of the right frontal and parietal lobes, with a clear boundary, measuring approximately 12*14*13 mm, showing low signal on T1-weighted images, slightly high signal on T2-weighted images, high signal on FLAIR, and significant enhancement on T1 post-contrast. There is no shift of the midline structures.",
    "BraTS-MEN-01250-000": "A mass-like abnormal signal is observed beneath the right frontal cranial plate, showing isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense signal on FLAIR sequence, and notable enhancement on T1-weighted images with contrast. The dimensions are approximately 93*128*81 mm, with extensive peritumoral edema. Midline structures are deviated to the left, and the right lateral ventricle is compressed and narrowed.",
    "BraTS-MEN-01252-000": "A mass-like abnormal signal shadow is visible beneath the left parietal bone, presenting with isointense signal on T1-weighted imaging (T1W), slightly hyperintense signal on T2-weighted imaging (T2W), and hyperintense signal on Fluid-Attenuated Inversion Recovery (FLAIR). Surrounding the lesion, edema signal is visible. The lesion shows obvious enhancement post-contrast administration (T1C) with uniform enhancement, measuring approximately 38*38*45 mm. No shift in midline structures.",
    "BraTS-MEN-01257-000": "A mass-like abnormal signal shadow can be seen beneath the right frontal cranial plate, showing isointense signal on T1WI, slightly hyperintense signal on T2WI, hyperintense signal on FLAIR, and marked enhancement on T1C, measuring approximately 72*92*78mm, with peritumoral edema, and compression and narrowing of the bilateral lateral ventricles. There is a leftward shift of midline structures.",
    "BraTS-MEN-01266-000": "A nodular abnormal signal shadow can be seen below the posterior parietal calvaria, presenting as iso-intense on T1W and T2W sequences, and hyperintense on FLAIR with marked enhancement on T1C, measuring approximately 19*18*18 mm. There is no midline shift.",
    "BraTS-MEN-01272-000": "A mass-like abnormal signal is observed under the left frontal bone plate, presenting with isointense signal on T1W, hypointense signal on T2W and FLAIR. There is a marked enhancement following T1 with contrast, although the enhancement is slightly uneven. Dot-like non-enhancing areas are visible within the lesion, measuring approximately 16x23x22 mm. No midline shift is noted.",
    "BraTS-MEN-01279-010": "On the right temporal lobe, there is a mass-like abnormal signal shadow, which shows isointense on T1-weighted imaging (T1W), slightly hyperintense on T2-weighted imaging (T2W), hyperintese on FLAIR imaging, and demonstrates marked enhancement after contrast (T1C). The size of the lesion is approximately 39*40*33 mm, with perilesional edema. There is no midline shift.",
    "BraTS-MEN-01280-000": "In the anterior interhemispheric fissure, a mass-like abnormal signal shadow is visible, presenting as isointense on T1-weighted images, slightly hypointense on T2-weighted images, and slightly hyperintense on FLAIR sequences. After contrast administration (T1C), there is mild enhancement. The dimensions of the lesion are approximately 27*26*17mm. There is no midline shift, and the frontal lobe parenchyma is compressed.",
    "BraTS-MEN-01281-000": "A mass-like abnormal signal is observed beneath the calvarial plate of the left frontal lobe, which appears isointense on T1-weighted imaging, slightly hyperintense on T2-weighted and FLAIR sequences. Peritumoral edema is visible. After enhancement, the lesion exhibits significant enhancement with dimensions approximately 28*41*31 mm. There is no shift in midline structures.",
    "BraTS-MEN-01285-000": "An abnormal signal nodule can be seen under the skull plate of the left temporal pole, presenting as low signal on T1-weighted images, slightly high signal on T2-weighted and FLAIR sequences, and the lesion shows significant and uniform enhancement post T1 contrast, with clear boundaries, measuring approximately 23*20*12 mm. No midline shift is observed.",
    "BraTS-MEN-01306-000": "On the left side of the falx cerebri, there is a small area of abnormal signal which measures approximately 13*23*14mm. This area shows isointense signal on T1-weighted imaging (T1W), slightly hypointense signal on T2-weighted imaging (T2W), slightly hyperintense signal on FLAIR sequence, and marked enhancement following contrast administration (T1C). There is no midline shift observed.",
    "BraTS-MEN-01308-000": "A small patchy abnormal signal is visible in the anterior longitudinal fissure of the brain, presenting as an isointense signal on T1-weighted images, slightly high signal on T2-weighted images, high signal on FLAIR, and shows obvious enhancement on T1-weighted contrast-enhanced images. The size is approximately 9*13*9 mm. There is no midline shift.",
    "BraTS-MEN-01309-000": "A nodular abnormal signal shadow is seen in the anterior interhemispheric fissure, which appears isointense on T1-weighted imaging (T1W), isointense on T2-weighted imaging (T2W), hyperintense on Fluid-attenuated inversion recovery (FLAIR), and shows significant enhancement post T1 contrast (T1C). The size is approximately 26x30x17 mm. No midline shift is observed.",
    "BraTS-MEN-01310-000": "A mass-like abnormal signal is seen underneath the skull plate of the right temporal region, presenting with an isointense signal on T1-weighted images, slightly hyperintense on T2-weighted images, hyperintense on FLAIR images, and significant enhancement on T1-weighted images post-contrast administration. The lesion measures approximately 38*40*36 mm and is surrounded by edema. There is no midline shift observed.",
    "BraTS-MEN-01321-000": "A small patchy area of abnormal signal intensity is visible under the cranial plate of the left frontal lobe, displaying an isointense signal on T1-weighted images, slightly hyperintense signal on T2-weighted images, hyperintense on FLAIR, and significant enhancement on T1 post-contrast, measuring approximately 9*8*9 mm. No midline shift is observed.",
    "BraTS-MEN-01327-000": "A mass-like abnormal signal is observed beneath the cranial plate of the right frontal lobe. The lesion has a wide base, flat shape, shows slightly low signal on T1W, and slightly high signal on T2W and FLAIR. Surrounding the lesion, there is a large area of edema signal. The right lateral ventricle is slightly compressed. After administration of T1 contrast (T1C), the lesion shows significant and uniform enhancement. The nearby meninges are thickened and also enhance post-contrast. The approximate size of the lesion is 60*77*68mm. There is no midline shift.",
    "BraTS-MEN-01329-000": "A mass-like abnormal signal is seen under the temporal bone plate on the right side, presenting isointense on T1W sequences, slightly hyperintense on T2W and FLAIR sequences. There is marked enhancement post-Gadolinium on T1C sequences, with dimensions approximately 31*33*31 mm. There is slight perilesional edema. No midline shift is observed.",
    "BraTS-MEN-01331-000": "A mass-like abnormal signal shadow can be observed beneath the right temporal bone plate, presenting with isointense signal on T1-weighted images, isointense signal on T2-weighted images, hyperintense signal on FLAIR, and marked enhancement on post-contrast T1 images, with approximate dimensions of 19*20*26 mm. There is no midline shift.",
    "BraTS-MEN-01335-000": "Within the posterior horn of the left lateral ventricle, there is a mass-like lesion with abnormal signal intensity measuring approximately 34*31*38 mm. The lesion presents with isointense signal on T1-weighted images, isointense signal on T2-weighted images, and hyperintense signal on FLAIR images. There is evident enhancement after administration of contrast (T1C). There is mild surrounding cerebral edema. No midline shift is observed.",
    "BraTS-MEN-01350-000": "There is a mass-like abnormal signal adjacent to the falx cerebri on the left frontal parietal region. The shape is irregular, demonstrating isointense signal on T1-weighted images and slightly hyperintense signal on T2-weighted images. There is hyperintense signal on FLAIR imaging, with surrounding edema. Post-contrast T1-weighted images show significant and heterogeneous enhancement of the lesion, measuring approximately 46*67*55 mm. There is a slight rightward shift of midline structures.",
    "BraTS-MEN-01362-000": "There is a small cluster-like abnormal signal shadow at the right skull base, which shows iso-signal on T1-weighted images (T1W), iso-signal on T2-weighted images (T2W), hyperintense signal on FLAIR sequence and significant enhancement post T1 with contrast, measuring approximately 14*15*20mm, with mild compression on the right cerebellar hemisphere. No midline shift is observed.",
    "BraTS-MEN-01365-000": "A small group-like lesion with abnormal signal is visible beneath the right frontal cranial plate, exhibiting an isointense signal on T1W, isointense signal on T2W, slightly hyperintense signal on FLAIR, and significant enhancement on T1C, measuring approximately 15*14*16mm. There is no shift of midline structures.",
    "BraTS-MEN-01368-000": "Multiple clustered abnormal signal shadows are observed under the skull plates of the bilateral frontal, parietal, temporal, and occipital regions, adjacent to the falx cerebri, on the left side of the pontine-cerebellar region, and near the cerebellar tentorium. The larger lesion is located in the right temporal region with dimensions of approximately 56*63*37mm. The lesion displays isointensity on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, with some areas within the lesion showing hypointense signal on T2-weighted imaging. After contrast enhancement (T1C), the lesion shows obvious, uniform enhancement. A small patchy abnormal signal shadow, which is hyperintense on T1-weighted and mixed signal on T2-weighted imaging, is observed adjacent to the falx cerebri in the left parietal region. This area also shows enhancement post-contrast. The right lateral ventricle is compressed. There is no displacement of midline structures.",
    "BraTS-MEN-01384-000": "Under the left frontal bone, a mass-like abnormal signal is evident, presenting as isointense on T1-weighted imaging, hypointense on T2-weighted imaging, slightly hyperintense on FLAIR, and showing significant enhancement after administering contrast (T1C), measuring approximately 41*93*77 mm, with surrounding edema; At the base of the left skull, a mass-like abnormal signal is visible, presenting as slightly hypointense on T1-weighted imaging, hypointense on T2-weighted imaging, slightly hyperintense on FLAIR, and showing uneven mild enhancement after contrast (T1C), meauring approximately 41*93*77 mm. No midline shift is observed, and there is compression of the left cerebellar hemisphere.",
    "BraTS-MEN-01385-000": "In the anterior cranial fossa, at the location of the cerebral falx, a mass-like abnormal signal can be observed, which grows across the midline. It presents as iso- to low signal on T1-weighted sequences, mixed high signal on T2-weighted sequences, with central low and peripheral high signal on FLAIR, and significant but uneven enhancement after contrast administration, predominantly at the periphery. Surrounding the lesion, a large area of edema is visible, measuring approximately 113*126*83 mm. There is no shift in the midline structures.",
    "BraTS-MEN-01399-000": "A mass-like abnormal signal shadow is visible beneath the skull plate of the right frontal parietal region, presenting as isointense on T1-weighted images, isointense on T2-weighted images, hyperintense on FLAIR, with significant enhancement on T1 post-contrast, and measures approximately 40*54*57 mm with perilesional edema. No midline shift is observed.",
    "BraTS-MEN-01404-000": "A mass-like abnormal signal focus is observed adjacent to the falx cerebri on the left frontal-parietal region. It exhibits low signal intensity on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, and hyperintense signal on FLAIR sequence, with clear demarcation. Post-enhancement imaging shows mild and uneven enhancement, measuring approximately 46 x 61 x 42 mm. There is a slight shift of midline structures to the right.",
    "BraTS-MEN-01409-000": "Under the calvarium in the right frontoparietal region, adjacent to the anterior interhemispheric fissure, and at the junction of the left temporal and occipital lobes, a mass-like abnormal signal is observed. It shows an isointense signal on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, slightly hyperintense on FLAIR imaging, and mild enhancement on T1-weighted imaging with contrast. The approximate dimensions of the lesion are 47*59*57 mm with mild surrounding edema. The midline structures are slightly shifted to the left.",
    "BraTS-MEN-01411-000": "A mass-like abnormal signal is observed beneath the skull plate in the right temporal area, exhibiting an isointense signal on T1-weighted images, isointense on T2-weighted images, slightly hyperintense on FLAIR images, and shows significant enhancement post-contrast (T1C). It measures approximately 70*131*97 mm, with surrounding edema and compression of the right lateral ventricle leading to narrowing. Midline structures are shifted to the left.",
    "BraTS-MEN-01414-000": "On the left side of the skull base, two mass-like abnormal signal shadows can be observed. They appear isointense on T1-weighted images, slightly hyperintense on T2-weighted images, slightly hyperintense on FLAIR images, and exhibit significant enhancement with T1 contrast, measuring approximately 19*16*22mm. No midline shift is present.",
    "BraTS-MEN-01416-000": "A mass-like abnormal signal is visible in the cerebral longitudinal fissure, displaying isointense signal on T1-weighted imaging, slightly hyperintense signal on T2-weighted imaging, slightly hyperintense signal on FLAIR imaging, and obvious enhancement post-contrast (T1C), with dimensions approximately 17*23*19 mm. Tail sign of the meninges is visible. No midline shift is observed.",
    "BraTS-MEN-01421-000": "A nodular abnormal signal is observed in the posterior longitudinal fissure, which presents with iso-signal on T1W, iso-signal on T2W, high signal on FLAIR, and marked enhancement on T1C, measuring approximately 14*21*18 mm. There is no midline shift noted.",
    "BraTS-MEN-01422-000": "A mass-like abnormal signal shadow can be observed beneath the cranial plate in the right cerebellopontine area, showing iso-signal on T1WI and T2WI, hyperintense signal on FLAIR, with clear boundaries, and marked enhancement on T1C, the dimensions being approximately 17 x 13 x 15 mm. There is no shift in the midline structures.",
    "BraTS-MEN-01430-000": "A small cluster-like abnormal signal is seen in the anterior interhemispheric fissure, showing isointense on T1-weighted imaging (T1W), isointense on T2-weighted imaging (T2W), slightly hyperintense on Fluid-Attenuated Inversion Recovery (FLAIR), with marked enhancement on T1 post-contrast (T1C). The size is approximately 10*15*10 mm. No midline shift is observed.",
    "BraTS-MEN-01432-000": "A mass-like abnormal signal is observed at the left skull base exhibiting isointense on T1-weighted images (T1W), isointense on T2-weighted images (T2W), slightly hyperintense on FLAIR images, and significant enhancement post-contrast T1W images (T1C). The mass measures approximately 29x29x26mm, with adjacent brain parenchyma compression. There is no midline shift observed.",
    "BraTS-MEN-01433-000": "A mass-like abnormal signal is visible in the left temporal pole, exhibiting an isointense signal on T1-weighted sequences, and hyperintense signal on T2-weighted and FLAIR sequences. Post-enhancement, nodular and patchy enhancement is seen within the lesion, and there is obvious thickening of adjacent meninges, measuring approximately 40*40*30mm. There is no midline shift.",
    "BraTS-MEN-01435-001": "A small nodular lesion is visible at the left temporal pole, exhibiting isointense signals on T1W and T2W sequences, hyperintense on FLAIR, and showing significant enhancement on T1C, approximately 15*14*18 mm in size. Midline structures are not displaced.",
    "BraTS-MET-00002-000": "Multiple punctate, patchy, and nodular abnormal signals are observed in the right cerebral hemisphere, left frontal lobe, and bilateral cerebellar hemispheres. The larger lesion, located in the left cerebellar hemisphere, displays a slightly hypointense signal on T1-weighted images, mixed signals on T2-weighted and FLAIR sequences, with surrounding extensive edema. On T1-weighted images with contrast (T1C), there is obvious enhancement of the lesion, measuring approximately 45*39*47 mm. There is no displacement of midline structures.",
    "BraTS-MET-00003-000": "A large cystic-solid occupying mass is visible within the right lateral ventricle, presenting with mixed signal intensity on T2W imaging and iso- to hypointense signal on T1W imaging. Post-contrast, the solid portion of the lesion demonstrates significant enhancement, measuring approximately 70*127*88 mm. Multiple punctate to patchy abnormal signal shadows are seen in both frontal lobes, the left temporal lobe, the right occipital lobe, and both cerebellar hemispheres, the largest of which is located in the left temporal lobe. This lesion shows low signal on T1W, high signal on T2W, and low signal on FLAIR imaging, with post-contrast ring enhancement and a size of about 70*127*88 mm. There is no displacement of midline structures.",
    "BraTS-MET-00004-000": "Multiple patchy abnormal signal shadows are visible in the left cerebellar hemisphere, occipital lobe, and adjacent to the anterior horn of the right lateral ventricle. These appear with low signal intensity on T1-weighted images and mixed signal intensity on T2-weighted and FLAIR images. Post-enhancement shows peripheral enhancement, and edema signals are visible around the lesions, with the larger one located in the left occipital lobe measuring approximately 26*31*37 mm. At the left Sylvian fissure and the frontal lobe, there are abnormal enhancing nodules, measuring approximately 26*31*37 mm. There is no midline shift.",
    "BraTS-MET-00005-000": "Small patchy abnormal signal shadows are visible in the bilateral frontal lobes and left occipital lobe. The larger one is located in the right frontal lobe, showing slightly hypointense on T1W, hyperintense on T2W and FLAIR sequences. Surrounding edema can be seen, and there is significant enhancement of the lesion post-contrast, measuring approximately 16*19*18 mm. No midline shift is present.",
    "BraTS-MET-00006-000": "A large irregular abnormal signal shadow can be seen in the left parieto-occipital lobe, appearing slightly hypointense on T1W, isointense on T2W, and slightly hyperintense on FLAIR. There is extensive surrounding edema, and post-contrast there is evident enhancement of the lesion measuring approximately 59*99*88mm. The right lateral ventricle is compressed, with a slight shift of the midline to the right; bilateral frontal lobes, left temporal lobe, and right parieto-occipital lobe show scattered abnormal signal nodules, with the larger ones located in the left temporal lobe displaying low signal on T1W and FLAIR, high signal on T2W with internal fluid levels, and mild peripheral enhancement observed post-contrast, measuring approximately 59*99*88mm.",
    "BraTS-MET-00007-000": "Multiple small nodules are observed in the right frontal lobe and left parieto-occipital-temporal lobe, with the larger ones located in the left parietal lobe. These exhibit low signal on T1-weighted imaging, mixed high and low signal on T2-weighted imaging, and mixed high and low signal on FLAIR imaging. After contrast enhancement (T1C), notable enhancement is seen, with the largest measuring approximately 69*88*93mm. Surrounding this area, there is patchy low signal on T1-weighted imaging, and a high signal on both T2-weighted and FLAIR imaging. The lateral ventricles are compressed, with midline structures shifted to the right.",
    "BraTS-MET-00008-000": "Multiple patchy and nodular abnormal signals are observed in the bilateral frontal and parietal lobes, and the left temporal lobe. The larger lesion, which is located in the left temporal lobe, appears as a hypo- or isointense signal on T1-weighted images, and has a mixed signal on T2-weighted and FLAIR sequences. Surrounding edema is visible. On T1-weighted imaging with contrast (T1C), the lesion shows heterogeneous enhancement, measuring approximately 50*65*49 mm. There is no shift in midline structures.",
    "BraTS-MET-00009-000": "Multiple clustered abnormal signals are seen in the bilateral parieto-occipital lobes. The larger lesion is located in the left occipital lobe, presenting with mixed iso- to hypo-intense signals on T1-weighted images, mixed high- to low-intense signals on T2-weighted images, high signal on FLAIR, and peripheral enhancement on T1 post-contrast with non-enhancing regions within, measuring approximately 77*60*74 mm. Flaky T1 low signal, T2 high signal, and FLAIR high signal are visible around. Midline structures are not shifted.",
    "BraTS-MET-00010-000": "Multiple patchy abnormal signal foci can be seen in the right frontal, parietal, temporal, occipital lobes, thalamus, and cerebellar hemisphere, with the larger ones located in the right frontal lobe, showing isointense on T1-weighted imaging (T1WI), high signal on T2-weighted imaging (T2WI) and Fluid Attenuated Inversion Recovery (FLAIR), with surrounding large-scale edema, and ring enhancement after contrast; Multiple abnormal enhancing nodules can be seen in the left basal ganglia region, thalamus, and temporal lobe, about 33*30*30mm in size. No shift in midline structures.",
    "BraTS-MET-00011-000": "Multiple punctate, patchy, and irregular abnormal signal shadows can be seen in the right frontotemporal lobe, periventricular area, left frontoparietal lobe, and cerebellar hemisphere. The larger lesion is located near the right lateral ventricle, exhibiting cystic and solid characteristics. The solid part shows iso-signal on T1W and T2W images, slightly hyperintense on FLAIR, with a surrounding large area of edema. Post-enhancement, the solid part of the lesion shows significant enhancement, measuring approximately 72*123*92 mm. The right lateral ventricle is compressed, and there is a mild leftward shift of the midline structures.",
    "BraTS-MET-00012-000": "Multiple small nodules are seen in bilateral frontal and parietal lobes, bilateral cerebellum and left external capsule area. The larger one is located in the left cerebellum, exhibiting low signal on T1-weighted images, high signal on T2-weighted images, and high signal on FLAIR. Post-contrast T1 images reveal rim enhancement, with the size approximately 62*56*54 mm. Surrounding these lesions, there is patchy low signal on T1-weighted images, high signal on T2-weighted images, and high signal on FLAIR. The fourth ventricle is compressed. There is no midline shift.",
    "BraTS-MET-00014-000": "Multiple grouped and patchy abnormal signal shadows can be seen in both cerebral hemispheres and the cerebellum, with the larger ones located in the left occipital lobe. These are showing hypointense signal on T1-weighted images, and mixed hyperintense signal on T2-weighted and FLAIR sequences. Perilesional edema signal is visible. The lesions exhibit significant uneven enhancement after contrast administration, measuring approximately 48*65*55mm. No midline shift is observed.",
    "BraTS-MET-00015-000": "Multiple round-like abnormal signal shadows are seen in the left cerebellar hemisphere, occipital lobe, temporal lobe, and right temporal lobe, with the larger one located in the right temporal lobe, presenting as low signal on T1-weighted imaging (T1W), high signal on T2-weighted imaging (T2W), and ring enhancement seen in the lesion on post-contrast T1 imaging (T1C), measuring approximately 18*23*31mm. There is no displacement of midline structures.",
    "BraTS-MET-00016-000": "Multiple nodular and mass-like abnormal signal shadows are visible in the left frontal lobe, bilateral parietal lobes, right occipital lobe, and on the right side of the brainstem. The largest lesion is located in the left frontal lobe, presenting as cystic and solid, with the solid part showing isointense signal on T1W, slightly hyperintense signal on T2W and FLAIR. Surrounding the lesion is a large area of edema signal. Post-contrast, the solid part of the lesion shows obvious enhancement. The size is approximately 65*155*86 mm. There is no shift in midline structures.",
    "BraTS-MET-00017-000": "Multiple small nodules are seen in the left cerebellum and bilaterally in the frontal, parietal, and occipital lobes, with the larger ones located at undesignated locations, exhibiting isointense signals on T1-weighted imaging, hyperintense signals on T2-weighted imaging and FLAIR, and are clearly enhanced on T1-weighted imaging with contrast. The approximate size of the lesions is 21*21*22mm. Peripheral to the lesions, there are patchy areas of low signal on T1-weighted imaging and high signal on T2-weighted imaging and FLAIR. There is no shift in the midline structure.",
    "BraTS-MET-00019-000": "Abnormal round-like signal shadows can be seen in the left parieto-occipital lobe and the right frontal lobe, with the larger one located in the left parietal lobe. It presents as a slightly low signal on T1W, mixed signal on T2W/FLAIR, surrounded by widespread edema, and shows obvious enhancement post-contrast administration, with the larger lesion measuring approximately 68*82*92mm. There is no midline shift.",
    "BraTS-MET-00020-000": "Irregular abnormal signal can be seen in the left temporal lobe, exhibiting low signal on T1W, high signal on T2W, and low signal on FLAIR sequence, with surrounding edema signal. After enhancement, marginal enhancement of the lesion can be observed, measuring approximately 46*51*39 mm. A small patch of abnormal enhancement can be observed in the right cerebellar hemisphere, measuring approximately 46*51*39 mm. No displacement of midline structures.",
    "BraTS-MET-00021-000": "Multiple small patchy lesions with slightly hyperintense FLAIR signals are observed in the left cerebellar hemisphere and right frontal parietal lobe, with the larger lesion located in the left cerebellar hemisphere measuring approximately 16*22*18mm. After enhancement, the lesion margins show enhancement. No midline shift is observed.",
    "BraTS-MET-00022-000": "Multiple small patchy and nodular abnormal signals can be seen in both cerebral hemispheres and the cerebellum, with the larger lesion located in the left frontal lobe. This lesion exhibits slightly low signal on T1-weighted images, slightly high signal on T2-weighted and FLAIR images, with surrounding edema signal. On T1-weighted images with contrast, rim enhancement is visible, measuring approximately 41*61*39mm. There is no shift of midline structures.",
    "BraTS-MET-00023-000": "Multiple abnormal signal shadows can be seen in both parietal lobes and the right frontal lobe, with the larger lesion located in the left parietal lobe. This lesion appears isointense on T1-weighted images and isointense on T2-weighted images, with mixed signal on FLAIR images. There is significant edema surrounding the lesion. Post-contrast, the lesion exhibits ring enhancement, approximately measuring 116*102*87 mm. No midline shift is observed.",
    "BraTS-MET-00024-000": "Multiple cystic and solid lesions are observed in the bilateral cerebral hemispheres, cerebellar hemispheres, and brainstem, with a larger lesion located in the right frontal lobe, measuring approximately 33*31*32mm, showing low signal on T1-weighted images and high signal on T2-weighted images. There is ring enhancement after contrast administration. There is no midline shift.",
    "BraTS-MET-00025-000": "Mass-like abnormal signals can be seen in the left occipital lobe and the right frontal lobe; the larger lesion is located in the left occipital lobe, exhibiting cystic and solid features. The solid part of the lesion shows isointense signals on T1W and T2W sequences, with slightly hypointense signals on FLAIR. Extensive edema surrounds the lesions, and there is enhancement of the lesion's margin after contrast administration, measuring approximately 43*69*46 mm. There is no midline shift.",
    "BraTS-MET-00026-000": "There is a mass-like abnormal signal shadow in the left cerebellar hemisphere, which appears as a slightly hypointense signal on T1-weighted images, and as hyperintense on T2-weighted and FLAIR sequences, with a large area of surrounding edema. Post-contrast enhancement shows peripheral enhancement of the lesion, measuring approximately 74*63*49 mm. In the right parietal lobe, there is a small round abnormal signal shadow, which appears as hypointense on T1-weighted images, hyperintense on T2-weighted images, and hypointense on FLAIR images, with a small amount of surrounding edema. Post-enhancement reveals mild peripheral enhancement of the lesion, measuring approximately 74*63*49 mm. There is no shift of the midline structures.",
    "BraTS-MET-00027-000": "Multiple abnormal signal shadows are observed in the bilateral frontal lobes, left parietal lobe, and right thalamus, with the larger ones located in the right thalamus. These lesions present with equal signal intensity on T1W and T2W, slightly hyperintense on FLAIR, with a small amount of perilesional edema signal evident along the margins. Post-contrast T1 imaging shows mild enhancement of the lesions, measuring approximately 22*25*27mm. No shift of midline structures.",
    "BraTS-MET-00028-000": "A mass-like abnormal signal is visible in the left temporal lobe, with an irregular shape, showing a slightly hypointense signal on T1W, mixed signal on T2W and FLAIR, and surrounding large area of edema signal. Post-enhancement, the lesion exhibits obvious uneven enhancement, measuring approximately 77*100*82 mm. No displacement of midline structures is observed.",
    "BraTS-MET-00029-000": "A small nodule is observed in the left frontal lobe, exhibiting low signal intensity on T1-weighted images, high signal intensity on T2-weighted images, isointense on FLAIR, and marginal enhancement on T1 post-contrast. The size is approximately 31*25*28mm. Surrounding the nodule, there is a patchy area that shows low signal on T1-weighted images, high signal on T2-weighted images, and high signal on FLAIR. There is no displacement of midline structures.",
    "BraTS-MET-00030-000": "Multiple clustered abnormal signal shadows are seen in the cerebellum, the junction of the left frontal parietal lobes, and the right frontal lobe; the larger one is located in the right cerebellar hemisphere, showing slightly low signal on T1W, and signals on T2W, FLAIR. Perilesional edema signal is visible; significant enhancement of the lesion is seen on T1C, measuring approximately 69*60*55 mm. There is no shift of midline structures.",
    "BraTS-MET-00031-000": "Multiple patchy abnormal signals are seen in both cerebral hemispheres and the cerebellum, with the larger ones located in the right cerebellar hemisphere, presenting with iso-intense on T1W, hypo-intense on T2W and FLAIR sequences. There is mild enhancement on T1 post-contrast with dimensions of approximately 21*28*29 mm. No shift in midline structures.",
    "BraTS-MET-00032-000": "Multiple small nodules are seen in both frontal lobes and the right occipital lobe, with the largest one located in the right occipital lobe, which appears as a low signal on T1W, high signal on T2W, low signal on FLAIR, and shows peripheral enhancement on T1C, measuring approximately 36*52*51 mm. There is no shift in midline structures.",
    "BraTS-MET-00033-000": "A lesion resembling a quasi-circular abnormal signal is visible in the right frontal lobe, presenting with isointense signal on T1-weighted imaging, and slightly hyperintense signal on T2-weighted and FLAIR imaging. There is a large area of edema signal around it, and lesion margin enhancement is seen post-contrast on T1-weighted imaging, with dimensions of approximately 49*90*61 mm. There is no displacement of midline structures.",
    "BraTS-MET-00034-000": "Small patchy abnormal signals are observed in both occipital lobes, displaying isointense on T1-weighted images, slightly hyperintense on T2-weighted and FLAIR images, with a small amount of perilesional edema signal. Enhanced margins of the lesion are visible on T1-weighted images post-contrast, measuring approximately 14*19*31 mm. There is no midline shift.",
    "BraTS-MET-00035-000": "A lesion resembling a round abnormal signal can be seen in the right frontal lobe, presenting as a slightly hypointense signal on T1W, mixed signal on T2W and FLAIR, with large edema around it. The lesion shows obvious uneven enhancement on T1C, with an approximate size of 55*70*62 mm. No midline shift is observed.",
    "BraTS-MET-00036-000": "A small nodular abnormal signal shadow is seen in the left parietal lobe, presenting signals on T1W, T2W, FLAIR, etc. Perilesional edema is observed, and the lesion exhibits significant enhancement on T1C, measuring approximately 12*21*24 mm. No midline shift is observed.",
    "BraTS-MET-00037-000": "There is a space-occupying lesion in the right frontal lobe, exhibiting mixed high and low signals on T1W, mixed high and low signals on T2W, and mixed high and low signals on FLAIR. There is significant enhancement observed post T1 contrast, with dimensions approximately 65*101*69mm. Surrounding the lesion, band-like T1W low signal and T2W high signal, as well as high signal on FLAIR, are visible. The midline structures are deviated to the left.",
    "BraTS-MET-00086-000": "Multiple clustered abnormal signal shadows are visible in the right cerebellar hemisphere and vermis, which present with iso- to hypointense signals on T1-weighted images and slightly hyperintense signals on T2-weighted images. Perilesional edema is observed. On T1-weighted images with contrast (T1C), obvious enhancement of the lesions is visible, with an approximate size of 35*19*22 mm. No midline shift is observed.",
    "BraTS-MET-00089-000": "An abnormal signal nodule can be seen in the left frontal lobe, showing isointense signal on T1-weighted (T1W) and T2-weighted (T2W) images, slightly hyperintense on FLAIR sequence, and significant enhancement on T1-weighted contrast-enhanced (T1C) images. The size is approximately 14*11*13 mm. No midline shift is observed.",
    "BraTS-MET-00090-000": "In the left frontal lobe, an abnormal enhancement nodule is visible, measuring approximately 9*11*11mm. There is no shift in midline structures.",
    "BraTS-MET-00096-000": "Two abnormal enhancing nodules can be seen in the right cerebellar hemisphere with the larger one measuring approximately 12*9*10 mm and presenting ring enhancement. There is no midline shift.",
    "BraTS-MET-00097-000": "Abnormal flake-like signal shadows are visible in the right parietal lobe and the left occipital lobe. The larger lesion is located in the right parietal lobe, showing T1W hypointense signal, T2W hyperintense signal, and FLAIR hypointense signal. There is slight edema signal around the edges. After enhancement, the lesion shows mild marginal enhancement, with approximate size of 25*30*33mm; there is a nodular spot-like abnormal enhancement in the right cerebellar hemisphere, with approximate size of 25*30*33mm. There are no deviations of the midline structures.",
    "BraTS-MET-00098-000": "In the right frontal lobe, there is an abnormal signal nodule, presenting as low signal on T1W and T2W sequences, slightly hyperintense on FLAIR sequence. Surrounding the nodule is a large area of edema. After T1 with contrast (T1C), the lesion exhibits significant enhancement. The size of the lesion is approximately 34*39*43mm. There is no midline shift.",
    "BraTS-MET-00100-000": "Scattered patchy and nodular abnormal signals can be observed in the left side of the brainstem, left parietal lobe, and temporal lobe. The larger lesions are located on the left side of the brainstem, presenting slightly hyperintense on T1-weighted images, and slightly hyperintense on T2-weighted and FLAIR images, with surrounding edema signals. On T1-contrast images, the lesion shows obvious enhancement, measuring approximately 35*33*28 mm. There is no shift in midline structures.",
    "BraTS-MET-00102-000": "Multiple small nodules are noted in the right frontal, parietal-occipital lobes, left frontal-temporal lobe, bilateral cerebellum, and periventricular areas. The largest lesion, located in the right frontal lobe, exhibits low signal intensity on T1-weighted imaging, high signal intensity on T2-weighted imaging, and high signal intensity on FLAIR sequence. Post-contrast T1 demonstrates significant enhancement, with the lesion measuring approximately 7x10x12 mm. There is no midline shift.",
    "BraTS-MET-00104-000": "A large area of abnormal signal is seen in the left occipital lobe, appearing as isointense on T1-weighted imaging, hypointense on T2-weighted imaging, and hypointense on FLAIR imaging. Surrounding the lesion, a large area of edema signal is observed. Post-contrast imaging shows enhancement around the edges of the lesion. No midline shift is seen.",
    "BraTS-MET-00105-000": "Multiple abnormal signal shadows can be seen in the left frontal parietal lobe, right frontal lobe, occipital lobe, and the right cerebellar hemisphere, with the larger ones located in the left frontal lobe. They exhibit slightly low signal on T1W, mixed high and low signal on T2W and FLAIR, and obvious uneven enhancement on T1C. A large area of peritumoral edema is visible, measuring approximately 49*117*55 mm. There is no displacement of the midline structures.",
    "BraTS-MET-00106-000": "A small area of abnormal signal intensity is seen in the right cerebellar hemisphere, displaying slightly low signal on T1-weighted images, and slightly high signal on T2-weighted and FLAIR sequences. Post-contrast enhancement shows enhancement of the lesion margin, measuring approximately 11*11*9 mm. There is no shift of midline structures.",
    "BraTS-MET-00107-000": "A small nodule is observed in the left temporal lobe, exhibiting isointense signal on T1-weighted (T1W) imaging, hyperintense signal on T2-weighted (T2W) imaging, and hyperintense signal on FLAIR imaging. Post-contrast T1 images demonstrate marked enhancement of the nodule, with approximate dimensions of 11*9*12 mm. No midline shift is noted.",
    "BraTS-MET-00108-000": "Abnormal signal nodules are observed in both frontal lobes and the cerebellar hemispheres, appearing isointense on T1-weighted images and slightly hyperintense on T2-weighted and FLAIR sequences. After enhancement, the nodules show enhancement, with the larger one measuring approximately 11*8*7 mm. There is no midline shift.",
    "BraTS-MET-00109-000": "Two abnormal signal nodules can be observed in the right frontal lobe, showing slightly low signal on T1W, similar signals on T2W and FLAIR, with surrounding edema signal. The lesions show obvious enhancement on T1C, measuring approximately 30*30*26mm. No shift in midline structures.",
    "BraTS-MET-00110-000": "A cystic-predominant lesion is visible in the left parieto-occipital lobe, exhibiting low signal on T1W images and high signal on T2W images, with a small amount of low signal fluid level within the lesion. There is a large area of edema around the tumor, and peripheral enhancement is observed post-contrast administration. The size of the lesion is approximately 61*84*87mm. No midline shift is observed.",
    "BraTS-MET-00111-000": "A small area of abnormal signal is visible in the right temporal lobe, exhibiting slightly hypointense on T1-weighted images, slightly hyperintense on T2-weighted images, and hyperintense on FLAIR sequences; perilesional edema is observed. Enhancement of the lesion is seen on post-contrast T1 images, measuring approximately 10*11*12 mm. No midline shift is observed.",
    "BraTS-MET-00112-000": "Multiple small nodules are observed in both frontal lobes, with the larger lesion located in the right frontal lobe, exhibiting high signal intensity on T1-weighted imaging, mixed high and low signal intensity on T2-weighted imaging, high signal intensity on FLAIR imaging, and marginal enhancement on contrast-enhanced T1-weighted imaging. The size of the largest lesion is approximately 68*86*70mm. Surrounding the lesion, there is a patchy area of low signal intensity on T1-weighted imaging, and high signal intensity on T2-weighted and FLAIR imaging. No midline shift is present.",
    "BraTS-MET-00113-000": "Several abnormal enhancing nodules are visible in the left frontal and temporal lobes, with the larger measuring approximately 12*15*6mm. No midline shift is observed.",
    "BraTS-MET-00114-000": "Multiple nodules are seen in the bilateral frontal, parietal, temporal, occipital lobes, and cerebellum, the larger one is located in the right parietal lobe, displaying low signal on T1-weighted images, mixed high and low signals on T2-weighted images, low signal on FLAIR, with significant enhancement on T1 post-contrast sequence, measuring approximately 51*63*60 mm, with surrounding patchy areas of low signal on T1-weighted, high signal on T2-weighted and FLAIR sequences. No midline shift is observed.",
    "BraTS-MET-00115-000": "Multiple nodular abnormal signals are observed in the bilateral frontal lobes, the right parietal lobe, the left occipital lobe, and the cerebellar hemispheres, with the larger one located in the right frontal lobe, displaying low signal on T1-weighted images, and abnormal signals on T2-weighted and FLAIR sequences, with surrounding edema signal observed. After contrast enhancement (T1C), the lesions demonstrate significant enhancement, with the largest measuring approximately 25*21*22mm. No midline shift is observed.",
    "BraTS-MET-00116-000": "In the left frontal lobe, a cystic-solid lesion is visible, exhibiting low signal on T1-weighted images and high signal on T2-weighted images. Around the lesion, a large area of edema signal can be seen. After contrast enhancement, the solid part of the lesion shows significant enhancement, measuring approximately 60*90*69 mm. There is no shift in the midline structures.",
    "BraTS-MET-00117-000": "An abnormal signal nodule can be seen in the right insular lobe, presenting with a low signal on T1-weighted images, a high signal on T2-weighted images, and a low signal on FLAIR. There is edema surrounding the lesion. On T1-weighted imaging with contrast (T1C), the lesion shows ring enhancement, measuring approximately 26*25*20 mm. A punctate abnormal enhancement nodule can also be seen in the left frontal lobe, measuring approximately 26*25*20 mm. There is no shift in midline structures.",
    "BraTS-MET-00118-000": "A patchy abnormal signal is observed in the left frontal lobe, displaying a slightly low signal on T1-weighted images, and high signal on T2-weighted and FLAIR sequences. Surrounding edema is observed. On T1 with contrast, the lesion exhibits ring enhancement, measuring approximately 26*30*22 mm. There is no displacement of midline structures.",
    "BraTS-MET-00119-000": "A small enhancing nodule is observed in the left parietal lobe, measuring approximately 8*13*8 mm. There is no shift of the midline structures.",
    "BraTS-MET-00120-000": "A small nodular lesion with abnormal enhancement can be seen in the right frontal lobe, measuring approximately 7*8*8 mm. There is no midline shift.",
    "BraTS-MET-00121-000": "Multiple small nodules are observed within the left frontal-parietal-temporal lobes and bilaterally within the cerebellum. The larger nodule is located in the right cerebellum, displaying low signal intensity on T1-weighted images, high signal intensity on T2-weighted images, low signal intensity on FLAIR images, and enhancement on T1 post-contrast images, measuring approximately 58*53*36mm. Surrounding this nodule, there is a patchy area showing low signal intensity on T1-weighted images, high signal intensity on T2-weighted images, and high signal intensity on FLAIR images. There is no midline shift.",
    "BraTS-MET-00122-000": "An abnormal signal nodule can be seen in the left parietal lobe, which presents as isointense on T1-weighted imaging, slightly hyperintense on T2-weighted and FLAIR imaging, with peripheral enhancement seen on T1-weighted imaging post-contrast. The size is approximately 15*14*12mm. There is no midline shift.",
    "BraTS-MET-00123-000": "Multiple quasi-circular abnormal signal shadows are visible in the right cerebellar hemisphere and the left occipitoparietal lobe, presenting with low signal on T1-weighted (T1W) images, high signal on T2-weighted (T2W) imaging and Fluid-Attenuated Inversion Recovery (FLAIR) sequences. Surrounding edema signal is observable, with lesion margin enhancement seen after contrast, measuring approximately 50*58*63 mm. Scattered spot-like and small patchy abnormal signal shadows are visible in the left frontal temporal lobe and cerebellar hemisphere, with the larger ones positioned in the left cerebellar hemisphere, surrounded by edema, displaying isointense signal on T1W and slightly hyperintense signal on T2W and FLAIR images. Notable nodular enhancement is seen after contrast, measuring approximately 50*58*63 mm. Midline structures show no displacement.",
    "BraTS-MET-00124-000": "Multiple large abnormal signal shadows are visible in both cerebral hemispheres, with the larger ones located in the frontal lobes. These display low signal intensity on T1W images, iso-intensity on T2W images, and iso-intensity on FLAIR images. Extensive edema signal is observed surrounding the lesions, and there is significant enhancement of the lesions post-contrast, with approximate dimensions of 56*68*59 mm. No midline shift is observed.",
    "BraTS-MET-00125-000": "Two nodular abnormal signal shadows can be observed in the left frontal-parietal lobe, with the larger one located in the left parietal lobe, showing slightly low signal on T1W, slightly low signal on T2W and FLAIR, with surrounding large area of edema. T1C shows enhancement on the edge of the lesion, measuring approximately 61*92*68mm; punctate abnormal signal shadows can be observed in the right cerebellar hemisphere, showing iso signal on T1W, slightly high signal on T2W and FLAIR, with mild enhancement seen after contrast. There is no midline shift.",
    "BraTS-MET-00126-000": "Multiple clustered abnormal signal shadows can be seen in the right cerebellar hemisphere, showing slightly lower signal on T1W, mixed signal on T2W and FLAIR, with surrounding large areas of edema. On T1C, the lesions show obvious uneven enhancement, with the larger lesions measuring approximately 78*68*51 mm. There is no shift of midline structures.",
    "BraTS-MET-00127-000": "A mass-like abnormal signal is visible in the right frontal lobe, presenting mixed signals on T1W, T2W, and FLAIR sequences. Edema is seen around this area, and after administration of contrast (T1C), the lesion shows uneven enhancement. The size of the lesion is approximately 37*45*38mm. There is no midline shift.",
    "BraTS-MET-00128-000": "A cystic lesion is visible in the right parietal lobe, presenting as hypo-intense on T1W and FLAIR sequences, and hyperintense on T2W sequence. Surrounding edema is seen, with nodular enhancement at the lesion margin observed on T1C, measuring approximately 61*83*73mm. There is no shift in midline structures.",
    "BraTS-MET-00129-000": "A mass-like abnormal signal lesion is visible in the right occipital lobe, presenting as a low signal on T1-weighted images with a few punctate high signals at the center, mixed signals on T2-weighted and FLAIR sequences, and a large area of surrounding edema. Post-enhancement, the lesion exhibits peripheral enhancement, measuring approximately 66*109*72 mm. The right lateral ventricle is slightly compressed, and there is a slight shift of the midline to the left; in the right frontal lobe, there is a small patch of abnormal signal that is slightly hyperintense on T1-weighted images, isointense on T2-weighted and FLAIR images with a small amount of surrounding edema signal, and shows mild enhancement after contrast, measuring approximately 66*109*72 mm.",
    "BraTS-MET-00130-000": "An abnormal mass-like signal is observed in the right occipital lobe, characterized by low signal on T1-weighted images (T1W), high signal on T2-weighted images (T2W), and low signal on FLAIR sequence. There is a large area of surrounding edema, and marked enhancement of the solid portion of the lesion is seen on T1 post-contrast (T1C) imaging, measuring approximately 45*61*49mm. There is no shift of midline structures.",
    "BraTS-MET-00131-000": "A mass-like abnormal signal is observed at the posterior horn of the right lateral ventricle, presenting as low signal on T1W, and high signal on T2W and FLAIR sequences. After enhancement, the lesion shows obvious heterogeneous enhancement, measuring approximately 27*28*26mm. A small patch of abnormal signal is observed in the left occipital lobe, presenting as low signal on T1W, high signal on T2W and FLAIR sequences. Post-enhancement, enhancement is seen at the edge of the lesion, measuring approximately 27*28*26mm. There is no midline shift.",
    "BraTS-MET-00132-000": "Multiple punctate, patchy, and round-like abnormal signal shadows can be observed in the left frontal lobe, right lateral ventricle, temporal operculum, cerebellar hemisphere, and on the left side of the brainstem. The larger lesion is located in the right lateral ventricle, which exhibits a high signal on T1-weighted images, slightly higher signal on T2-weighted images, and high signal on FLAIR. Post-contrast enhancement shows lesion border enhancement, with a size of approximately 27*35*23 mm. There is no midline shift.",
    "BraTS-MET-00133-000": "Multiple nodular and patchy abnormal signal foci are seen in the bilateral cerebral hemispheres and cerebellum. The larger lesion is located in the right cerebellar hemisphere, which exhibits low signal in the center and iso-signal on the periphery on T1-weighted images, and high signal in the center with low signal on the periphery on T2-weighted images. Surrounding edema is observed, and after enhancement, the solid part of the lesion is significantly enhanced, measuring approximately 71*68*53mm. There is no shift of the midline structures.",
    "BraTS-MET-00136-000": "In the right cerebellar hemisphere, a patchy abnormal signal shadow is visible, showing isointense on T1-weighted imaging, slightly hyperintense on T2-weighted and FLAIR imaging. Surrounding edema is visible. The lesion demonstrates significant enhancement after contrast (T1C), with approximate dimensions of 25*44*21mm. There is no midline shift.",
    "BraTS-MET-00138-000": "A lesion with a quasi-circular abnormal signal is visible in the left thalamus, exhibiting mixed signal on T1W, T2W, and FLAIR sequences, with the presence of a slight edema signal around it. After enhancement, there is mild ring-like enhancement of the lesion, measuring approximately 34*32*30 mm; multiple abnormal signal nodules are seen in the left frontal lobe and the right cerebellar hemisphere, presenting as isointense on T1W and hypointense on T2W, FLAIR sequences. After enhancement, there is mild enhancement of the lesions, with the larger ones measuring about 34*32*30 mm. There is no displacement of midline structures.",
    "BraTS-MET-00150-000": "Multiple nodular and patchy abnormal signal foci are visible in both cerebral hemispheres and the cerebellum, with the larger ones located in the right frontal lobe, showing isointense to low signal on T1W, high signal in the center and isointense on the periphery on T2W, with extensive edema signal around, and the solid part of the lesions shows obvious enhancement on T1C, measuring approximately 63*83*64 mm. No midline shift is observed.",
    "BraTS-MET-00156-000": "A patchy abnormal signal is observed at the base of the right middle cranial fossa, displaying isointense on T1-weighted imaging, and slightly hyperintense on T2-weighted and FLAIR sequences. After contrast enhancement, the lesion shows significant enhancement, with thickening and enhancement of the adjacent meninges. The lesion measures approximately 21*31*22 mm. There is no midline shift.",
    "BraTS-MET-00164-000": "Multiple nodules are seen in both cerebellar hemispheres, with the larger one located in the left cerebellum displaying mixed high and low signals on T1W images, mixed high and low signals on T2W images, and mixed high and low signals on FLAIR. After contrast administration (T1C), a ring enhancement is observed, measuring approximately 74*62*53mm. Surrounding the lesion, low signal intensity on T1W images, high signal intensity on T2W images, and high signal intensity on FLAIR images are visible. The fourth ventricle is compressed. There is no shift of the midline structures.",
    "BraTS-MET-00165-000": "A mass-like abnormal signal is seen in the right occipital lobe, presenting as high signal on T1 weighted (T1W), T2 weighted (T2W), and FLAIR sequences, with surrounding edema signal. After enhancement, the lesion shows marginal enhancement, with approximate dimensions of 56*87*64 mm. Multiple round-like abnormal signal lesions are seen in the left occipital lobe and bilateral cerebellar hemispheres, the larger one located in the left occipital lobe, presenting as slightly low signal on T1W and slightly high signal on T2W and FLAIR sequences. After enhancement, annular enhancement is visible, with approximate dimensions of 56*87*64 mm. Midline structure shows no shift.",
    "BraTS-MET-00166-000": "The MRI reveals multiple large abnormal signal areas in both frontal lobes, the left parietal lobe, and the cerebellar hemispheres. The largest lesion is located in the left frontal lobe, measuring approximately 53*45*57mm, exhibiting a slightly hyperintense signal on T1-weighted images, with the center hyperintense and the periphery hypointense on T2-weighted images. Surrounding the lesions, extensive vasogenic edema is observed. Post-contrast imaging shows ring enhancement. There is no shift in midline structures.",
    "BraTS-MET-00167-000": "Multiple nodular abnormal signal shadows are observed in the left parietal lobe and bilateral occipital lobes. The larger lesions are located in the left parietal lobe, exhibiting isointense to hypointense signals on T1-weighted images, mixed signals on T2-weighted and FLAIR images, with surrounding edema observed, and the lesions showing obvious enhancement on T1-weighted images with contrast, measuring approximately 59*77*75 mm. No shift in the midline structures.",
    "BraTS-MET-00172-000": "Multiple nodular and patchy abnormal signals are observable in both cerebral hemispheres and the right cerebellar hemisphere, with the larger ones located in the right parietal lobe, presenting mixed high and low signals on T1W and T2W sequences. Around the larger lesions, extensive edema signals can be seen. After enhancement, the lesions demonstrate mild peripheral enhancement, with size approximately 57*76*79mm. No shift in midline structures.",
    "BraTS-MET-00175-000": "A nodular abnormal signal shadow is visible in the left cerebellar hemisphere, presenting as low signal on T1W, high signal on T2W, and slightly high signal on FLAIR. There is significant edema signal around it. Lesion edge enhancement is seen on T1C, measuring approximately 36*47*23mm. There is no shift of midline structures.",
    "BraTS-MET-00182-000": "Multiple round-like abnormal signal shadows are seen in both cerebellar hemispheres, the left temporal-parieto-occipital lobes, the right frontal lobe, and adjacent to the posterior horn of the lateral ventricle. The largest of these lesions is located in the right cerebellar hemisphere with a mixed signal on T1W, T2W, and FLAIR sequences, with surrounding edema signal. Enhancement on the margins of the lesions is noted on the T1C sequence, with dimensions approximately 55*84*76mm. No midline shift is present.",
    "BraTS-MET-00183-000": "Abnormal mass-like signals are seen in the right frontal and occipital lobes, with the larger lesion located in the right frontal lobe, exhibiting mixed high signal on T1W imaging, slightly low signal on T2W imaging, and mixed signal on FLAIR imaging. A large area of edema signal can be observed around the lesion. Post-contrast T1 imaging shows lesion margin enhancement. The lesion measures approximately 59*86*72 mm. No midline shift is observed.",
    "BraTS-MET-00202-000": "A mass-like abnormal signal is observed in the left temporal-occipital lobe, presenting mixed signals on T1W, T2W, and FLAIR sequences, with an internal low signal fluid level. Perilesional edema is present. After enhancement, the lesion shows mild peripheral enhancement, measuring approximately 56*82*56 mm. Multiple smaller abnormal signal foci are seen in the right frontal lobe, left parietal lobe, bilateral temporal lobes, and surrounding the third ventricle, with the largest located in the right frontal lobe, presenting as isointense on T1W, mixed signal on T2W, and FLAIR sequences. Perilesional edema is observed, and the lesion demonstrates ring enhancement post-contrast. No midline shift is noted.",
    "BraTS-MET-00214-000": "Mass-like abnormal signals are visible in the left frontal lobe and right parietal lobe, displaying high signal on T1-weighted sequences (T1W), T2-weighted sequences (T2W), and FLAIR sequences. Surrounding the lesions, there is a slight edema signal, and mild peripheral enhancement is observed after contrast administration, with sizes approximately in millimeters. A punctate abnormal enhancement nodule is visible in the right occipital lobe, approximately measuring 35*37*38mm. No midline shift is observed.",
    "BraTS-MET-00217-000": "Multiple small nodules are seen in the bilateral frontal, parietal, temporal, and occipital lobes, both cerebellar hemispheres, and the left thalamus, with the larger lesions located in the left cerebellum, exhibiting low signal intensity on T1-weighted images, mixed high and low signal intensity on T2-weighted images, low signal intensity on FLAIR, and peripheral enhancement observed on T1-weighted images post-contrast. The size of the largest is approximately 64*70*45 mm. There is no shift in midline structures.",
    "BraTS-MET-00219-000": "A mass-like abnormal signal is observed in the right cerebellar hemisphere, showing iso- to low signal on T1W, mixed signal on T2W and FLAIR, with surrounding edema signal. The lesion shows evident uneven enhancement on T1C, measuring approximately 63*55*46mm. There is no midline shift.",
    "BraTS-MET-00222-000": "A nodule is observed in the left occipital lobe, presenting as a low signal on T1-weighted imaging, mixed high and low signal on T2-weighted imaging, and mixed high and low signal on FLAIR. Post-contrast T1 imaging shows ring enhancement of the nodule, which is approximately 58*89*87 mm in size. Surrounding the nodule is a patchy area with low T1W signal, high T2W signal, and high FLAIR signal. There is no shift in the midline structures.",
    "BraTS-MET-00224-000": "A mass-like abnormal signal focus is visible in the left cerebellar hemisphere, appearing cystic-solid, with the solid part showing slightly low signal on T1-weighted images, and slightly high signal on T2-weighted and FLAIR images. Extensive surrounding edema signal is seen. Post-contrast shows enhancement around the lesion's margin, measuring approximately 38*54*32 mm. In the right frontal lobe, a lesion resembling a round abnormal signal is observed, showing slightly low signal on T1-weighted images, high signal on T2-weighted images, and slightly low signal on FLAIR sequences. Edema is visible around the margins, and post-contrast shows enhancement around the lesion's edges, also measuring approximately 38*54*32 mm. No midline shift is evident.",
    "BraTS-MET-00230-000": "Multiple cystic lesions are observed in the left frontal-parietal-occipital lobes, right frontal lobe, and occipital lobe. The larger lesion is located in the left occipital lobe, presenting with low signal on T1-weighted images, high signal on T2-weighted and FLAIR images. Post-contrast enhancement shows rim enhancement of the lesions, with the largest measuring approximately 51*78*57 mm. There is compression of the left lateral ventricle and slight rightward shift of midline structures.",
    "BraTS-MET-00233-000": "There is a predominantly cystic lesion in the right cerebellar hemisphere, exhibiting low signal on T1-weighted images and high signal on T2-weighted images, surrounded by a large area of edema signal. Post-contrast imaging shows ring enhancement, with dimensions of approximately 67*57*47 mm. Scattered patchy abnormal signals are visible in the bilateral cerebral hemispheres, with the largest located at the junction of the temporal and occipital lobes, showing high signal on both T1-weighted and T2-weighted images. Surrounding edema signal is visible, and post-contrast imaging shows enhancement at the periphery of the lesion, with dimensions of approximately 67*57*47 mm. There is no midline shift.",
    "BraTS-MET-00238-000": "A small abnormal signal focus is visible in the right midbrain tegmentum, presenting as a low signal on T1-weighted images, and low signal on T2-weighted and FLAIR sequences. A small amount of perilesional edema signal is present. On post-contrast T1 images, ring enhancement of the lesion is observed, measuring approximately 26*18*20 mm. No midline shift is evident.",
    "BraTS-MET-00243-000": "Multiple enhancing nodules are visible in both cerebral hemispheres, measuring approximately 11*9*6mm. There is no shift of the midline structures.",
    "BraTS-MET-00255-000": "Multiple patchy and nodular abnormal signals can be seen in both occipital lobes and the right temporal lobe, showing mixed signals on T1W, T2W, and FLAIR sequences. A large area of edema signal can be observed around the lesions. The lesions show heterogeneous enhancement on T1C, measuring approximately 25*41*24mm. There is no midline shift.",
    "BraTS-MET-00260-000": "A mass-like abnormal signal is visible in the right basal ganglia area, presenting with a mixed signal intensity on T1W, T2W, FLAIR sequences, with a large surrounding area of edema signal. On T1C, enhancement of the lesion's margin is seen. The size of the lesion is approximately 79*117*74 mm. The right lateral ventricle is compressed, with slight leftward shifting of midline structures.",
    "BraTS-MET-00262-000": "An irregular abnormal signal shadow can be seen in the left occipital lobe, showing slightly low signal on T1W images, slightly high signal on T2W images, and mixed signals on FLAIR. A large area of edema can be seen around the lesion, with marked uneven enhancement of the lesion on T1C imaging, measuring approximately 54*77*78mm. No midline shift is observed.",
    "BraTS-MET-00263-000": "Large abnormal signal shadows can be seen in the vermis of the cerebellum and right occipital lobe. The larger lesion is located in the cerebellar vermis, presenting as low signal on T1-weighted images, slightly hyperintense on T2-weighted and FLAIR images, surrounded by extensive regions of edema. After enhancement, the lesion exhibits significant inhomogeneous enhancement, with approximate dimensions of 74*64*49mm. There is no shift of midline structures.",
    "BraTS-MET-00264-000": "A cystic and solid lesion is visible in the left frontal parietal lobe, irregular in shape, showing iso to low signal on T1W and mixed high signal on T2W. A large area of peritumoral edema is visible, with significant enhancement of the solid part after contrast, measuring approximately 55*83*64 mm. The midline structures are slightly displaced to the right.",
    "BraTS-MET-00266-000": "A lesion resembling a round shape with abnormal signal intensity is observed in the left temporal lobe, presenting with low signal on T1-weighted (T1W) imaging, high signal on T2-weighted (T2W) imaging, and low signal on Fluid Attenuated Inversion Recovery (FLAIR) sequences. Post-contrast enhancement shows enhancement around the margins of the lesion, measuring approximately 19*22*19 mm. There is no shift of the midline structures.",
    "BraTS-MET-00271-000": "Multiple round-like abnormal signal shadows can be seen in the bilateral cerebral hemispheres and the right cerebellar hemisphere. The larger one is located in the left frontal lobe, showing mixed signals on T1W, slightly heightened signals on T2W and FLAIR. Edema signals can be observed at the edge of the lesions. After enhancement, uneven strengthening is noticeable, with the size of about 22*25*16mm. No displacement of midline structures.",
    "BraTS-MET-00273-000": "In the posterior horn of the right lateral ventricle, an irregular abnormal signal shadow is visible, presenting with a cystic and solid nature. The solid part shows a slightly hypointense signal on T1-weighted images, mixed signal on T2-weighted and FLAIR sequences, with extensive surrounding edema noted. On post-contrast T1-weighted images, the lesion demonstrates inhomogeneous enhancement, measuring approximately 78*112*83mm in size. The right lateral ventricle is compressed, and there is a shift of midline structures to the left.",
    "BraTS-MET-00274-000": "In the left frontal lobe, there is an irregular cystic and solid lesion with mixed signals on T1W, T2W, and FLAIR sequences. Surrounding the lesion, there is a significant area of edema. On the T1C sequence, the solid component of the lesion shows pronounced enhancement. The size of the lesion is approximately 64*87*70 mm. The left lateral ventricle is slightly compressed, and there is a slight rightward shift of midline structures.",
    "BraTS-MET-00280-000": "A mass-like abnormal signal is seen in the left occipital lobe, presenting with a slightly hyperintense signal on T1W, an obvious hyperintense signal on T2W and FLAIR, with surrounding large edema signal. Post-contrast T1 shows enhancement at the edge of the lesion, which measures approximately 74*92*92 mm. There is no midline shift.",
    "BraTS-MET-00281-000": "Multiple small patchy abnormal signal shadows are seen in the vermis and the right cerebellar hemisphere, presenting with an isointense signal on T1WI, slightly hyperintense on T2WI, and hyperintense on FLAIR. Lesion enhancement is visible on T1C, with the larger lesion measuring approximately 10*10*16mm. No midline shift.",
    "BraTS-MET-00285-000": "A small nodule is observed in the right cerebellum, presenting as isointense on T1W sequences, hypointense on T2W and FLAIR sequences, with conspicuous enhancement on T1 post-contrast (T1C), measuring approximately 57*56*33mm. There is also surrounding patchy hypointense signal on T1W, hyperintense on T2W and FLAIR. No midline shift observed.",
    "BraTS-MET-00286-000": "Scattered small patchy abnormal signal shadows are seen in the bilateral frontal lobes, the left parietal lobe, and the temporal lobe, presenting as slightly hyperintense on T1-weighted imaging, slightly hyperintense on T2-weighted imaging, isointense on FLAIR, with lesion enhancement observed in T1C, measuring approximately 14*18*13 mm. No shift of midline structures.",
    "BraTS-MET-00288-000": "Multiple nodular and patchy abnormal signal shadows can be seen in the bilateral frontal parietal lobes, the right occipital lobe, and the cerebellar hemispheres. The larger lesion is located in the right occipital lobe, presenting with mixed signal on T1W and T2W images. A large area of edema signal surrounds the lesions. On contrast-enhanced T1 (T1C), the lesions show obvious uneven enhancement, with the size of the largest approximately 66*108*85 mm. The right lateral ventricle is slightly compressed. There is no midline shift.",
    "BraTS-MET-00290-000": "A cystic-solid lesion is observed in the left frontal lobe, irregular in shape, displaying iso- to hypointense signal on T1-weighted (T1W) images and mixed signal intensity on T2-weighted (T2W) images. Surrounding the lesion, there is a large area of edema signal. After contrast enhancement, the lesion shows marked inhomogeneous enhancement, measuring approximately 65*96*74 mm. The right lateral ventricle is compressed, and there is a slight rightward shift of the midline structures.",
    "BraTS-MET-00292-000": "On the left frontal lobe, there is a mass-like abnormal signal shadow, presenting with isointense to low signal on T1W and mixed signal on T2W. Extensive edema signal is observed around the lesion. After enhancement, the lesion shows marked uneven enhancement with a non-enhanced area inside, measuring approximately 64*77*74 mm; On the right frontal lobe, there is an abnormal signal nodule visible, presenting with isointense signal on T1W and T2W, slightly hyperintense on FLAIR, with obvious enhancement after contrast, measuring approximately 64*77*74 mm. There is no displacement of midline structures.",
    "BraTS-MET-00296-000": "A small, approximately round abnormal signal shadow can be observed in the left cerebellar hemisphere, presenting with isointense signal on T1-weighted images, hyperintense signal on T2-weighted and FLAIR sequences, and peripheral enhancement visible on contrast-enhanced T1 images, measuring approximately 11*11*12 mm. There is no midline shift.",
    "BraTS-MET-00304-000": "Large abnormal signal shadows can be seen in the right occipital lobe and cerebellar hemisphere; the larger lesion is located in the right cerebellar hemisphere, presenting as slightly hypointense on T1-weighted images, mixed hyperintense signal on T2-weighted images, and mixed hyperintense on FLAIR. There's extensive edema signal around the lesions. Post-contrast T1 images show peripheral enhancement of the lesions, measuring approximately 84*64*50 mm. No shift in midline structures.",
    "BraTS-MET-00306-000": "Multiple clustered and nodular abnormal signal shadows can be seen in the left cerebral hemisphere and the right parieto-occipital lobe, with the larger ones located in the right occipital lobe, showing hypo- to isointense signal on T1-weighted images, mixed signal on T2-weighted and FLAIR images, surrounded by extensive edematous signal. Post-contrast T1 images reveal markedly inhomogeneous enhancement of the lesions, measuring approximately 59*95*87 mm. No midline shift is observed.",
    "BraTS-MET-00307-000": "A small nodule is observed in the left temporal lobe, presenting as a low signal on T1W sequence, low signal on T2W sequence, and slightly low signal on FLAIR sequence. After contrast administration (T1C), the nodule shows peripheral ring enhancement, with dimensions approximately 61*84*53mm. Adjacent to the nodule, there is an extensive area demonstrating low signal on T1W sequence, high signal on T2W sequence, and high signal on FLAIR sequence. There is a deviation of midline structures to the right.",
    "BraTS-MET-00347-000": "A small abnormal signal area is observed in the right frontal lobe, presenting as a high signal on T1W, high signal on T2W, and high signal on FLAIR. Notable enhancement is seen on T1C, and perilesional edema is visible, measuring approximately 12*19*20mm. There is no shift of midline structures.",
    "BraTS-MET-00348-000": "Multiple small nodules are observed in the right temporal-parietal lobe, with the larger located in the right parietal lobe, exhibiting high signal on T1W, high signal on T2W, and high signal on FLAIR. On T1C, uniform enhancement is visible, measuring approximately 37*29*36 mm. There are patchy areas around it showing low signal on T1W and high signal on T2W and FLAIR. There is no midline shift.",
    "BraTS-MET-00349-000": "On the right frontal lobe, there is an oval-shaped lesion with abnormal signal intensity, presenting with low signal on T1-weighted (T1W) MRI sequences and high signal on T2-weighted (T2W) MRI sequences. On FLAIR sequences, the lesion shows low signal. Surrounding the lesion is a large area of edema signal. After contrast administration (T1C), enhancement is seen around the edges of the lesion, which measures approximately 47*63*53mm. There is no midline shift observed.",
    "BraTS-MET-00350-000": "Multiple abnormal signal nodules are visible in the cerebellum, with the larger ones located in the vermis of the cerebellum, showing high signal on T1W, isointense signal on T2W and FLAIR, with large edema around, and rim enhancement of the lesion on T1C, measuring approximately 50*42*43 mm. No displacement of midline structures.",
    "BraTS-MET-00375-000": "On the right frontal lobe, there are patchy and mass-like abnormal signal shadows, which appear as slightly low signals on T1-weighted images (T1W), mixed signals on T2-weighted images (T2W) and FLAIR sequences, with patchy edema signal observed around. On post-contrast T1 (T1C), there is an enhancement along the edges, measuring approximately 35*55*49 mm. There is no midline shift.",
    "BraTS-MET-00376-000": "In the left temporal lobe, a mass-like abnormal signal is visible, presenting as mixed high and low signals on T1W, T2W, and FLAIR sequences. Surrounding the mass, a large area of edema signal is evident. After enhancement, the solid part of the lesion shows significant enhancement, measuring approximately 57*113*63mm. There is no displacement of midline structures.",
    "BraTS-MET-00378-000": "Small nodular shadows with abnormal signals are observed in the left parietal lobe and the right occipital lobe, exhibiting slightly low signal on T1-weighted images, high signal on T2-weighted images and FLAIR sequences, with obvious perilesional edema. Post-contrast T1 images show enhancement around the edges of the lesions, measuring approximately 34*47*37 mm. There is no midline shift.",
    "BraTS-MET-00379-000": "In the left frontal lobe, there is an approximately round abnormal signal shadow, presenting as hyperintense on T1-weighted imaging, mixed signal on T2-weighted and FLAIR sequences. Surrounding the abnormality, a large area of edema is visible. Post-contrast enhancement shows peripheral enhancement of the lesion, which measures about 45*56*53 mm; Near the midline of the left frontal lobe, an abnormal enhancing nodule is observed, approximately 45*56*53 mm in size. No midline shift is noted.",
    "BraTS-MET-00380-000": "Patchy abnormal signal shadows are seen in the splenium of the corpus callosum and the right parieto-occipital lobe, with the larger lesion located in the right parieto-occipital lobe, crossing the midline locally, and presenting with uneven hyperintense signal on T1-weighted images (T1W), hyperintense signal on T2-weighted images (T2W) and Fluid Attenuated Inversion Recovery (FLAIR) sequence, with extensive perilesional edema signal. Edge enhancement of the lesion is noted on post-contrast T1 images (T1C), measuring approximately 44*56*69mm. No midline shift is observed.",
    "BraTS-MET-00381-000": "A mass-like area of abnormal signal is observed in the right parietal lobe, which appears as a low signal on T1-weighted imaging, a high signal on T2-weighted imaging, and a high signal on FLAIR sequence. The signal inside is uniform, and peripheral ring enhancement can be seen on post-contrast T1-weighted imaging (T1C), with dimensions approximately 44*71*73mm. Adjacent to this, there is flake-like signal characteristics that are isointense on T1-weighted imaging, high signal on T2-weighted imaging, and high signal on FLAIR. There is no midline shift.",
    "BraTS-MET-00382-000": "In the left parietal lobe, there is a mass-like abnormal signal shadow with central low signal and peripheral iso signal on T1W, mixed signal on T2W, iso to low signal on FLAIR, and significant heterogeneous enhancement of the lesion on T1C with surrounding large edematous signal. The dimensions of the lesion are approximately 44*58*60mm. There is no midline shift.",
    "BraTS-MET-00404-000": "Multiple patchy and nodular abnormal signal shadows are seen in both cerebral hemispheres and the right cerebellar hemisphere, with the larger ones located in the left parietal lobe, exhibiting iso- to low signal on T1W, mixed signal on T2W/FLAIR, with a large area of perilesional edema. Post-contrast T1-weighted images show enhancement around the edge of the lesion, measuring approximately 77*104*68mm. The right lateral ventricle is slightly compressed. Midline structures are slightly shifted to the right.",
    "BraTS-MET-00405-000": "Multiple small nodules are observed in both cerebellar hemispheres and the right temporal-occipital lobe, with the larger lesion situated at the junction of the right temporal and occipital lobes. It presents a high signal on the T1-weighted sequence and a high signal on the T2-weighted sequence. The lesion exhibits low signal intensity on FLAIR, with peripheral enhancement visible on T1 post-contrast. The larger lesion measures approximately 58*88*74mm and is surrounded by a patchy area that displays low signal on T1-weighted sequence and high signal on T2-weighted sequence and FLAIR. There is no shift of the midline structures.",
    "BraTS-MET-00406-000": "Abnormal patchy signal changes are observed in both cerebral hemispheres and the cerebellum, displaying slightly hypointense signal on T1-weighted images (T1W), and hyperintense signal on T2-weighted images (T2W) and Fluid Attenuated Inversion Recovery images (FLAIR). There is surrounding edema signal, and after contrast enhancement, significant enhancement is observed. The larger lesions measure approximately 44*60*45 mm in size. No midline shift is present.",
    "BraTS-MET-00407-000": "Multiple patchy and irregular abnormal signal shadows can be seen in the bilateral cerebral hemispheres and cerebellum, with the larger ones located in the left frontal lobe. They appear as isointense to low signal on T1-weighted images, mixed signal on T2-weighted and FLAIR images, with extensive surrounding edema signal. There is uneven enhancement of the lesion on T1 post-contrast (T1C), measuring approximately 46*45*53mm. No midline shift is noted.",
    "BraTS-MET-00408-000": "Multiple punctate and patchy abnormal signals are seen in both cerebral hemispheres, the cerebellum, and the brain stem. A larger lesion is located in the left frontal lobe, exhibiting a slightly low signal on T1-weighted (T1W) imaging, and mixed signals on T2-weighted (T2W) and Fluid Attenuated Inversion Recovery (FLAIR) imaging. Surrounding the lesion is extensive edema, with the lesion's margins showing enhancement on post-contrast T1 (T1C), measuring approximately 38*45*43 mm. No midline shift is observed.",
    "BraTS-MET-00409-000": "Multiple nodular abnormal signals are visible in the left temporal pole and the right frontal parietal lobe, with the larger lesions located in the right frontal lobe, presenting as low signal on T1-weighted images and mixed signal on T2-weighted and FLAIR images. Perilesional edema is observed. After enhancement, lesion margin enhancement is seen, with a size of approximately 22*21*26 mm. No midline shift is observed.",
    "BraTS-MET-00410-000": "A small nodule is seen in the left temporal lobe, exhibiting hyperintense signal on T1-weighted (T1W) imaging, hyperintense signal on T2-weighted (T2W) imaging, hypointense signal on Fluid-Attenuated Inversion Recovery (FLAIR) imaging, and significant enhancement on post-contrast T1 (T1C) imaging, measuring approximately 21*23*28 mm, surrounded by patchy areas showing hypointense signal on T1W, hyperintense signal on T2W, and hyperintense signal on FLAIR. No midline shift is observed.",
    "BraTS-MET-00411-000": "A large abnormal signal shadow is visible in the left occipital lobe, presenting as a low signal on T1W imaging, a high signal on T2W imaging, and a low signal on FLAIR sequence. Perilesional edema is visible. The lesion exhibits significant enhancement on T1C, measuring approximately 36*54*48mm. There is no midline shift.",
    "BraTS-MET-00412-000": "Multiple patchy abnormal signal shadows are seen in the left frontal-parietal lobes and bilateral temporal lobes, with the larger ones located in the left temporal lobe. These are isointense on T1W sequences; slightly hypointense on T2W and FLAIR sequences; and demonstrate perilesional edema. Heterogeneous enhancement of the lesion is noted on T1C sequences, measuring approximately 42*36*51mm. There is no midline shift.",
    "BraTS-MET-00413-000": "A mass-like abnormal signal is seen in the left temporal-occipital lobe, predominantly high signal on T1W, T2W, and FLAIR sequences. After enhancement, the lesion shows some punctate enhancement, measuring approximately 38*27*36 mm. There is no midline shift.",
    "BraTS-MET-00414-000": "A lesion with a quasi-circular abnormal signal is visible in the left cerebellar hemisphere, exhibiting a low signal on T1W images, and slightly high signals on T2W and FLAIR images. There is significant enhancement of the lesion visible on T1C with an approximate size of 26*27*35 mm. There is no displacement of midline structures.",
    "BraTS-MET-00415-000": "Large abnormal signal shadows can be observed in the right parietal lobe and left occipital lobe, presenting as low signal on T1-weighted imaging, and slightly high signal on T2-weighted and FLAIR imaging. An extensive area of edematous signal surrounds the lesion. After enhancement, the lesion shows obvious intensification, with the larger one located in the right parietal lobe, measuring approximately 52*70*78 mm. A small abnormal enhancing nodule can be observed in the right frontal lobe, measuring approximately 52*70*78 mm. There is no shift in midline structures.",
    "BraTS-MET-00416-000": "Multiple abnormal signals are present in the right frontal lobe, temporal lobe, left occipital lobe, and bilateral cerebellar hemispheres. The larger lesions are located in the right frontal lobe, showing low signal on T1-weighted imaging and high signal on T2-weighted imaging. There is a large area of edema signal around the lesion. After enhancement, the solid part of the lesion is significantly enhanced, measuring approximately 56*62*60 mm. No midline shift is observed.",
    "BraTS-MET-00417-000": "In the right frontal lobe, there is an approximately round abnormal signal shadow visible, presenting as a slightly hyperintense signal on T1-weighted images, mixed signal on T2-weighted and FLAIR images with a peripheral low signal rim, and extensive surrounding edema signal. On T1-weighted images with contrast (T1C), peripheral enhancement can be seen, measuring approximately 46*74*50mm. Near the ventricle of the right frontal lobe, there is a similar round abnormal signal shadow, showing as a slightly hypointense signal on T1-weighted imaging, isointense on T2-weighted imaging, and slightly hyperintense on FLAIR. A small amount of surrounding edema signal can also be seen, with the lesion showing significant enhancement after contrast. There is no midline shift.",
    "BraTS-MET-00418-000": "Nodular and patchy abnormal signals are seen in the right frontal lobe and the left occipital lobe, with the larger lesion located in the right frontal lobe. It presents with signals in T1W, T2W, FLAIR sequences and shows perilesional edema. Post-contrast T1 (T1C) imaging reveals a significant enhancement of the lesion, measuring approximately 21*18*28mm. There is no midline shift.",
    "BraTS-MET-00507-000": "Small patches of high signal intensity on FLAIR imaging are seen in the right frontal lobe and left occipital lobe. The larger lesion is located in the right frontal lobe, with prominent enhancement on T1C, measuring approximately 21*18*28 mm. There is no shift of midline structures.",
    "BraTS-MET-00529-000": "Multiple small nodules are seen in the right cerebellum and right frontal lobe, with the larger nodules located in the right cerebellum, exhibiting low signal on T1W, isointense signal on T2W, and slightly hyperintense signal on FLAIR. Within the lesion, punctate high signals are observed on T1W, T2W, and FLAIR. Uneven enhancement is seen on T1C with dimensions approximately 62*51*46 mm. No midline shift.",
    "BraTS-MET-00530-000": "Abnormal mass-like signals are visible in the left frontal and occipital lobes. The larger lesion is located in the left frontal lobe, showing mixed signals on T1W, T2W, and FLAIR sequences. Extensive edema can be seen around it. On T1C, the lesion exhibits uneven enhancement with approximate dimensions of 36*48*47 mm. There is no midline shift.",
    "BraTS-MET-00531-000": "Bilateral frontal lobes exhibit round-like abnormal enhancement nodules measuring approximately 8*8*8mm. No displacement of midline structures.",
    "BraTS-MET-00532-000": "A small abnormal signal shadow on the right frontal lobe, which shows signals on T1W, T2W, FLAIR sequences, with surrounding edema. On T1C, there is evident nodular enhancement of the lesion, measuring approximately 28*30*30mm. There is no midline shift.",
    "BraTS-MET-00533-000": "A nodule-like abnormal signal shadow is visible in the right frontal lobe, presenting with iso-signal on T1W and T2W, and slightly hyperintense signal on FLAIR. After enhancement, the lesion shows obvious enhancement, measuring approximately 32*33*31 mm; in the right occipital lobe, a patchy abnormal signal shadow is visible with low signal on T1W, high signal on T2W and FLAIR. After enhancement, the lesion shows obvious nodular enhancement, measuring approximately 32*33*31 mm, surrounded by non-enhancing edematous zones. There is no displacement of midline structures.",
    "BraTS-MET-00534-000": "A small patch of abnormal signal is visible in the left cerebellar hemisphere, presenting with T1W and T2W isointense signals, slightly hyperintense on FLAIR, mildly enhanced on T1C with the size of approximately 8*15*11mm. There is no midline shift.",
    "BraTS-MET-00535-000": "A mass-like abnormal signal is visible in the left occipital lobe, showing a low signal on T1-weighted images with a slight central high signal, a mixed signal on T2-weighted and FLAIR images, and the presence of extensive surrounding edema. After enhancement, the lesion shows a clearly uneven enhancement, with a size of approximately 48*68*54mm. Small patchy and nodular abnormal signals are visible in the right frontal lobe and brainstem, with the larger lesions located in the right frontal lobe, presenting an isointense signal on T1-weighted, and a high signal on T2-weighted and FLAIR images, with a clear enhancement of the lesion observed on contrast-enhanced T1-weighted images, measuring about 48*68*54mm. There is no shift in midline structures.",
    "BraTS-MET-00536-000": "A mass-like abnormal signal is observed in the vermis of the cerebellum, presenting as an iso- to low signal on T1W images, and hyperintense on T2W and FLAIR images. Perilesional edema is visible. After enhancement, the lesion demonstrates uneven enhancement, measuring approximately 46*56*59 mm. A cystic-solid lesion is visible in the left parietal lobe, with the solid part showing slightly low signal on T1W, iso-signal on T2W, and slightly hyperintense on FLAIR. Perilesional edema is also visible. The solid portion of the lesion shows marked enhancement on T1C, measuring approximately 46*56*59 mm. There is no midline shift.",
    "BraTS-MET-00537-000": "Small patchy abnormal signal foci are observed in the left occipital lobe and the vermis of the cerebellum, showing isointense signal on T1W and T2W sequences, slightly hyperintense on FLAIR sequence, with obvious enhancement post-contrast administration. The largest of these is located in the left occipital lobe, measuring approximately 12*13*15 mm. No midline shift is noted.",
    "BraTS-MET-00538-000": "A small nodular abnormal signal is observed in the left occipital lobe, showing isointense on T1-weighted images and slightly hyperintense on T2-weighted and FLAIR sequences. Post-contrast enhancement reveals a ring-enhancing lesion with dimensions of approximately 13*11*18 mm. There is no shift of midline structures.",
    "BraTS-MET-00539-000": "A small patch of abnormal signal can be seen in the left frontal lobe, which appears as isointense on T1W images, slightly hyperintense on T2W images, hyperintense on FLAIR images, and shows significant enhancement after contrast (T1C) with approximate dimensions of 10*11*10 mm. There is no midline shift observed.",
    "BraTS-MET-00540-000": "Abnormal enhancement nodules are visible in the left occipital lobe and right cerebellar hemisphere, approximately 7*7*12 mm in size. There is no shift of midline structures.",
    "BraTS-MET-00541-000": "A mass-like abnormal signal is visible in the left cerebellar hemisphere, presenting with mixed high signal intensity on T1-weighted images, and mixed low signal intensity on T2-weighted and FLAIR sequences. There is extensive surrounding edema, and the lesion shows uneven enhancement post-contrast T1, measuring approximately 64*53*50 mm. No midline shift is observed.",
    "BraTS-MET-00542-000": "Large abnormal signal shadows are visible in the right occipital lobe and bilateral cerebellar hemispheres, with the largest located in the right cerebellar hemisphere, measuring approximately 100*55*47mm. It shows low signal on T1W, mixed high and low signal on T2W, and isointense to low signal on FLAIR. Peritumoral edema is observed, and the lesion displays uneven enhancement post-contrast with dimensions of about 100*55*47mm. There is no midline shift.",
    "BraTS-MET-00543-000": "Multiple nodular and patchy abnormal signal foci are observed in the left frontal lobe, bilateral parietal lobes, and the vermis of the cerebellum, with the larger ones located in the left frontal lobe presenting as slightly hypointense on T1W, mixed signal on T2W and FLAIR, surrounded by extensive edema signal. After enhancement, the lesion shows obvious peripheral enhancement, measuring approximately 35*56*52 mm. There is no shift of midline structures.",
    "BraTS-MET-00544-000": "A nodular lesion with abnormal signal is present in the right external capsule area, exhibiting high signal on T1W, isointense signal on T2W, and low signal on FLAIR. There is no evident enhancement post-contrast, approximately 8*7*8 mm in size. There is no shift in midline structures.",
    "BraTS-MET-00545-000": "Multiple nodular and mass-like lesions with abnormal signals are observed in both the frontal and parietal lobes, as well as in the right cerebellar hemisphere. The larger lesion is located at the junction of the right frontal and parietal lobes, which exhibits mixed signals on T1W and T2W sequences. Surrounding the tumor, extensive edema is observable. After enhancement, marked uneven enhancement is evident, with dimensions approximately 50*41*53 mm; there is no shift of midline structures.",
    "BraTS-MET-00546-000": "An abnormal enhancing nodule is visible in the right parietal lobe, measuring approximately 6*4*6 mm. There is no shift of midline structures.",
    "BraTS-MET-00547-000": "Multiple small nodules are observed in both frontal and parietal lobes, as well as the right occipital lobe. The largest nodule, located in the right occipital lobe, presents with a T1-weighted low signal, a T2-weighted high signal, and is hyperintense on FLAIR sequences. On T1 post-contrast (T1C) imaging, ring enhancement is noted around the edges of the lesion, with dimensions approximately 24*28*33 mm. Adjacent to the lesion, there are strip-like areas that show T1-weighted low signal and T2-weighted high signal, and are hyperintense on FLAIR. There is no midline shift observed.",
    "BraTS-MET-00548-000": "In the left parietal lobe, there is a small area of abnormal signal observed, which appears as slightly hypointense on T1-weighted images, slightly hyperintense on T2-weighted and FLAIR sequences, with marked enhancement of the lesion post-contrast (T1C), measuring approximately 16*10*10 mm. There is no midline shift.",
    "BraTS-MET-00549-000": "A small nodule is seen in the left frontal lobe, displaying a high signal on T1-weighted images, a low signal on T2-weighted images, and a low signal on FLAIR. There is obvious enhancement on T1-weighted images post-contrast, with dimensions of approximately 7*6*6 mm. There is no shift of midline structures.",
    "BraTS-MET-00550-000": "At the junction of the left frontal and parietal lobes, an abnormal signal nodule can be observed. It presents as isointense on T1-weighted images, hypointense on T2-weighted images, and isointense on FLAIR sequences. A large area of edema signal is visible around it. After contrast enhancement (T1C), the lesion shows obvious enhancement, with dimensions of approximately 53*83*67 mm. A small nodular abnormal signal can be seen in the left frontal lobe, presenting as isointense on T1-weighted and hyperintense on T2-weighted and FLAIR sequences. After enhancement, it shows obvious enhancement, with dimensions of approximately 53*83*67 mm. There is no midline shift.",
    "BraTS-MET-00551-000": "A small abnormal signal is observed in the left frontal lobe, showing iso-intense on T1-weighted images, and slightly hyperintense on T2-weighted images and FLAIR sequences. Mild enhancement of the lesion is seen on the T1-weighted image with contrast (T1C), measuring approximately 14*10*15 mm. No midline shift is noted.",
    "BraTS-MET-00552-000": "Multiple small nodules are seen in the right temporal lobe and the left frontal lobe. The larger lesion is located in the left frontal lobe, which exhibits a low signal on T1-weighted (T1W) images, is iso- to slightly hyperintense on T2-weighted (T2W) images, and slightly hyperintense on Fluid-attenuated inversion recovery (FLAIR) sequences. After contrast administration (T1C), the lesion shows marked and inhomogeneous enhancement with approximate dimensions of 51*60*54 mm. Around this lesion, there are flake-like areas showing low signal on T1W, and high signal on T2W and FLAIR images. There is no shift in midline structures."
}